xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_apm32f4xx.h"
#include <stdint.h>

/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief Analog to Digital Converter
  */

typedef struct
{
  __IO uint32_t STS;      /*!< ADC status register,                         Address offset: 0x00 */
  __IO uint32_t CTRL1;    /*!< ADC control register 1,                      Address offset: 0x04 */
  __IO uint32_t CTRL2;    /*!< ADC control register 2,                      Address offset: 0x08 */
  __IO uint32_t SMPTIM1;  /*!< ADC sample time register 1,                  Address offset: 0x0C */
  __IO uint32_t SMPTIM2;  /*!< ADC sample time register 2,                  Address offset: 0x10 */
  __IO uint32_t INJDOF1;  /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
  __IO uint32_t INJDOF2;  /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
  __IO uint32_t INJDOF3;  /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
  __IO uint32_t INJDOF4;  /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
  __IO uint32_t AWDHT;    /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
  __IO uint32_t AWDLT;    /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
  __IO uint32_t REGSEQ1;  /*!< ADC regular sequence register 1,             Address offset: 0x2C */
  __IO uint32_t REGSEQ2;  /*!< ADC regular sequence register 2,             Address offset: 0x30 */
  __IO uint32_t REGSEQ3;  /*!< ADC regular sequence register 3,             Address offset: 0x34 */
  __IO uint32_t INJSEQ;   /*!< ADC injected sequence register,              Address offset: 0x38 */
  __IO uint32_t INJDATA1; /*!< ADC injected data register 1,                Address offset: 0x3C */
  __IO uint32_t INJDATA2; /*!< ADC injected data register 2,                Address offset: 0x40 */
  __IO uint32_t INJDATA3; /*!< ADC injected data register 3,                Address offset: 0x44 */
  __IO uint32_t INJDATA4; /*!< ADC injected data register 4,                Address offset: 0x48 */
  __IO uint32_t REGDATA;  /*!< ADC regular data register,                   Address offset: 0x4C */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t STS;      /*!< ADC status register,                         Address offset: 0x00, used for ADC multimode */
  __IO uint32_t CTRL1;    /*!< ADC control register 1,                      Address offset: 0x04, used for ADC multimode */
  __IO uint32_t CTRL2;    /*!< ADC control register 2,                      Address offset: 0x08, used for ADC multimode */
  uint32_t RESERVED[16];  /*!< Reserved, 0x0C-0x48 */
  __IO uint32_t REGDATA;  /*!< ADC regular data register,                   Address offset: 0x4C, used for ADC multimode */
} ADC_Common_TypeDef;

/**
  * @brief B
  */

typedef struct
{
  uint32_t RESERVED0;     /*!< Reserved, 0x00 */
  __IO uint32_t DATA1;    /*!< BKP data register 1, Address offset: 0x04 */
  __IO uint32_t DATA2;    /*!< BKP data register 2, Address offset: 0x08 */
  __IO uint32_t DATA3;    /*!< BKP data register 3, Address offset: 0x0C */
  __IO uint32_t DATA4;    /*!< BKP data register 4, Address offset: 0x10 */
  __IO uint32_t DATA5;    /*!< BKP data register 5, Address offset: 0x14 */
  __IO uint32_t DATA6;    /*!< BKP data register 6, Address offset: 0x18 */
  __IO uint32_t DATA7;    /*!< BKP data register 7, Address offset: 0x1C */
  __IO uint32_t DATA8;    /*!< BKP data register 8, Address offset: 0x20 */
  __IO uint32_t DATA9;    /*!< BKP data register 9, Address offset: 0x24 */
  __IO uint32_t DATA10;   /*!< BKP data register 10, Address offset: 0x28 */
  __IO uint32_t CLKCAL;   /*!< BKP clock calibration register, Address offset: 0x2C */
  __IO uint32_t CTRL;     /*!< BKP control register, Address offset: 0x30 */
  __IO uint32_t CSTS;     /*!< BKP control/status register, Address offset: 0x34 */
  uint32_t RESERVED1[2];  /*!< Reserved, 0x38-0x3C */
  __IO uint32_t DATA11;   /*!< BKP data register 11, Address offset: 0x40 */
  __IO uint32_t DATA12;   /*!< BKP data register 12, Address offset: 0x44 */
  __IO uint32_t DATA13;   /*!< BKP data register 13, Address offset: 0x48 */
  __IO uint32_t DATA14;   /*!< BKP data register 14, Address offset: 0x4C */
  __IO uint32_t DATA15;   /*!< BKP data register 15, Address offset: 0x50 */
  __IO uint32_t DATA16;   /*!< BKP data register 16, Address offset: 0x54 */
  __IO uint32_t DATA17;   /*!< BKP data register 17, Address offset: 0x58 */
  __IO uint32_t DATA18;   /*!< BKP data register 18, Address offset: 0x5C */
  __IO uint32_t DATA19;   /*!< BKP data register 19, Address offset: 0x60 */
  __IO uint32_t DATA20;   /*!< BKP data register 20, Address offset: 0x64 */
  __IO uint32_t DATA21;   /*!< BKP data register 21, Address offset: 0x68 */
  __IO uint32_t DATA22;   /*!< BKP data register 22, Address offset: 0x6C */
  __IO uint32_t DATA23;   /*!< BKP data register 23, Address offset: 0x70 */
  __IO uint32_t DATA24;   /*!< BKP data register 24, Address offset: 0x74 */
  __IO uint32_t DATA25;   /*!< BKP data register 25, Address offset: 0x78 */
  __IO uint32_t DATA26;   /*!< BKP data register 26, Address offset: 0x7C */
  __IO uint32_t DATA27;   /*!< BKP data register 27, Address offset: 0x80 */
  __IO uint32_t DATA28;   /*!< BKP data register 28, Address offset: 0x84 */
  __IO uint32_t DATA29;   /*!< BKP data register 29, Address offset: 0x88 */
  __IO uint32_t DATA30;   /*!< BKP data register 30, Address offset: 0x8C */
  __IO uint32_t DATA31;   /*!< BKP data register 31, Address offset: 0x90 */
  __IO uint32_t DATA32;   /*!< BKP data register 32, Address offset: 0x94 */
  __IO uint32_t DATA33;   /*!< BKP data register 33, Address offset: 0x98 */
  __IO uint32_t DATA34;   /*!< BKP data register 34, Address offset: 0x9C */
  __IO uint32_t DATA35;   /*!< BKP data register 35, Address offset: 0xA0 */
  __IO uint32_t DATA36;   /*!< BKP data register 36, Address offset: 0xA4 */
  __IO uint32_t DATA37;   /*!< BKP data register 37, Address offset: 0xA8 */
  __IO uint32_t DATA38;   /*!< BKP data register 38, Address offset: 0xAC */
  __IO uint32_t DATA39;   /*!< BKP data register 39, Address offset: 0xB0 */
  __IO uint32_t DATA40;   /*!< BKP data register 40, Address offset: 0xB4 */
  __IO uint32_t DATA41;   /*!< BKP data register 41, Address offset: 0xB8 */
  __IO uint32_t DATA42;   /*!< BKP data register 42, Address offset: 0xBC */
} BAKPR_TypeDef;

/**
  * @brief Controller Area Network TxMailBox
  */

typedef struct
{
  __IO uint32_t TXMID;  /*!< CAN TX mailbox identifier register */
  __IO uint32_t TXDLEN; /*!< CAN mailbox data length control and time stamp register */
  __IO uint32_t TXMDL;  /*!< CAN mailbox data low register */
  __IO uint32_t TXMDH;  /*!< CAN mailbox data high register */
} CAN_TxMailBox_TypeDef;

/**
  * @brief Controller Area Network FIFOMailBox
  */

typedef struct
{
  __IO uint32_t RXMID;  /*!< CAN receive FIFO mailbox identifier register */
  __IO uint32_t RXDLEN; /*!< CAN receive FIFO mailbox data length control and time stamp register */
  __IO uint32_t RXMDL;  /*!< CAN receive FIFO mailbox data low register */
  __IO uint32_t RXMDH;  /*!< CAN receive FIFO mailbox data high register */
} CAN_FIFOMailBox_TypeDef;

/**
  * @brief Controller Area Network FilterRegister
  */

typedef struct
{
  __IO uint32_t FBANK1; /*!< CAN Filter bank register 1 */
  __IO uint32_t FBANK2; /*!< CAN Filter bank register 1 */
} CAN_FilterRegister_TypeDef;

/**
  * @brief Controller Area Network
  */

typedef struct
{
  __IO uint32_t              MCTRL;               /*!< CAN master control register,         Address offset: 0x00          */
  __IO uint32_t              MSTS;                /*!< CAN master status register,          Address offset: 0x04          */
  __IO uint32_t              TXSTS;               /*!< CAN transmit status register,        Address offset: 0x08          */
  __IO uint32_t              RXF0;                /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
  __IO uint32_t              RXF1;                /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
  __IO uint32_t              INTEN;               /*!< CAN interrupt enable register,       Address offset: 0x14          */
  __IO uint32_t              ERRSTS;              /*!< CAN error status register,           Address offset: 0x18          */
  __IO uint32_t              BITTIM;              /*!< CAN bit timing register,             Address offset: 0x1C          */
  uint32_t                   RESERVED0[88];       /*!< Reserved, 0x020 - 0x17F                                            */
  CAN_TxMailBox_TypeDef      sTxMailBox[3];       /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
  CAN_FIFOMailBox_TypeDef    sFIFOMailBox[2];     /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
  uint32_t                   RESERVED1[12];       /*!< Reserved, 0x1D0 - 0x1FF                                            */
  __IO uint32_t              FCTRL;               /*!< CAN filter master register,          Address offset: 0x200         */
  __IO uint32_t              FMCFG;               /*!< CAN filter mode register,            Address offset: 0x204         */
  uint32_t                   RESERVED2;           /*!< Reserved, 0x208                                                    */
  __IO uint32_t              FSCFG;               /*!< CAN filter scale register,           Address offset: 0x20C         */
  uint32_t                   RESERVED3;           /*!< Reserved, 0x210                                                    */
  __IO uint32_t              FFASS;               /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
  uint32_t                   RESERVED4;           /*!< Reserved, 0x218                                                    */
  __IO uint32_t              FACT;                /*!< CAN filter activation register,      Address offset: 0x21C         */
  uint32_t                   RESERVED5[8];        /*!< Reserved, 0x220-0x23F                                              */
  CAN_FilterRegister_TypeDef sFilterRegister[28]; /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */
} CAN_TypeDef;

/**
  * @brief CRC calculation unit
  */

typedef struct
{
  __IO uint32_t DATA;       /*!< CRC Data register,             Address offset: 0x00 */
  __IO uint8_t  INDATA;     /*!< CRC Independent data register, Address offset: 0x04 */
  uint8_t       RESERVED0;  /*!< Reserved, 0x05                                      */
  uint16_t      RESERVED1;  /*!< Reserved, 0x06                                      */
  __IO uint32_t CTRL;       /*!< CRC Control register,          Address offset: 0x08 */
} CRC_TypeDef;

/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t IDCODE;   /*!< MCU device ID code,               Address offset: 0x00 */
  __IO uint32_t CFG;      /*!< Debug MCU configuration register, Address offset: 0x04 */
} DBGMCU_TypeDef;


/**
  * @brief DMA Controller
  */

typedef struct
{
  __IO uint32_t CHCFG;    /*!< DMA channel x configuration register */
  __IO uint32_t CHNDATA;  /*!< DMA channel x number of data register */
  __IO uint32_t CHPADDR;  /*!< DMA channel x peripheral address register */
  __IO uint32_t CHMADDR;  /*!< DMA channel x memory address register */
} DMA_Channel_TypeDef;

typedef struct
{
  __IO uint32_t INTSTS;   /*!< DMA interrupt status register, Address offset: 0x00 */
  __IO uint32_t INTFCLR;  /*!< DMA interrupt flag clear register, Address offset: 0x04 */
} DMA_TypeDef;

/**
  * @brief External Interrupt/Event Controller
  */

typedef struct
{
  __IO uint32_t IMASK;    /*!< EINT Interrupt mask register,            Address offset: 0x00 */
  __IO uint32_t EMASK;    /*!< EINT Event mask register,                Address offset: 0x04 */
  __IO uint32_t RTEN;     /*!< EINT Rising trigger selection register,  Address offset: 0x08 */
  __IO uint32_t FTEN;     /*!< EINT Falling trigger selection register, Address offset: 0x0C */
  __IO uint32_t SWINTE;   /*!< EINT Software interrupt event register,  Address offset: 0x10 */
  __IO uint32_t IPEND;    /*!< EINT Pending register,                   Address offset: 0x14 */
} EINT_TypeDef;

/**
  * @brief FLASH Registers
  */

typedef struct
{
  __IO uint32_t CTRL1;    /*!< FLASH access control register 1,     Address offset: 0x00 */
  __IO uint32_t KEY;      /*!< FLASH key register,                  Address offset: 0x04 */
  __IO uint32_t OPTKEY;   /*!< FLASH option key register,           Address offset: 0x08 */
  __IO uint32_t STS;      /*!< FLASH status register,               Address offset: 0x0C */
  __IO uint32_t CTRL2;    /*!< FLASH control register 2,            Address offset: 0x10 */
  __IO uint32_t ADDR;     /*!< FLASH address register,              Address offset: 0x14 */
  uint32_t      RESERVED; /*!< Reserved,                            Address offset: 0x18 */
  __IO uint32_t OBCS;     /*!< FLASH option byte control register,  Address offset: 0x1C */
  __IO uint32_t WRTPROT;  /*!< FLASH write protection register,     Address offset: 0x20 */
} FLASH_TypeDef;

/**
  * @brief Option Bytes Registers
  */

typedef struct
{
  __IO uint16_t READPROT;   /*!< FLASH option byte read protection register */
  __IO uint16_t UOB;        /*!< FLASH user option byte register */
  __IO uint16_t Data0;      /*!< FLASH option byte data 0 register */
  __IO uint16_t Data1;      /*!< FLASH option byte data 1 register */
  __IO uint16_t WRP0;       /*!< FLASH option byte write protection 0 register */
  __IO uint16_t WRP1;       /*!< FLASH option byte write protection 1 register */
  __IO uint16_t WRP2;       /*!< FLASH option byte write protection 2 register */
  __IO uint16_t WRP3;       /*!< FLASH option byte write protection 3 register */
} OB_TypeDef;

/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t CFGLOW;   /*!< GPIO port configuration low register,  Address offset: 0x00 */
  __IO uint32_t CFGHIG;   /*!< GPIO port configuration high register, Address offset: 0x04 */
  __IO uint32_t IDATA;    /*!< GPIO port input data register,         Address offset: 0x08 */
  __IO uint32_t ODATA;    /*!< GPIO port output data register,        Address offset: 0x0C */
  __IO uint32_t BSC;      /*!< GPIO port bit set/clear register,      Address offset: 0x10 */
  __IO uint32_t BC;       /*!< GPIO port bit clear register,          Address offset: 0x14 */
  __IO uint32_t LOCK;     /*!< GPIO port configuration lock register, Address offset: 0x18 */
} GPIO_TypeDef;

/**
  * @brief Alternate Function I/O
  */

typedef struct
{
  __IO uint32_t EVCTRL;     /*!< AFIO Event control register, Address offset: 0x00 */
  __IO uint32_t REMAP1;     /*!< AFIO remap register 1,       Address offset: 0x04 */
  __IO uint32_t EINTSEL[4]; /*!< AFIO external interrupt selection register 1, Address offset: 0x08 - 0x14 */
  uint32_t      RESERVED0;  /*!< Reserved, 0x18 */
} AFIO_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< I2C Control register 1,     Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< I2C Control register 2,     Address offset: 0x04 */
  __IO uint32_t SADDR1;     /*!< I2C Own address register 1, Address offset: 0x08 */
  __IO uint32_t SADDR2;     /*!< I2C Own address register 2, Address offset: 0x0C */
  __IO uint32_t DATA;       /*!< I2C Data register,          Address offset: 0x10 */
  __IO uint32_t STS1;       /*!< I2C Status register 1,      Address offset: 0x14 */
  __IO uint32_t STS2;       /*!< I2C Status register 2,      Address offset: 0x18 */
  __IO uint32_t CLKCTRL;    /*!< I2C Clock control register, Address offset: 0x1C */
  __IO uint32_t RISETMAX;   /*!< I2C RISETMAX register,      Address offset: 0x20 */
} I2C_TypeDef;

/**
  * @brief Independent WATCHDOG
  */

typedef struct
{
  __IO uint32_t KEY;    /*!< IWDT Key register,       Address offset: 0x00 */
  __IO uint32_t PSC;    /*!< IWDT Prescaler register, Address offset: 0x04 */
  __IO uint32_t CNTRLD; /*!< IWDT Reload register,    Address offset: 0x08 */
  __IO uint32_t STS;    /*!< IWDT Status register,    Address offset: 0x0C */
} IWDT_TypeDef;


/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CTRL; /*!< PMU power control register,        Address offset: 0x00 */
  __IO uint32_t CSTS; /*!< PMU power control/status register, Address offset: 0x04 */
} PMU_TypeDef;

/**
  * @brief Reset and Clock Control
  */

typedef struct
{
  __IO uint32_t CTRL;           /*!< RCM clock control register,                                  Address offset: 0x00 */
  __IO uint32_t CFG;            /*!< RCM clock configuration register,                            Address offset: 0x04 */
  __IO uint32_t INT;            /*!< RCM clock interrupt register,                                Address offset: 0x08 */
  __IO uint32_t APB2RST;        /*!< RCM APB2 peripheral reset register,                          Address offset: 0x0C */
  __IO uint32_t APB1RST;        /*!< RCM APB1 peripheral reset register,                          Address offset: 0x10 */
  __IO uint32_t AHB1CLKEN;      /*!< RCM AHB1 peripheral clock enable register,                   Address offset: 0x14 */
  __IO uint32_t APB2CLKEN;      /*!< RCM APB2 peripheral clock enable register,                   Address offset: 0x18 */
  __IO uint32_t APB1CLKEN;      /*!< RCM APB1 peripheral clock enable register,                   Address offset: 0x1C */
  __IO uint32_t BDCTRL;         /*!< RCM backup domain control register,                          Address offset: 0x20 */
  __IO uint32_t CSTS;           /*!< RCM clock control/status register,                           Address offset: 0x24 */
  __IO uint32_t AHB1RST;        /*!< RCM AHB1 peripheral reset register,                          Address offset: 0x28 */
} RCM_TypeDef;

/**
  * @brief Real-Time Clock
  */

typedef struct
{
  __IO uint32_t CTRL;     /*!< RTC control register,    Address offset: 0x00 */
  __IO uint32_t CSTS;     /*!< RTC status register,     Address offset: 0x04 */
  __IO uint32_t PSCRLDH;  /*!< RTC prescaler high register, Address offset: 0x08 */
  __IO uint32_t PSCRLDL;  /*!< RTC prescaler low register,  Address offset: 0x0C */
  __IO uint32_t PSCH;     /*!< RTC prescaler high register, Address offset: 0x10 */
  __IO uint32_t PSCL;     /*!< RTC prescaler low register,  Address offset: 0x14 */
  __IO uint32_t CNTH;     /*!< RTC counter high register,   Address offset: 0x18 */
  __IO uint32_t CNTL;     /*!< RTC counter low register,    Address offset: 0x1C */
  __IO uint32_t ALRH;     /*!< RTC alarm high register,     Address offset: 0x20 */
  __IO uint32_t ALRL;     /*!< RTC alarm low register,      Address offset: 0x24 */
} RTC_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< SPI control register 2,                             Address offset: 0x04 */
  __IO uint32_t STS;        /*!< SPI status register,                                Address offset: 0x08 */
  __IO uint32_t DATA;       /*!< SPI data register,                                  Address offset: 0x0C */
  __IO uint32_t CRCPOLY;    /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  __IO uint32_t RXCRC;      /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  __IO uint32_t TXCRC;      /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  __IO uint32_t I2SCFG;     /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  __IO uint32_t I2SPSC;     /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
} SPI_TypeDef;


/**
  * @brief TMR
  */

typedef struct
{
  __IO uint32_t CTRL1;        /*!< TMR control register 1,              Address offset: 0x00 */
  __IO uint32_t CTRL2;        /*!< TMR control register 2,              Address offset: 0x04 */
  __IO uint32_t SMCTRL;       /*!< TMR slave mode control register,     Address offset: 0x08 */
  __IO uint32_t DIEN;         /*!< TMR DMA/interrupt enable register,   Address offset: 0x0C */
  __IO uint32_t STS;          /*!< TMR status register,                 Address offset: 0x10 */
  __IO uint32_t CEG;          /*!< TMR event generation register,       Address offset: 0x14 */
  __IO uint32_t CCM1;         /*!< TMR capture/compare mode register 1, Address offset: 0x18 */
  __IO uint32_t CCM2;         /*!< TMR capture/compare mode register 2, Address offset: 0x1C */
  __IO uint32_t CCEN;         /*!< TMR capture/compare enable register, Address offset: 0x20 */
  __IO uint32_t CNT;          /*!< TMR counter register,                Address offset: 0x24 */
  __IO uint32_t PSC;          /*!< TMR prescaler,                       Address offset: 0x28 */
  __IO uint32_t AUTORLD;      /*!< TMR auto-reload register,            Address offset: 0x2C */
  __IO uint32_t REPCNT;       /*!< TMR repetition counter register,     Address offset: 0x30 */
  __IO uint32_t CC1;          /*!< TMR capture/compare register 1,      Address offset: 0x34 */
  __IO uint32_t CC2;          /*!< TMR capture/compare register 2,      Address offset: 0x38 */
  __IO uint32_t CC3;          /*!< TMR capture/compare register 3,      Address offset: 0x3C */
  __IO uint32_t CC4;          /*!< TMR capture/compare register 4,      Address offset: 0x40 */
  __IO uint32_t BDT;          /*!< TMR break and dead-time register,    Address offset: 0x44 */
  __IO uint32_t DCTRL;        /*!< TMR DMA control register,            Address offset: 0x48 */
  __IO uint32_t DMADDR;       /*!< TMR DMA address for full transfer,   Address offset: 0x4C */
  __IO uint32_t OPT;          /*!< TMR option register,                 Address offset: 0x50 */
} TMR_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

typedef struct
{
  __IO uint32_t STS;        /*!< USART Status register,                   Address offset: 0x00 */
  __IO uint32_t DATA;       /*!< USART Data register,                     Address offset: 0x04 */
  __IO uint32_t BR;         /*!< USART Baud rate register,                Address offset: 0x08 */
  __IO uint32_t CTRL1;      /*!< USART Control register 1,                Address offset: 0x0C */
  __IO uint32_t CTRL2;      /*!< USART Control register 2,                Address offset: 0x10 */
  __IO uint32_t CTRL3;      /*!< USART Control register 3,                Address offset: 0x14 */
  __IO uint32_t GTPSC;      /*!< USART Guard time and prescaler register, Address offset: 0x18 */
} USART_TypeDef;

/**
  * @brief Window WATCHDOG
  */

typedef struct
{
  __IO uint32_t CTRL; /*!< WWDT Control register,       Address offset: 0x00 */
  __IO uint32_t CFG;  /*!< WWDT Configuration register, Address offset: 0x04 */
  __IO uint32_t STS;  /*!< WWDT Status register,        Address offset: 0x08 */
} WWDT_TypeDef;

