xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/**
  * @brief USB_OTG_Core_Registers
  */
typedef struct
{
  __IO uint32_t GCTRLSTS;             /*!< USB_OTG Control and Status Register          000h */
  __IO uint32_t GINT;                 /*!< USB_OTG Interrupt Register                   004h */
  __IO uint32_t GAHBCFG;              /*!< Core AHB Configuration Register              008h */
  __IO uint32_t GUSBCFG;              /*!< Core USB Configuration Register              00Ch */
  __IO uint32_t GRSTCTRL;             /*!< Core Reset Register                          010h */
  __IO uint32_t GCINT;                /*!< Core Interrupt Register                      014h */
  __IO uint32_t GINTMASK;             /*!< Core Interrupt Mask Register                 018h */
  __IO uint32_t GRXSTS;               /*!< Receive Sts Q Read Register                  01Ch */
  __IO uint32_t GRXSTSP;              /*!< Receive Sts Q Read & POP Register            020h */
  __IO uint32_t GRXFIFO;              /*!< Receive FIFO Size Register                   024h */
  __IO uint32_t GTXFCFG;              /*!< EP0 / Non Periodic Tx FIFO Size Register     028h */
  __IO uint32_t GNPTXFQSTS;           /*!< Non Periodic Tx FIFO/Queue Sts reg           02Ch */
  uint32_t Reserved30[2];             /*!< Reserved                                     030h */
  __IO uint32_t GGCCFG;               /*!< General Purpose IO Register                  038h */
  __IO uint32_t GCID;                 /*!< User ID Register                             03Ch */
  uint32_t  Reserved40[48];           /*!< Reserved                                0x40-0xFF */
  __IO uint32_t GHPTXFSIZE;           /*!< Host Periodic Tx FIFO Size Reg               100h */
  __IO uint32_t DTXFIFO[0x0F];        /*!< dev Periodic Transmit FIFO                        */
} USB_OTG_GlobalTypeDef;

/**
  * @brief USB_OTG_device_Registers
  */
typedef struct
{
  __IO uint32_t DCFG;           /*!< dev Configuration Register   800h */
  __IO uint32_t DCTRL;          /*!< dev Control Register         804h */
  __IO uint32_t DSTS;           /*!< dev Status Register (RO)     808h */
  uint32_t Reserved0C;          /*!< Reserved                     80Ch */
  __IO uint32_t DINIMASK;       /*!< dev IN Endpoint Mask         810h */
  __IO uint32_t DOUTIMASK;      /*!< dev OUT Endpoint Mask        814h */
  __IO uint32_t DAEPINT;        /*!< dev All Endpoints Itr Reg    818h */
  __IO uint32_t DAEPIMASK;      /*!< dev All Endpoints Itr Mask   81Ch */
  uint32_t  Reserved20;         /*!< Reserved                     820h */
  uint32_t Reserved9;           /*!< Reserved                     824h */
  __IO uint32_t DVBUSDTIM;      /*!< dev VBUS discharge Register  828h */
  __IO uint32_t DVBUSPTIM;      /*!< dev VBUS Pulse Register      82Ch */
  __IO uint32_t DTHCTRL;        /*!< dev threshold                830h */
  __IO uint32_t DIEIMASK;       /*!< dev empty msk                834h */
  __IO uint32_t DEPINT;         /*!< dedicated EP interrupt       838h */
  __IO uint32_t DEPIMASK;       /*!< dedicated EP msk             83Ch */
  uint32_t Reserved40;          /*!< dedicated EP mask            840h */
  __IO uint32_t DIN1IMASK;      /*!< dedicated EP mask            844h */
  uint32_t  Reserved44[15];     /*!< Reserved                 844-87Ch */
  __IO uint32_t DOUT1MASK;      /*!< dedicated EP msk             884h */
} USB_OTG_DeviceTypeDef;

/**
  * @brief USB_OTG_IN_Endpoint-Specific_Register
  */
typedef struct
{
  __IO uint32_t DIEPCTRL;         /*!< dev IN Endpoint Control Reg    900h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;            /*!< Reserved                       900h + (ep_num * 20h) + 04h */
  __IO uint32_t DIEPINT;          /*!< dev IN Endpoint Itr Reg        900h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;            /*!< Reserved                       900h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DIEPTRS;          /*!< IN Endpoint Txfer Size         900h + (ep_num * 20h) + 10h */
  __IO uint32_t DIEPDMA;          /*!< IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h */
  __IO uint32_t DITXFSTS;         /*!< IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h */
  uint32_t Reserved18;            /*!< Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

/**
  * @brief USB_OTG_OUT_Endpoint-Specific_Registers
  */
typedef struct
{
  __IO uint32_t DOEPCTRL;       /*!< dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;          /*!< Reserved                               B00h + (ep_num * 20h) + 04h */
  __IO uint32_t DOEPINT;        /*!< dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;          /*!< Reserved                               B00h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DOEPTRS;        /*!< dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h */
  __IO uint32_t DOEPDMA;        /*!< dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h */
  uint32_t Reserved18[2];       /*!< Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_OTG_OUTEndpointTypeDef;

/**
  * @brief USB_OTG_Host_Mode_Register_Structures
  */
typedef struct
{
  __IO uint32_t HCFG;             /*!< Host Configuration Register          400h */
  __IO uint32_t HFIVL;            /*!< Host Frame Interval Register         404h */
  __IO uint32_t HFIFM;            /*!< Host Frame Nbr/Frame Remaining       408h */
  uint32_t Reserved40C;           /*!< Reserved                             40Ch */
  __IO uint32_t HPTXSTS;          /*!< Host Periodic Tx FIFO/ Queue Status  410h */
  __IO uint32_t HACHINT;          /*!< Host All Channels Interrupt Register 414h */
  __IO uint32_t HACHIMASK;        /*!< Host All Channels Interrupt Mask     418h */
} USB_OTG_HostTypeDef;

/**
  * @brief USB_OTG_Host_Channel_Specific_Registers
  */
typedef struct
{
  __IO uint32_t HCH;              /*!< Host Channel Characteristics Register    500h */
  __IO uint32_t HCHSCTRL;         /*!< Host Channel Split Control Register      504h */
  __IO uint32_t HCHINT;           /*!< Host Channel Interrupt Register          508h */
  __IO uint32_t HCHIMASK;         /*!< Host Channel Interrupt Mask Register     50Ch */
  __IO uint32_t HCHTSIZE;         /*!< Host Channel Transfer Size Register      510h */
  __IO uint32_t HCHDMA;           /*!< Host Channel DMA Address Register        514h */
  uint32_t Reserved[2];           /*!< Reserved                                      */
} USB_OTG_HostChannelTypeDef;

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */
#define FLASH_BASE            0x08000000UL /*!< FLASH base address in the alias region                                     */
#define FLASH_END             0x0801FFFFUL /*!< FLASH end address                                                          */
#define SRAM_BASE             0x20000000UL /*!< SRAM base address in the alias region                                      */
#define PERIPH_BASE           0x40000000UL /*!< Peripheral base address in the alias region                                */

#define SRAM_BB_BASE          0x22000000UL /*!< SRAM base address in the bit-band region                                   */
#define PERIPH_BB_BASE        0x42000000UL /*!< Peripheral base address in the bit-band region                             */
#define BKPSRAM_BB_BASE       0x42480000UL /*!< Backup SRAM(4 KB) base address in the bit-band region                      */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000UL)

/*!< APB1 peripherals */
#define TMR2_BASE             (APB1PERIPH_BASE + 0x0000UL)
#define TMR3_BASE             (APB1PERIPH_BASE + 0x0400UL)
#define TMR4_BASE             (APB1PERIPH_BASE + 0x0800UL)
#define TMR5_BASE             (APB1PERIPH_BASE + 0x0C00UL)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800UL)
#define WWDT_BASE             (APB1PERIPH_BASE + 0x2C00UL)
#define IWDT_BASE             (APB1PERIPH_BASE + 0x3000UL)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800UL)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800UL)
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00UL)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400UL)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x6400UL)
#define CAN2_BASE             (APB1PERIPH_BASE + 0x6800UL)
#define BAKPR_BASE            (APB1PERIPH_BASE + 0x6C00UL)
#define PMU_BASE              (APB1PERIPH_BASE + 0x7000UL)

/*!< APB2 peripherals */
#define AFIO_BASE             (APB2PERIPH_BASE + 0x0000UL)
#define EINT_BASE             (APB2PERIPH_BASE + 0x0400UL)
#define GPIOA_BASE            (APB2PERIPH_BASE + 0x0800UL)
#define GPIOB_BASE            (APB2PERIPH_BASE + 0x0C00UL)
#define GPIOC_BASE            (APB2PERIPH_BASE + 0x1000UL)
#define GPIOD_BASE            (APB2PERIPH_BASE + 0x1400UL)
#define ADC1_BASE             (APB2PERIPH_BASE + 0x2400UL)
#define ADC2_BASE             (APB2PERIPH_BASE + 0x2800UL)
#define TMR1_BASE             (APB2PERIPH_BASE + 0x2C00UL)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000UL)
#define TMR8_BASE             (APB2PERIPH_BASE + 0x3400UL)
#define USART1_BASE           (APB2PERIPH_BASE + 0x3800UL)

/*!< AHB peripherals */
#define DMA1_BASE             (AHBPERIPH_BASE + 0x0000UL)
#define DMA1_Channel1_BASE    (AHBPERIPH_BASE + 0x0008UL)
#define DMA1_Channel2_BASE    (AHBPERIPH_BASE + 0x001CUL)
#define DMA1_Channel3_BASE    (AHBPERIPH_BASE + 0x0030UL)
#define DMA1_Channel4_BASE    (AHBPERIPH_BASE + 0x0044UL)
#define DMA1_Channel5_BASE    (AHBPERIPH_BASE + 0x0058UL)
#define DMA1_Channel6_BASE    (AHBPERIPH_BASE + 0x006CUL)
#define DMA1_Channel7_BASE    (AHBPERIPH_BASE + 0x0080UL)
#define DMA2_BASE             (AHBPERIPH_BASE + 0x0400UL)
#define DMA2_Channel1_BASE    (AHBPERIPH_BASE + 0x0408UL)
#define DMA2_Channel2_BASE    (AHBPERIPH_BASE + 0x041CUL)
#define DMA2_Channel3_BASE    (AHBPERIPH_BASE + 0x0430UL)
#define DMA2_Channel4_BASE    (AHBPERIPH_BASE + 0x0444UL)
#define DMA2_Channel5_BASE    (AHBPERIPH_BASE + 0x0458UL)
#define RCM_BASE              (AHBPERIPH_BASE + 0x1000UL)
#define CRC_BASE              (AHBPERIPH_BASE + 0x3000UL)
#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x2000UL)   /*!< FLASH registers base address */

/*!< Debug MCU registers base address */
#define DBGMCU_BASE           0xE0042000UL
/*!< USB registers base address */
#define USB_OTG_FS_PERIPH_BASE               0x50000000UL

#define USB_OTG_GLOBAL_BASE                  0x000UL
#define USB_OTG_DEVICE_BASE                  0x800UL
#define USB_OTG_IN_ENDPOINT_BASE             0x900UL
#define USB_OTG_OUT_ENDPOINT_BASE            0xB00UL
#define USB_OTG_EP_REG_SIZE                  0x20UL
#define USB_OTG_HOST_BASE                    0x400UL
#define USB_OTG_HOST_PORT_BASE               0x440UL
#define USB_OTG_HOST_CHANNEL_BASE            0x500UL
#define USB_OTG_HOST_CHANNEL_SIZE            0x20UL
#define USB_OTG_PCGCCTL_BASE                 0xE00UL
#define USB_OTG_FIFO_BASE                    0x1000UL
#define USB_OTG_FIFO_SIZE                    0x1000UL

#define FLASHSIZE_BASE        0x1FFFF7E0UL                  /*!< FLASH Size register base address */
#define UID_BASE              0x1FFFF7E8UL                  /*!< Unique device ID register base address */
#define OB_BASE               0x1FFFF800UL                  /*!< FLASH Option Bytes base address */

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TMR2                ((TMR_TypeDef *) TMR2_BASE)
#define TMR3                ((TMR_TypeDef *) TMR3_BASE)
#define TMR4                ((TMR_TypeDef *) TMR4_BASE)
#define TMR5                ((TMR_TypeDef *) TMR5_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDT                ((WWDT_TypeDef *) WWDT_BASE)
#define IWDT                ((IWDT_TypeDef *) IWDT_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define CAN1                ((CAN_TypeDef *) CAN1_BASE)
#define CAN2                ((CAN_TypeDef *) CAN2_BASE)
#define BAKPR               ((BAKPR_TypeDef *) BAKPR_BASE)
#define PMU                 ((PMU_TypeDef *) PMU_BASE)

#define AFIO                ((AFIO_TypeDef *) AFIO_BASE)
#define EINT                ((EINT_TypeDef *) EINT_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define ADC12_COMMON        ((ADC_Common_TypeDef *) ADC1_BASE)
#define TMR1                ((TMR_TypeDef *) TMR1_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define TMR8                ((TMR_TypeDef *) TMR8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1       ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Channel1       ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#define RCM                 ((RCM_TypeDef *) RCM_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define OB                  ((OB_TypeDef *) OB_BASE)
#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)
#define USB_OTG_FS          ((USB_OTG_GlobalTypeDef *) USB_OTG_FS_PERIPH_BASE)


/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME                85U /*!< LSI Maximum startup time in us */
/**
  * @}
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define ADC_MULTIMODE_SUPPORT                                                                                                      /*!<ADC Multimode feature available on specific devices */

/********************  Bit definition for ADC_STS register  ********************/
#define ADC_STS_AWDFLG_Pos                                          (0U)
#define ADC_STS_AWDFLG_Msk                                          (0x1UL << ADC_STS_AWDFLG_Pos)                                  /*!< 0x00000001 */
#define ADC_STS_AWDFLG                                              ADC_STS_AWDFLG_Msk                                             /*!<Analog watchdog flag */
#define ADC_STS_EOCFLG_Pos                                          (1U)
#define ADC_STS_EOCFLG_Msk                                          (0x1UL << ADC_STS_EOCFLG_Pos)                                  /*!< 0x00000002 */
#define ADC_STS_EOCFLG                                              ADC_STS_EOCFLG_Msk                                             /*!<End of conversion */
#define ADC_STS_INJEOCFLG_Pos                                       (2U)
#define ADC_STS_INJEOCFLG_Msk                                       (0x1UL << ADC_STS_INJEOCFLG_Pos)                               /*!< 0x00000004 */
#define ADC_STS_INJEOCFLG                                           ADC_STS_INJEOCFLG_Msk                                          /*!<Injected channel end of conversion */
#define ADC_STS_INJCSFLG_Pos                                        (3U)
#define ADC_STS_INJCSFLG_Msk                                        (0x1UL << ADC_STS_INJCSFLG_Pos)                                /*!< 0x00000008 */
#define ADC_STS_INJCSFLG                                            ADC_STS_INJCSFLG_Msk                                           /*!<Injected channel Start flag */
#define ADC_STS_REGCSFLG_Pos                                        (4U)
#define ADC_STS_REGCSFLG_Msk                                        (0x1UL << ADC_STS_REGCSFLG_Pos)                                /*!< 0x00000010 */
#define ADC_STS_REGCSFLG                                            ADC_STS_REGCSFLG_Msk                                           /*!<Regular channel Start flag */

