xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*******************  Bits definition for DMA_CHCFG register  *******************/
#define DMA_CHCFG_CHEN_Pos                                          (0U)
#define DMA_CHCFG_CHEN_Msk                                          (0x1UL << DMA_CHCFG_CHEN_Pos)                                  /*!< 0x00000001 */
#define DMA_CHCFG_CHEN                                              DMA_CHCFG_CHEN_Msk                                             /*!< Channel enable */
#define DMA_CHCFG_TCINTEN_Pos                                       (1U)
#define DMA_CHCFG_TCINTEN_Msk                                       (0x1UL << DMA_CHCFG_TCINTEN_Pos)                               /*!< 0x00000002 */
#define DMA_CHCFG_TCINTEN                                           DMA_CHCFG_TCINTEN_Msk                                          /*!< Transfer complete interrupt enable */
#define DMA_CHCFG_HTINTEN_Pos                                       (2U)
#define DMA_CHCFG_HTINTEN_Msk                                       (0x1UL << DMA_CHCFG_HTINTEN_Pos)                               /*!< 0x00000004 */
#define DMA_CHCFG_HTINTEN                                           DMA_CHCFG_HTINTEN_Msk                                          /*!< Half transfer interrupt enable */
#define DMA_CHCFG_TERRINTEN_Pos                                     (3U)
#define DMA_CHCFG_TERRINTEN_Msk                                     (0x1UL << DMA_CHCFG_TERRINTEN_Pos)                             /*!< 0x00000008 */
#define DMA_CHCFG_TERRINTEN                                         DMA_CHCFG_TERRINTEN_Msk                                        /*!< Transfer error interrupt enable */
#define DMA_CHCFG_DIRCFG_Pos                                        (4U)
#define DMA_CHCFG_DIRCFG_Msk                                        (0x1UL << DMA_CHCFG_DIRCFG_Pos)                                /*!< 0x00000010 */
#define DMA_CHCFG_DIRCFG                                            DMA_CHCFG_DIRCFG_Msk                                           /*!< Data transfer direction configuration */
#define DMA_CHCFG_CIRMODE_Pos                                       (5U)
#define DMA_CHCFG_CIRMODE_Msk                                       (0x1UL << DMA_CHCFG_CIRMODE_Pos)                               /*!< 0x00000020 */
#define DMA_CHCFG_CIRMODE                                           DMA_CHCFG_CIRMODE_Msk                                          /*!< Circular mode */
#define DMA_CHCFG_PERIMODE_Pos                                      (6U)
#define DMA_CHCFG_PERIMODE_Msk                                      (0x1UL << DMA_CHCFG_PERIMODE_Pos)                              /*!< 0x00000040 */
#define DMA_CHCFG_PERIMODE                                          DMA_CHCFG_PERIMODE_Msk                                         /*!< Peripheral increment mode */
#define DMA_CHCFG_MIMODE_Pos                                        (7U)
#define DMA_CHCFG_MIMODE_Msk                                        (0x1UL << DMA_CHCFG_MIMODE_Pos)                                /*!< 0x00000080 */
#define DMA_CHCFG_MIMODE                                            DMA_CHCFG_MIMODE_Msk                                           /*!< Memory increment mode */
#define DMA_CHCFG_PERSIZE_Pos                                       (8U)
#define DMA_CHCFG_PERSIZE_Msk                                       (0x3UL << DMA_CHCFG_PERSIZE_Pos)                               /*!< 0x00000300 */
#define DMA_CHCFG_PERSIZE                                           DMA_CHCFG_PERSIZE_Msk                                          /*!< PERSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG_PERSIZE_0                                         (0x1UL << DMA_CHCFG_PERSIZE_Pos)                               /*!< 0x00000100 */
#define DMA_CHCFG_PERSIZE_1                                         (0x2UL << DMA_CHCFG_PERSIZE_Pos)                               /*!< 0x00000200 */
#define DMA_CHCFG_MEMSIZE_Pos                                       (10U)
#define DMA_CHCFG_MEMSIZE_Msk                                       (0x3UL << DMA_CHCFG_MEMSIZE_Pos)                               /*!< 0x00000C00 */
#define DMA_CHCFG_MEMSIZE                                           DMA_CHCFG_MEMSIZE_Msk                                          /*!< MEMSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG_MEMSIZE_0                                         (0x1UL << DMA_CHCFG_MEMSIZE_Pos)                               /*!< 0x00000400 */
#define DMA_CHCFG_MEMSIZE_1                                         (0x2UL << DMA_CHCFG_MEMSIZE_Pos)                               /*!< 0x00000800 */
#define DMA_CHCFG_CHPL_Pos                                          (12U)
#define DMA_CHCFG_CHPL_Msk                                          (0x3UL << DMA_CHCFG_CHPL_Pos)                                  /*!< 0x00003000 */
#define DMA_CHCFG_CHPL                                              DMA_CHCFG_CHPL_Msk                                             /*!< CHPL[1:0] bits(Channel priority level) */
#define DMA_CHCFG_CHPL_0                                            (0x1UL << DMA_CHCFG_CHPL_Pos)                                  /*!< 0x00001000 */
#define DMA_CHCFG_CHPL_1                                            (0x2UL << DMA_CHCFG_CHPL_Pos)                                  /*!< 0x00002000 */
#define DMA_CHCFG_M2MMODE_Pos                                       (14U)
#define DMA_CHCFG_M2MMODE_Msk                                       (0x1UL << DMA_CHCFG_M2MMODE_Pos)                               /*!< 0x00004000 */
#define DMA_CHCFG_M2MMODE                                           DMA_CHCFG_M2MMODE_Msk                                          /*!< Memory to memory mode */

/*******************  Bits definition for DMA_CHNDATAR register  *****************/
#define DMA_CHNDATAR_NDATAT_Pos                                    (0U)
#define DMA_CHNDATAR_NDATAT_Msk                                    (0xFFFFUL << DMA_CHNDATAR_NDATAT_Pos)                           /*!< 0x0000FFFF */
#define DMA_CHNDATAR_NDATAT                                        DMA_CHNDATAR_NDATAT_Msk                                         /*!< Number of data to transfer */

