xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/******************  Bit definition for EINT_RTEN register  *******************/
#define EINT_RTEN_RTEN0_Pos                                         (0U)
#define EINT_RTEN_RTEN0_Msk                                         (0x1UL << EINT_RTEN_RTEN0_Pos)                                 /*!< 0x00000001 */
#define EINT_RTEN_RTEN0                                             EINT_RTEN_RTEN0_Msk                                            /*!< Rising trigger event configuration bit of line 0 */
#define EINT_RTEN_RTEN1_Pos                                         (1U)
#define EINT_RTEN_RTEN1_Msk                                         (0x1UL << EINT_RTEN_RTEN1_Pos)                                 /*!< 0x00000002 */
#define EINT_RTEN_RTEN1                                             EINT_RTEN_RTEN1_Msk                                            /*!< Rising trigger event configuration bit of line 1 */
#define EINT_RTEN_RTEN2_Pos                                         (2U)
#define EINT_RTEN_RTEN2_Msk                                         (0x1UL << EINT_RTEN_RTEN2_Pos)                                 /*!< 0x00000004 */
#define EINT_RTEN_RTEN2                                             EINT_RTEN_RTEN2_Msk                                            /*!< Rising trigger event configuration bit of line 2 */
#define EINT_RTEN_RTEN3_Pos                                         (3U)
#define EINT_RTEN_RTEN3_Msk                                         (0x1UL << EINT_RTEN_RTEN3_Pos)                                 /*!< 0x00000008 */
#define EINT_RTEN_RTEN3                                             EINT_RTEN_RTEN3_Msk                                            /*!< Rising trigger event configuration bit of line 3 */
#define EINT_RTEN_RTEN4_Pos                                         (4U)
#define EINT_RTEN_RTEN4_Msk                                         (0x1UL << EINT_RTEN_RTEN4_Pos)                                 /*!< 0x00000010 */
#define EINT_RTEN_RTEN4                                             EINT_RTEN_RTEN4_Msk                                            /*!< Rising trigger event configuration bit of line 4 */
#define EINT_RTEN_RTEN5_Pos                                         (5U)
#define EINT_RTEN_RTEN5_Msk                                         (0x1UL << EINT_RTEN_RTEN5_Pos)                                 /*!< 0x00000020 */
#define EINT_RTEN_RTEN5                                             EINT_RTEN_RTEN5_Msk                                            /*!< Rising trigger event configuration bit of line 5 */
#define EINT_RTEN_RTEN6_Pos                                         (6U)
#define EINT_RTEN_RTEN6_Msk                                         (0x1UL << EINT_RTEN_RTEN6_Pos)                                 /*!< 0x00000040 */
#define EINT_RTEN_RTEN6                                             EINT_RTEN_RTEN6_Msk                                            /*!< Rising trigger event configuration bit of line 6 */
#define EINT_RTEN_RTEN7_Pos                                         (7U)
#define EINT_RTEN_RTEN7_Msk                                         (0x1UL << EINT_RTEN_RTEN7_Pos)                                 /*!< 0x00000080 */
#define EINT_RTEN_RTEN7                                             EINT_RTEN_RTEN7_Msk                                            /*!< Rising trigger event configuration bit of line 7 */
#define EINT_RTEN_RTEN8_Pos                                         (8U)
#define EINT_RTEN_RTEN8_Msk                                         (0x1UL << EINT_RTEN_RTEN8_Pos)                                 /*!< 0x00000100 */
#define EINT_RTEN_RTEN8                                             EINT_RTEN_RTEN8_Msk                                            /*!< Rising trigger event configuration bit of line 8 */
#define EINT_RTEN_RTEN9_Pos                                         (9U)
#define EINT_RTEN_RTEN9_Msk                                         (0x1UL << EINT_RTEN_RTEN9_Pos)                                 /*!< 0x00000200 */
#define EINT_RTEN_RTEN9                                             EINT_RTEN_RTEN9_Msk                                            /*!< Rising trigger event configuration bit of line 9 */
#define EINT_RTEN_RTEN10_Pos                                        (10U)
#define EINT_RTEN_RTEN10_Msk                                        (0x1UL << EINT_RTEN_RTEN10_Pos)                                /*!< 0x00000400 */
#define EINT_RTEN_RTEN10                                            EINT_RTEN_RTEN10_Msk                                           /*!< Rising trigger event configuration bit of line 10 */
#define EINT_RTEN_RTEN11_Pos                                        (11U)
#define EINT_RTEN_RTEN11_Msk                                        (0x1UL << EINT_RTEN_RTEN11_Pos)                                /*!< 0x00000800 */
#define EINT_RTEN_RTEN11                                            EINT_RTEN_RTEN11_Msk                                           /*!< Rising trigger event configuration bit of line 11 */
#define EINT_RTEN_RTEN12_Pos                                        (12U)
#define EINT_RTEN_RTEN12_Msk                                        (0x1UL << EINT_RTEN_RTEN12_Pos)                                /*!< 0x00001000 */
#define EINT_RTEN_RTEN12                                            EINT_RTEN_RTEN12_Msk                                           /*!< Rising trigger event configuration bit of line 12 */
#define EINT_RTEN_RTEN13_Pos                                        (13U)
#define EINT_RTEN_RTEN13_Msk                                        (0x1UL << EINT_RTEN_RTEN13_Pos)                                /*!< 0x00002000 */
#define EINT_RTEN_RTEN13                                            EINT_RTEN_RTEN13_Msk                                           /*!< Rising trigger event configuration bit of line 13 */
#define EINT_RTEN_RTEN14_Pos                                        (14U)
#define EINT_RTEN_RTEN14_Msk                                        (0x1UL << EINT_RTEN_RTEN14_Pos)                                /*!< 0x00004000 */
#define EINT_RTEN_RTEN14                                            EINT_RTEN_RTEN14_Msk                                           /*!< Rising trigger event configuration bit of line 14 */
#define EINT_RTEN_RTEN15_Pos                                        (15U)
#define EINT_RTEN_RTEN15_Msk                                        (0x1UL << EINT_RTEN_RTEN15_Pos)                                /*!< 0x00008000 */
#define EINT_RTEN_RTEN15                                            EINT_RTEN_RTEN15_Msk                                           /*!< Rising trigger event configuration bit of line 15 */
#define EINT_RTEN_RTEN16_Pos                                        (16U)
#define EINT_RTEN_RTEN16_Msk                                        (0x1UL << EINT_RTEN_RTEN16_Pos)                                /*!< 0x00010000 */
#define EINT_RTEN_RTEN16                                            EINT_RTEN_RTEN16_Msk                                           /*!< Rising trigger event configuration bit of line 16 */
#define EINT_RTEN_RTEN17_Pos                                        (17U)
#define EINT_RTEN_RTEN17_Msk                                        (0x1UL << EINT_RTEN_RTEN17_Pos)                                /*!< 0x00020000 */
#define EINT_RTEN_RTEN17                                            EINT_RTEN_RTEN17_Msk                                           /*!< Rising trigger event configuration bit of line 17 */
#define EINT_RTEN_RTEN18_Pos                                        (18U)
#define EINT_RTEN_RTEN18_Msk                                        (0x1UL << EINT_RTEN_RTEN18_Pos)                                /*!< 0x00040000 */
#define EINT_RTEN_RTEN18                                            EINT_RTEN_RTEN18_Msk                                           /*!< Rising trigger event configuration bit of line 18 */

/******************  Bit definition for EINT_FTEN register  *******************/
#define EINT_FTEN_FTEN0_Pos                                         (0U)
#define EINT_FTEN_FTEN0_Msk                                         (0x1UL << EINT_FTEN_FTEN0_Pos)                                 /*!< 0x00000001 */
#define EINT_FTEN_FTEN0                                             EINT_FTEN_FTEN0_Msk                                            /*!< Falling trigger event configuration bit of line 0 */
#define EINT_FTEN_FTEN1_Pos                                         (1U)
#define EINT_FTEN_FTEN1_Msk                                         (0x1UL << EINT_FTEN_FTEN1_Pos)                                 /*!< 0x00000002 */
#define EINT_FTEN_FTEN1                                             EINT_FTEN_FTEN1_Msk                                            /*!< Falling trigger event configuration bit of line 1 */
#define EINT_FTEN_FTEN2_Pos                                         (2U)
#define EINT_FTEN_FTEN2_Msk                                         (0x1UL << EINT_FTEN_FTEN2_Pos)                                 /*!< 0x00000004 */
#define EINT_FTEN_FTEN2                                             EINT_FTEN_FTEN2_Msk                                            /*!< Falling trigger event configuration bit of line 2 */
#define EINT_FTEN_FTEN3_Pos                                         (3U)
#define EINT_FTEN_FTEN3_Msk                                         (0x1UL << EINT_FTEN_FTEN3_Pos)                                 /*!< 0x00000008 */
#define EINT_FTEN_FTEN3                                             EINT_FTEN_FTEN3_Msk                                            /*!< Falling trigger event configuration bit of line 3 */
#define EINT_FTEN_FTEN4_Pos                                         (4U)
#define EINT_FTEN_FTEN4_Msk                                         (0x1UL << EINT_FTEN_FTEN4_Pos)                                 /*!< 0x00000010 */
#define EINT_FTEN_FTEN4                                             EINT_FTEN_FTEN4_Msk                                            /*!< Falling trigger event configuration bit of line 4 */
#define EINT_FTEN_FTEN5_Pos                                         (5U)
#define EINT_FTEN_FTEN5_Msk                                         (0x1UL << EINT_FTEN_FTEN5_Pos)                                 /*!< 0x00000020 */
#define EINT_FTEN_FTEN5                                             EINT_FTEN_FTEN5_Msk                                            /*!< Falling trigger event configuration bit of line 5 */
#define EINT_FTEN_FTEN6_Pos                                         (6U)
#define EINT_FTEN_FTEN6_Msk                                         (0x1UL << EINT_FTEN_FTEN6_Pos)                                 /*!< 0x00000040 */
#define EINT_FTEN_FTEN6                                             EINT_FTEN_FTEN6_Msk                                            /*!< Falling trigger event configuration bit of line 6 */
#define EINT_FTEN_FTEN7_Pos                                         (7U)
#define EINT_FTEN_FTEN7_Msk                                         (0x1UL << EINT_FTEN_FTEN7_Pos)                                 /*!< 0x00000080 */
#define EINT_FTEN_FTEN7                                             EINT_FTEN_FTEN7_Msk                                            /*!< Falling trigger event configuration bit of line 7 */
#define EINT_FTEN_FTEN8_Pos                                         (8U)
#define EINT_FTEN_FTEN8_Msk                                         (0x1UL << EINT_FTEN_FTEN8_Pos)                                 /*!< 0x00000100 */
#define EINT_FTEN_FTEN8                                             EINT_FTEN_FTEN8_Msk                                            /*!< Falling trigger event configuration bit of line 8 */
#define EINT_FTEN_FTEN9_Pos                                         (9U)
#define EINT_FTEN_FTEN9_Msk                                         (0x1UL << EINT_FTEN_FTEN9_Pos)                                 /*!< 0x00000200 */
#define EINT_FTEN_FTEN9                                             EINT_FTEN_FTEN9_Msk                                            /*!< Falling trigger event configuration bit of line 9 */
#define EINT_FTEN_FTEN10_Pos                                        (10U)
#define EINT_FTEN_FTEN10_Msk                                        (0x1UL << EINT_FTEN_FTEN10_Pos)                                /*!< 0x00000400 */
#define EINT_FTEN_FTEN10                                            EINT_FTEN_FTEN10_Msk                                           /*!< Falling trigger event configuration bit of line 10 */
#define EINT_FTEN_FTEN11_Pos                                        (11U)
#define EINT_FTEN_FTEN11_Msk                                        (0x1UL << EINT_FTEN_FTEN11_Pos)                                /*!< 0x00000800 */
#define EINT_FTEN_FTEN11                                            EINT_FTEN_FTEN11_Msk                                           /*!< Falling trigger event configuration bit of line 11 */
#define EINT_FTEN_FTEN12_Pos                                        (12U)
#define EINT_FTEN_FTEN12_Msk                                        (0x1UL << EINT_FTEN_FTEN12_Pos)                                /*!< 0x00001000 */
#define EINT_FTEN_FTEN12                                            EINT_FTEN_FTEN12_Msk                                           /*!< Falling trigger event configuration bit of line 12 */
#define EINT_FTEN_FTEN13_Pos                                        (13U)
#define EINT_FTEN_FTEN13_Msk                                        (0x1UL << EINT_FTEN_FTEN13_Pos)                                /*!< 0x00002000 */
#define EINT_FTEN_FTEN13                                            EINT_FTEN_FTEN13_Msk                                           /*!< Falling trigger event configuration bit of line 13 */
#define EINT_FTEN_FTEN14_Pos                                        (14U)
#define EINT_FTEN_FTEN14_Msk                                        (0x1UL << EINT_FTEN_FTEN14_Pos)                                /*!< 0x00004000 */
#define EINT_FTEN_FTEN14                                            EINT_FTEN_FTEN14_Msk                                           /*!< Falling trigger event configuration bit of line 14 */
#define EINT_FTEN_FTEN15_Pos                                        (15U)
#define EINT_FTEN_FTEN15_Msk                                        (0x1UL << EINT_FTEN_FTEN15_Pos)                                /*!< 0x00008000 */
#define EINT_FTEN_FTEN15                                            EINT_FTEN_FTEN15_Msk                                           /*!< Falling trigger event configuration bit of line 15 */
#define EINT_FTEN_FTEN16_Pos                                        (16U)
#define EINT_FTEN_FTEN16_Msk                                        (0x1UL << EINT_FTEN_FTEN16_Pos)                                /*!< 0x00010000 */
#define EINT_FTEN_FTEN16                                            EINT_FTEN_FTEN16_Msk                                           /*!< Falling trigger event configuration bit of line 16 */
#define EINT_FTEN_FTEN17_Pos                                        (17U)
#define EINT_FTEN_FTEN17_Msk                                        (0x1UL << EINT_FTEN_FTEN17_Pos)                                /*!< 0x00020000 */
#define EINT_FTEN_FTEN17                                            EINT_FTEN_FTEN17_Msk                                           /*!< Falling trigger event configuration bit of line 17 */
#define EINT_FTEN_FTEN18_Pos                                        (18U)
#define EINT_FTEN_FTEN18_Msk                                        (0x1UL << EINT_FTEN_FTEN18_Pos)                                /*!< 0x00040000 */
#define EINT_FTEN_FTEN18                                            EINT_FTEN_FTEN18_Msk                                           /*!< Falling trigger event configuration bit of line 18 */

/******************  Bit definition for EINT_SWINTE register  ******************/
#define EINT_SWINTE_SWINTE0_Pos                                     (0U)
#define EINT_SWINTE_SWINTE0_Msk                                     (0x1UL << EINT_SWINTE_SWINTE0_Pos)                             /*!< 0x00000001 */
#define EINT_SWINTE_SWINTE0                                         EINT_SWINTE_SWINTE0_Msk                                        /*!< Software Interrupt on line 0 */
#define EINT_SWINTE_SWINTE1_Pos                                     (1U)
#define EINT_SWINTE_SWINTE1_Msk                                     (0x1UL << EINT_SWINTE_SWINTE1_Pos)                             /*!< 0x00000002 */
#define EINT_SWINTE_SWINTE1                                         EINT_SWINTE_SWINTE1_Msk                                        /*!< Software Interrupt on line 1 */
#define EINT_SWINTE_SWINTE2_Pos                                     (2U)
#define EINT_SWINTE_SWINTE2_Msk                                     (0x1UL << EINT_SWINTE_SWINTE2_Pos)                             /*!< 0x00000004 */
#define EINT_SWINTE_SWINTE2                                         EINT_SWINTE_SWINTE2_Msk                                        /*!< Software Interrupt on line 2 */
#define EINT_SWINTE_SWINTE3_Pos                                     (3U)
#define EINT_SWINTE_SWINTE3_Msk                                     (0x1UL << EINT_SWINTE_SWINTE3_Pos)                             /*!< 0x00000008 */
#define EINT_SWINTE_SWINTE3                                         EINT_SWINTE_SWINTE3_Msk                                        /*!< Software Interrupt on line 3 */
#define EINT_SWINTE_SWINTE4_Pos                                     (4U)
#define EINT_SWINTE_SWINTE4_Msk                                     (0x1UL << EINT_SWINTE_SWINTE4_Pos)                             /*!< 0x00000010 */
#define EINT_SWINTE_SWINTE4                                         EINT_SWINTE_SWINTE4_Msk                                        /*!< Software Interrupt on line 4 */
#define EINT_SWINTE_SWINTE5_Pos                                     (5U)
#define EINT_SWINTE_SWINTE5_Msk                                     (0x1UL << EINT_SWINTE_SWINTE5_Pos)                             /*!< 0x00000020 */
#define EINT_SWINTE_SWINTE5                                         EINT_SWINTE_SWINTE5_Msk                                        /*!< Software Interrupt on line 5 */
#define EINT_SWINTE_SWINTE6_Pos                                     (6U)
#define EINT_SWINTE_SWINTE6_Msk                                     (0x1UL << EINT_SWINTE_SWINTE6_Pos)                             /*!< 0x00000040 */
#define EINT_SWINTE_SWINTE6                                         EINT_SWINTE_SWINTE6_Msk                                        /*!< Software Interrupt on line 6 */
#define EINT_SWINTE_SWINTE7_Pos                                     (7U)
#define EINT_SWINTE_SWINTE7_Msk                                     (0x1UL << EINT_SWINTE_SWINTE7_Pos)                             /*!< 0x00000080 */
#define EINT_SWINTE_SWINTE7                                         EINT_SWINTE_SWINTE7_Msk                                        /*!< Software Interrupt on line 7 */
#define EINT_SWINTE_SWINTE8_Pos                                     (8U)
#define EINT_SWINTE_SWINTE8_Msk                                     (0x1UL << EINT_SWINTE_SWINTE8_Pos)                             /*!< 0x00000100 */
#define EINT_SWINTE_SWINTE8                                         EINT_SWINTE_SWINTE8_Msk                                        /*!< Software Interrupt on line 8 */
#define EINT_SWINTE_SWINTE9_Pos                                     (9U)
#define EINT_SWINTE_SWINTE9_Msk                                     (0x1UL << EINT_SWINTE_SWINTE9_Pos)                             /*!< 0x00000200 */
#define EINT_SWINTE_SWINTE9                                         EINT_SWINTE_SWINTE9_Msk                                        /*!< Software Interrupt on line 9 */
#define EINT_SWINTE_SWINTE10_Pos                                    (10U)
#define EINT_SWINTE_SWINTE10_Msk                                    (0x1UL << EINT_SWINTE_SWINTE10_Pos)                            /*!< 0x00000400 */
#define EINT_SWINTE_SWINTE10                                        EINT_SWINTE_SWINTE10_Msk                                       /*!< Software Interrupt on line 10 */
#define EINT_SWINTE_SWINTE11_Pos                                    (11U)
#define EINT_SWINTE_SWINTE11_Msk                                    (0x1UL << EINT_SWINTE_SWINTE11_Pos)                            /*!< 0x00000800 */
#define EINT_SWINTE_SWINTE11                                        EINT_SWINTE_SWINTE11_Msk                                       /*!< Software Interrupt on line 11 */
#define EINT_SWINTE_SWINTE12_Pos                                    (12U)
#define EINT_SWINTE_SWINTE12_Msk                                    (0x1UL << EINT_SWINTE_SWINTE12_Pos)                            /*!< 0x00001000 */
#define EINT_SWINTE_SWINTE12                                        EINT_SWINTE_SWINTE12_Msk                                       /*!< Software Interrupt on line 12 */
#define EINT_SWINTE_SWINTE13_Pos                                    (13U)
#define EINT_SWINTE_SWINTE13_Msk                                    (0x1UL << EINT_SWINTE_SWINTE13_Pos)                            /*!< 0x00002000 */
#define EINT_SWINTE_SWINTE13                                        EINT_SWINTE_SWINTE13_Msk                                       /*!< Software Interrupt on line 13 */
#define EINT_SWINTE_SWINTE14_Pos                                    (14U)
#define EINT_SWINTE_SWINTE14_Msk                                    (0x1UL << EINT_SWINTE_SWINTE14_Pos)                            /*!< 0x00004000 */
#define EINT_SWINTE_SWINTE14                                        EINT_SWINTE_SWINTE14_Msk                                       /*!< Software Interrupt on line 14 */
#define EINT_SWINTE_SWINTE15_Pos                                    (15U)
#define EINT_SWINTE_SWINTE15_Msk                                    (0x1UL << EINT_SWINTE_SWINTE15_Pos)                            /*!< 0x00008000 */
#define EINT_SWINTE_SWINTE15                                        EINT_SWINTE_SWINTE15_Msk                                       /*!< Software Interrupt on line 15 */
#define EINT_SWINTE_SWINTE16_Pos                                    (16U)
#define EINT_SWINTE_SWINTE16_Msk                                    (0x1UL << EINT_SWINTE_SWINTE16_Pos)                            /*!< 0x00010000 */
#define EINT_SWINTE_SWINTE16                                        EINT_SWINTE_SWINTE16_Msk                                       /*!< Software Interrupt on line 16 */
#define EINT_SWINTE_SWINTE17_Pos                                    (17U)
#define EINT_SWINTE_SWINTE17_Msk                                    (0x1UL << EINT_SWINTE_SWINTE17_Pos)                            /*!< 0x00020000 */
#define EINT_SWINTE_SWINTE17                                        EINT_SWINTE_SWINTE17_Msk                                       /*!< Software Interrupt on line 17 */
#define EINT_SWINTE_SWINTE18_Pos                                    (18U)
#define EINT_SWINTE_SWINTE18_Msk                                    (0x1UL << EINT_SWINTE_SWINTE18_Pos)                            /*!< 0x00040000 */
#define EINT_SWINTE_SWINTE18                                        EINT_SWINTE_SWINTE18_Msk                                       /*!< Software Interrupt on line 18 */

