xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*******************  Bit definition for EINT_IPEND register  ********************/
#define EINT_IPEND_IPEND0_Pos                                       (0U)
#define EINT_IPEND_IPEND0_Msk                                       (0x1UL << EINT_IPEND_IPEND0_Pos)                               /*!< 0x00000001 */
#define EINT_IPEND_IPEND0                                           EINT_IPEND_IPEND0_Msk                                          /*!< Pending bit for line 0 */
#define EINT_IPEND_IPEND1_Pos                                       (1U)
#define EINT_IPEND_IPEND1_Msk                                       (0x1UL << EINT_IPEND_IPEND1_Pos)                               /*!< 0x00000002 */
#define EINT_IPEND_IPEND1                                           EINT_IPEND_IPEND1_Msk                                          /*!< Pending bit for line 1 */
#define EINT_IPEND_IPEND2_Pos                                       (2U)
#define EINT_IPEND_IPEND2_Msk                                       (0x1UL << EINT_IPEND_IPEND2_Pos)                               /*!< 0x00000004 */
#define EINT_IPEND_IPEND2                                           EINT_IPEND_IPEND2_Msk                                          /*!< Pending bit for line 2 */
#define EINT_IPEND_IPEND3_Pos                                       (3U)
#define EINT_IPEND_IPEND3_Msk                                       (0x1UL << EINT_IPEND_IPEND3_Pos)                               /*!< 0x00000008 */
#define EINT_IPEND_IPEND3                                           EINT_IPEND_IPEND3_Msk                                          /*!< Pending bit for line 3 */
#define EINT_IPEND_IPEND4_Pos                                       (4U)
#define EINT_IPEND_IPEND4_Msk                                       (0x1UL << EINT_IPEND_IPEND4_Pos)                               /*!< 0x00000010 */
#define EINT_IPEND_IPEND4                                           EINT_IPEND_IPEND4_Msk                                          /*!< Pending bit for line 4 */
#define EINT_IPEND_IPEND5_Pos                                       (5U)
#define EINT_IPEND_IPEND5_Msk                                       (0x1UL << EINT_IPEND_IPEND5_Pos)                               /*!< 0x00000020 */
#define EINT_IPEND_IPEND5                                           EINT_IPEND_IPEND5_Msk                                          /*!< Pending bit for line 5 */
#define EINT_IPEND_IPEND6_Pos                                       (6U)
#define EINT_IPEND_IPEND6_Msk                                       (0x1UL << EINT_IPEND_IPEND6_Pos)                               /*!< 0x00000040 */
#define EINT_IPEND_IPEND6                                           EINT_IPEND_IPEND6_Msk                                          /*!< Pending bit for line 6 */
#define EINT_IPEND_IPEND7_Pos                                       (7U)
#define EINT_IPEND_IPEND7_Msk                                       (0x1UL << EINT_IPEND_IPEND7_Pos)                               /*!< 0x00000080 */
#define EINT_IPEND_IPEND7                                           EINT_IPEND_IPEND7_Msk                                          /*!< Pending bit for line 7 */
#define EINT_IPEND_IPEND8_Pos                                       (8U)
#define EINT_IPEND_IPEND8_Msk                                       (0x1UL << EINT_IPEND_IPEND8_Pos)                               /*!< 0x00000100 */
#define EINT_IPEND_IPEND8                                           EINT_IPEND_IPEND8_Msk                                          /*!< Pending bit for line 8 */
#define EINT_IPEND_IPEND9_Pos                                       (9U)
#define EINT_IPEND_IPEND9_Msk                                       (0x1UL << EINT_IPEND_IPEND9_Pos)                               /*!< 0x00000200 */
#define EINT_IPEND_IPEND9                                           EINT_IPEND_IPEND9_Msk                                          /*!< Pending bit for line 9 */
#define EINT_IPEND_IPEND10_Pos                                      (10U)
#define EINT_IPEND_IPEND10_Msk                                      (0x1UL << EINT_IPEND_IPEND10_Pos)                              /*!< 0x00000400 */
#define EINT_IPEND_IPEND10                                          EINT_IPEND_IPEND10_Msk                                         /*!< Pending bit for line 10 */
#define EINT_IPEND_IPEND11_Pos                                      (11U)
#define EINT_IPEND_IPEND11_Msk                                      (0x1UL << EINT_IPEND_IPEND11_Pos)                              /*!< 0x00000800 */
#define EINT_IPEND_IPEND11                                          EINT_IPEND_IPEND11_Msk                                         /*!< Pending bit for line 11 */
#define EINT_IPEND_IPEND12_Pos                                      (12U)
#define EINT_IPEND_IPEND12_Msk                                      (0x1UL << EINT_IPEND_IPEND12_Pos)                              /*!< 0x00001000 */
#define EINT_IPEND_IPEND12                                          EINT_IPEND_IPEND12_Msk                                         /*!< Pending bit for line 12 */
#define EINT_IPEND_IPEND13_Pos                                      (13U)
#define EINT_IPEND_IPEND13_Msk                                      (0x1UL << EINT_IPEND_IPEND13_Pos)                              /*!< 0x00002000 */
#define EINT_IPEND_IPEND13                                          EINT_IPEND_IPEND13_Msk                                         /*!< Pending bit for line 13 */
#define EINT_IPEND_IPEND14_Pos                                      (14U)
#define EINT_IPEND_IPEND14_Msk                                      (0x1UL << EINT_IPEND_IPEND14_Pos)                              /*!< 0x00004000 */
#define EINT_IPEND_IPEND14                                          EINT_IPEND_IPEND14_Msk                                         /*!< Pending bit for line 14 */
#define EINT_IPEND_IPEND15_Pos                                      (15U)
#define EINT_IPEND_IPEND15_Msk                                      (0x1UL << EINT_IPEND_IPEND15_Pos)                              /*!< 0x00008000 */
#define EINT_IPEND_IPEND15                                          EINT_IPEND_IPEND15_Msk                                         /*!< Pending bit for line 15 */
#define EINT_IPEND_IPEND16_Pos                                      (16U)
#define EINT_IPEND_IPEND16_Msk                                      (0x1UL << EINT_IPEND_IPEND16_Pos)                              /*!< 0x00010000 */
#define EINT_IPEND_IPEND16                                          EINT_IPEND_IPEND16_Msk                                         /*!< Pending bit for line 16 */
#define EINT_IPEND_IPEND17_Pos                                      (17U)
#define EINT_IPEND_IPEND17_Msk                                      (0x1UL << EINT_IPEND_IPEND17_Pos)                              /*!< 0x00020000 */
#define EINT_IPEND_IPEND17                                          EINT_IPEND_IPEND17_Msk                                         /*!< Pending bit for line 17 */
#define EINT_IPEND_IPEND18_Pos                                      (18U)
#define EINT_IPEND_IPEND18_Msk                                      (0x1UL << EINT_IPEND_IPEND18_Pos)                              /*!< 0x00040000 */
#define EINT_IPEND_IPEND18                                          EINT_IPEND_IPEND18_Msk                                         /*!< Pending bit for line 18 */

/******************************************************************************/
/*                                                                            */
/*                     FLASH and Option Bytes Registers                       */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FMC_CTRL1 register  *******************/
#define FLASH_CTRL1_WS02_Pos                                        (0U)
#define FLASH_CTRL1_WS02_Msk                                        (0x7UL << FLASH_CTRL1_WS02_Pos)                                /*!< 0x00000007 */
#define FLASH_CTRL1_WS02                                            FLASH_CTRL1_WS02_Msk                                           /*!<WS[2:0] bits (Latency) */
#define FLASH_CTRL1_WS34_Pos                                        (6U)
#define FLASH_CTRL1_WS34_Msk                                        (0x3UL << FLASH_CTRL1_WS34_Pos)                                /*!< 0x000000C0 */
#define FLASH_CTRL1_WS34                                            FLASH_CTRL1_WS34_Msk                                           /*!<WS[4:3] bits (Latency) */
#define FLASH_CTRL1_WS_0                                            (0x1UL << FLASH_CTRL1_WS02_Pos)                                /*!< 0x00000001 */
#define FLASH_CTRL1_WS_1                                            (0x2UL << FLASH_CTRL1_WS02_Pos)                                /*!< 0x00000002 */
#define FLASH_CTRL1_WS_2                                            (0x4UL << FLASH_CTRL1_WS02_Pos)                                /*!< 0x00000004 */
#define FLASH_CTRL1_WS_3                                            (0x1UL << FLASH_CTRL1_WS34_Pos)                                /*!< 0x00000040 */
#define FLASH_CTRL1_WS_4                                            (0x2UL << FLASH_CTRL1_WS34_Pos)                                /*!< 0x00000080 */
#define FLASH_CTRL_WS_0WS                                           0x00000000U
#define FLASH_CTRL_WS_1WS                                           0x00000001U
#define FLASH_CTRL_WS_2WS                                           0x00000002U
#define FLASH_CTRL_WS_3WS                                           0x00000003U
#define FLASH_CTRL_WS_4WS                                           0x00000004U
#define FLASH_CTRL_WS_5WS                                           0x00000005U
#define FLASH_CTRL_WS_6WS                                           0x00000006U
#define FLASH_CTRL_WS_7WS                                           0x00000007U
#define FLASH_CTRL_WS_8WS                                           0x00000040U
#define FLASH_CTRL_WS_9WS                                           0x00000041U
#define FLASH_CTRL_WS_10WS                                          0x00000042U
#define FLASH_CTRL_WS_11WS                                          0x00000043U
#define FLASH_CTRL_WS_12WS                                          0x00000044U
#define FLASH_CTRL_WS_13WS                                          0x00000045U
#define FLASH_CTRL_WS_14WS                                          0x00000046U
#define FLASH_CTRL_WS_15WS                                          0x00000047U
#define FLASH_CTRL_WS_16WS                                          0x00000080U
#define FLASH_CTRL_WS_17WS                                          0x00000081U
#define FLASH_CTRL_WS_18WS                                          0x00000082U
#define FLASH_CTRL_WS_19WS                                          0x00000083U
#define FLASH_CTRL_WS_20WS                                          0x00000084U
#define FLASH_CTRL_WS_21WS                                          0x00000085U
#define FLASH_CTRL_WS_22WS                                          0x00000086U
#define FLASH_CTRL_WS_23WS                                          0x00000087U
#define FLASH_CTRL_WS_24WS                                          0x000000C0U
#define FLASH_CTRL_WS_25WS                                          0x000000C1U
#define FLASH_CTRL_WS_26WS                                          0x000000C2U
#define FLASH_CTRL_WS_27WS                                          0x000000C3U
#define FLASH_CTRL_WS_28WS                                          0x000000C4U
#define FLASH_CTRL_WS_29WS                                          0x000000C5U
#define FLASH_CTRL_WS_30WS                                          0x000000C6U
#define FLASH_CTRL_WS_31WS                                          0x000000C7U
#define FLASH_CTRL1_HCAEN_Pos                                       (3U)
#define FLASH_CTRL1_HCAEN_Msk                                       (0x1UL << FLASH_CTRL1_HCAEN_Pos)                               /*!< 0x00000008 */
#define FLASH_CTRL1_HCAEN                                           FLASH_CTRL1_HCAEN_Msk                                          /*!<Flash half cycle access enable */
#define FLASH_CTRL1_PBEN_Pos                                        (4U)
#define FLASH_CTRL1_PBEN_Msk                                        (0x1UL << FLASH_CTRL1_PBEN_Pos)                                /*!< 0x00000010 */
#define FLASH_CTRL1_PBEN                                            FLASH_CTRL1_PBEN_Msk                                           /*!<Prefetch buffer enable */
#define FLASH_CTRL1_PBSF_Pos                                        (5U)
#define FLASH_CTRL1_PBSF_Msk                                        (0x1UL << FLASH_CTRL1_PBSF_Pos)                                /*!< 0x00000020 */
#define FLASH_CTRL1_PBSF                                            FLASH_CTRL1_PBSF_Msk                                           /*!<Prefetch buffer status */
#define FLASH_CTRL1_ICACHEEN_Pos                                    (8)
#define FLASH_CTRL1_ICACHEEN_Msk                                    (0x1UL << FLASH_CTRL1_ICACHEEN_Pos)                            /*!< 0x00000100 */
#define FLASH_CTRL1_ICACHEEN                                        FLASH_CTRL1_ICACHEEN_Msk                                       /*!<Instruction cache enable */
#define FLASH_CTRL1_DCACHEEN_Pos                                    (9U)
#define FLASH_CTRL1_DCACHEEN_Msk                                    (0x1UL << FLASH_CTRL1_DCACHEEN_Pos)                            /*!< 0x00000200 */
#define FLASH_CTRL1_DCACHEEN                                        FLASH_CTRL1_DCACHEEN_Msk                                       /*!<Data cache enable */
#define FLASH_CTRL1_ICACHERST_Pos                                   (10U)
#define FLASH_CTRL1_ICACHERST_Msk                                   (0x1UL << FLASH_CTRL1_ICACHERST_Pos)                           /*!< 0x00000400 */
#define FLASH_CTRL1_ICACHERST                                       FLASH_CTRL1_ICACHERST_Msk                                      /*!<Instruction cache reset */
#define FLASH_CTRL1_DCACHERST_Pos                                   (11U)
#define FLASH_CTRL1_DCACHERST_Msk                                   (0x1UL << FLASH_CTRL1_DCACHERST_Pos)                           /*!< 0x00000800 */
#define FLASH_CTRL1_DCACHERST                                       FLASH_CTRL1_DCACHERST_Msk                                      /*!<Data cache reset */
#define FLASH_CTRL1_PRFTB_Pos                                       (15)
#define FLASH_CTRL1_PRFTB_Msk                                       (0x1UL << FLASH_CTRL1_PRFTB_Pos)                               /*!< 0x00008000 */
#define FLASH_CTRL1_PRFTB                                           FLASH_CTRL1_PRFTB_Msk                                          /*!<Prefetch policy control */

