xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/********************  Bit definition for FMC_KEY register  ******************/
#define FLASH_KEY_KEY_Pos                                           (0U)
#define FLASH_KEY_KEY_Msk                                           (0xFFFFFFFFUL << FLASH_KEY_KEY_Pos)                            /*!< 0xFFFFFFFF */
#define FLASH_KEY_KEY                                               FLASH_KEY_KEY_Msk                                              /*!<FPEC key */

/*******************  Bit definition for FMC_OPTKEYR register  ****************/
#define FLASH_OBKEY_OBKEY_Pos                                       (0U)
#define FLASH_OBKEY_OBKEY_Msk                                       (0xFFFFFFFFUL << FLASH_OBKEY_OBKEY_Pos)                        /*!< 0xFFFFFFFF */
#define FLASH_OBKEY_OBKEY                                           FLASH_OBKEY_OBKEY_Msk                                          /*!< Option Byte Key */

/*******************  Bits definition for FMC_STS register  *******************/
#define FLASH_STS_BUSYF_Pos                                         (0U)
#define FLASH_STS_BUSYF_Msk                                         (0x1UL << FLASH_STS_BUSYF_Pos)                                 /*!< 0x00000001 */
#define FLASH_STS_BUSYF                                             FLASH_STS_BUSYF_Msk                                            /*!<Busy flag */
#define FLASH_STS_PEF_Pos                                           (2U)
#define FLASH_STS_PEF_Msk                                           (0x1UL << FLASH_STS_PEF_Pos)                                   /*!< 0x00000004 */
#define FLASH_STS_PEF                                               FLASH_STS_PEF_Msk                                              /*!<Programming error flag */
#define FLASH_STS_WPEF_Pos                                          (4U)
#define FLASH_STS_WPEF_Msk                                          (0x1UL << FLASH_STS_WPEF_Pos)                                  /*!< 0x00000010 */
#define FLASH_STS_WPEF                                              FLASH_STS_WPEF_Msk                                             /*!<Write protection error flag */
#define FLASH_STS_OCF_Pos                                           (5U)
#define FLASH_STS_OCF_Msk                                           (0x1UL << FLASH_STS_OCF_Pos)                                   /*!< 0x00000020 */
#define FLASH_STS_OCF                                               FLASH_STS_OCF_Msk                                              /*!<Operation completed flag */

/*******************  Bits definition for FMC_CTRL2 register  *******************/
#define FLASH_CTRL2_PG_Pos                                          (0U)
#define FLASH_CTRL2_PG_Msk                                          (0x1UL << FLASH_CTRL2_PG_Pos)                                  /*!< 0x00000001 */
#define FLASH_CTRL2_PG                                              FLASH_CTRL2_PG_Msk                                             /*!<Programming */
#define FLASH_CTRL2_PAGEERA_Pos                                     (1U)
#define FLASH_CTRL2_PAGEERA_Msk                                     (0x1UL << FLASH_CTRL2_PAGEERA_Pos)                             /*!< 0x00000002 */
#define FLASH_CTRL2_PAGEERA                                         FLASH_CTRL2_PAGEERA_Msk                                        /*!<Page erase */
#define FLASH_CTRL2_MASSERA_Pos                                     (2U)
#define FLASH_CTRL2_MASSERA_Msk                                     (0x1UL << FLASH_CTRL2_MASSERA_Pos)                             /*!< 0x00000004 */
#define FLASH_CTRL2_MASSERA                                         FLASH_CTRL2_MASSERA_Msk                                        /*!<Mass erase */
#define FLASH_CTRL2_OBP_Pos                                         (4U)
#define FLASH_CTRL2_OBP_Msk                                         (0x1UL << FLASH_CTRL2_OBP_Pos)                                 /*!< 0x00000010 */
#define FLASH_CTRL2_OBP                                             FLASH_CTRL2_OBP_Msk                                            /*!<Option byte programming */
#define FLASH_CTRL2_OBE_Pos                                         (5U)
#define FLASH_CTRL2_OBE_Msk                                         (0x1UL << FLASH_CTRL2_OBE_Pos)                                 /*!< 0x00000020 */
#define FLASH_CTRL2_OBE                                             FLASH_CTRL2_OBE_Msk                                            /*!<Option byte erase */
#define FLASH_CTRL2_STA_Pos                                         (6U)
#define FLASH_CTRL2_STA_Msk                                         (0x1UL << FLASH_CTRL2_STA_Pos)                                 /*!< 0x00000040 */
#define FLASH_CTRL2_STA                                             FLASH_CTRL2_STA_Msk                                            /*!<Start */
#define FLASH_CTRL2_LOCK_Pos                                        (7U)
#define FLASH_CTRL2_LOCK_Msk                                        (0x1UL << FLASH_CTRL2_LOCK_Pos)                                /*!< 0x00000080 */
#define FLASH_CTRL2_LOCK                                            FLASH_CTRL2_LOCK_Msk                                           /*!<Lock */
#define FLASH_CTRL2_OBWEN_Pos                                       (9)
#define FLASH_CTRL2_OBWEN_Msk                                       (0x1UL << FLASH_CTRL2_OBWEN_Pos)                               /*!< 0x00000200 */
#define FLASH_CTRL2_OBWEN                                           FLASH_CTRL2_OBWEN_Msk                                          /*!<Option byte write enable */
#define FLASH_CTRL2_ERRIE_Pos                                       (10U)
#define FLASH_CTRL2_ERRIE_Msk                                       (0x1UL << FLASH_CTRL2_ERRIE_Pos)                               /*!< 0x00000400 */
#define FLASH_CTRL2_ERRIE                                           FLASH_CTRL2_ERRIE_Msk                                          /*!<Error interrupt enable */
#define FLASH_CTRL2_OCIE_Pos                                        (12U)
#define FLASH_CTRL2_OCIE_Msk                                        (0x1UL << FLASH_CTRL2_OCIE_Pos)                                /*!< 0x00001000 */
#define FLASH_CTRL2_OCIE                                            FLASH_CTRL2_OCIE_Msk                                           /*!<Operation completed interrupt enable */

