xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/******************  Bits definition for GPIO_BSC register  *********************/
#define GPIO_BSC_BS0_Pos                                            (0U)
#define GPIO_BSC_BS0_Msk                                            (0x1UL << GPIO_BSC_BS0_Pos)                                    /*!< 0x00000001 */
#define GPIO_BSC_BS0                                                GPIO_BSC_BS0_Msk                                               /*!< Port x bit Set bit 0 */
#define GPIO_BSC_BS1_Pos                                            (1U)
#define GPIO_BSC_BS1_Msk                                            (0x1UL << GPIO_BSC_BS1_Pos)                                    /*!< 0x00000002 */
#define GPIO_BSC_BS1                                                GPIO_BSC_BS1_Msk                                               /*!< Port x bit Set bit 1 */
#define GPIO_BSC_BS2_Pos                                            (2U)
#define GPIO_BSC_BS2_Msk                                            (0x1UL << GPIO_BSC_BS2_Pos)                                    /*!< 0x00000004 */
#define GPIO_BSC_BS2                                                GPIO_BSC_BS2_Msk                                               /*!< Port x bit Set bit 2 */
#define GPIO_BSC_BS3_Pos                                            (3U)
#define GPIO_BSC_BS3_Msk                                            (0x1UL << GPIO_BSC_BS3_Pos)                                    /*!< 0x00000008 */
#define GPIO_BSC_BS3                                                GPIO_BSC_BS3_Msk                                               /*!< Port x bit Set bit 3 */
#define GPIO_BSC_BS4_Pos                                            (4U)
#define GPIO_BSC_BS4_Msk                                            (0x1UL << GPIO_BSC_BS4_Pos)                                    /*!< 0x00000010 */
#define GPIO_BSC_BS4                                                GPIO_BSC_BS4_Msk                                               /*!< Port x bit Set bit 4 */
#define GPIO_BSC_BS5_Pos                                            (5U)
#define GPIO_BSC_BS5_Msk                                            (0x1UL << GPIO_BSC_BS5_Pos)                                    /*!< 0x00000020 */
#define GPIO_BSC_BS5                                                GPIO_BSC_BS5_Msk                                               /*!< Port x bit Set bit 5 */
#define GPIO_BSC_BS6_Pos                                            (6U)
#define GPIO_BSC_BS6_Msk                                            (0x1UL << GPIO_BSC_BS6_Pos)                                    /*!< 0x00000040 */
#define GPIO_BSC_BS6                                                GPIO_BSC_BS6_Msk                                               /*!< Port x bit Set bit 6 */
#define GPIO_BSC_BS7_Pos                                            (7U)
#define GPIO_BSC_BS7_Msk                                            (0x1UL << GPIO_BSC_BS7_Pos)                                    /*!< 0x00000080 */
#define GPIO_BSC_BS7                                                GPIO_BSC_BS7_Msk                                               /*!< Port x bit Set bit 7 */
#define GPIO_BSC_BS8_Pos                                            (8U)
#define GPIO_BSC_BS8_Msk                                            (0x1UL << GPIO_BSC_BS8_Pos)                                    /*!< 0x00000100 */
#define GPIO_BSC_BS8                                                GPIO_BSC_BS8_Msk                                               /*!< Port x bit Set bit 8 */
#define GPIO_BSC_BS9_Pos                                            (9U)
#define GPIO_BSC_BS9_Msk                                            (0x1UL << GPIO_BSC_BS9_Pos)                                    /*!< 0x00000200 */
#define GPIO_BSC_BS9                                                GPIO_BSC_BS9_Msk                                               /*!< Port x bit Set bit 9 */
#define GPIO_BSC_BS10_Pos                                           (10U)
#define GPIO_BSC_BS10_Msk                                           (0x1UL << GPIO_BSC_BS10_Pos)                                   /*!< 0x00000400 */
#define GPIO_BSC_BS10                                               GPIO_BSC_BS10_Msk                                              /*!< Port x bit Set bit 10 */
#define GPIO_BSC_BS11_Pos                                           (11U)
#define GPIO_BSC_BS11_Msk                                           (0x1UL << GPIO_BSC_BS11_Pos)                                   /*!< 0x00000800 */
#define GPIO_BSC_BS11                                               GPIO_BSC_BS11_Msk                                              /*!< Port x bit Set bit 11 */
#define GPIO_BSC_BS12_Pos                                           (12U)
#define GPIO_BSC_BS12_Msk                                           (0x1UL << GPIO_BSC_BS12_Pos)                                   /*!< 0x00001000 */
#define GPIO_BSC_BS12                                               GPIO_BSC_BS12_Msk                                              /*!< Port x bit Set bit 12 */
#define GPIO_BSC_BS13_Pos                                           (13U)
#define GPIO_BSC_BS13_Msk                                           (0x1UL << GPIO_BSC_BS13_Pos)                                   /*!< 0x00002000 */
#define GPIO_BSC_BS13                                               GPIO_BSC_BS13_Msk                                              /*!< Port x bit Set bit 13 */
#define GPIO_BSC_BS14_Pos                                           (14U)
#define GPIO_BSC_BS14_Msk                                           (0x1UL << GPIO_BSC_BS14_Pos)                                   /*!< 0x00004000 */
#define GPIO_BSC_BS14                                               GPIO_BSC_BS14_Msk                                              /*!< Port x bit Set bit 14 */
#define GPIO_BSC_BS15_Pos                                           (15U)
#define GPIO_BSC_BS15_Msk                                           (0x1UL << GPIO_BSC_BS15_Pos)                                   /*!< 0x00008000 */
#define GPIO_BSC_BS15                                               GPIO_BSC_BS15_Msk                                              /*!< Port x bit Set bit 15 */

#define GPIO_BSC_BC0_Pos                                            (16U)
#define GPIO_BSC_BC0_Msk                                            (0x1UL << GPIO_BSC_BC0_Pos)                                    /*!< 0x00010000 */
#define GPIO_BSC_BC0                                                GPIO_BSC_BC0_Msk                                               /*!< Port x bit Clear bit 0 */
#define GPIO_BSC_BC1_Pos                                            (17U)
#define GPIO_BSC_BC1_Msk                                            (0x1UL << GPIO_BSC_BC1_Pos)                                    /*!< 0x00020000 */
#define GPIO_BSC_BC1                                                GPIO_BSC_BC1_Msk                                               /*!< Port x bit Clear bit 1 */
#define GPIO_BSC_BC2_Pos                                            (18U)
#define GPIO_BSC_BC2_Msk                                            (0x1UL << GPIO_BSC_BC2_Pos)                                    /*!< 0x00040000 */
#define GPIO_BSC_BC2                                                GPIO_BSC_BC2_Msk                                               /*!< Port x bit Clear bit 2 */
#define GPIO_BSC_BC3_Pos                                            (19U)
#define GPIO_BSC_BC3_Msk                                            (0x1UL << GPIO_BSC_BC3_Pos)                                    /*!< 0x00080000 */
#define GPIO_BSC_BC3                                                GPIO_BSC_BC3_Msk                                               /*!< Port x bit Clear bit 3 */
#define GPIO_BSC_BC4_Pos                                            (20U)
#define GPIO_BSC_BC4_Msk                                            (0x1UL << GPIO_BSC_BC4_Pos)                                    /*!< 0x00100000 */
#define GPIO_BSC_BC4                                                GPIO_BSC_BC4_Msk                                               /*!< Port x bit Clear bit 4 */
#define GPIO_BSC_BC5_Pos                                            (21U)
#define GPIO_BSC_BC5_Msk                                            (0x1UL << GPIO_BSC_BC5_Pos)                                    /*!< 0x00200000 */
#define GPIO_BSC_BC5                                                GPIO_BSC_BC5_Msk                                               /*!< Port x bit Clear bit 5 */
#define GPIO_BSC_BC6_Pos                                            (22U)
#define GPIO_BSC_BC6_Msk                                            (0x1UL << GPIO_BSC_BC6_Pos)                                    /*!< 0x00400000 */
#define GPIO_BSC_BC6                                                GPIO_BSC_BC6_Msk                                               /*!< Port x bit Clear bit 6 */
#define GPIO_BSC_BC7_Pos                                            (23U)
#define GPIO_BSC_BC7_Msk                                            (0x1UL << GPIO_BSC_BC7_Pos)                                    /*!< 0x00800000 */
#define GPIO_BSC_BC7                                                GPIO_BSC_BC7_Msk                                               /*!< Port x bit Clear bit 7 */
#define GPIO_BSC_BC8_Pos                                            (24U)
#define GPIO_BSC_BC8_Msk                                            (0x1UL << GPIO_BSC_BC8_Pos)                                    /*!< 0x01000000 */
#define GPIO_BSC_BC8                                                GPIO_BSC_BC8_Msk                                               /*!< Port x bit Clear bit 8 */
#define GPIO_BSC_BC9_Pos                                            (25U)
#define GPIO_BSC_BC9_Msk                                            (0x1UL << GPIO_BSC_BC9_Pos)                                    /*!< 0x02000000 */
#define GPIO_BSC_BC9                                                GPIO_BSC_BC9_Msk                                               /*!< Port x bit Clear bit 9 */
#define GPIO_BSC_BC10_Pos                                           (26U)
#define GPIO_BSC_BC10_Msk                                           (0x1UL << GPIO_BSC_BC10_Pos)                                   /*!< 0x04000000 */
#define GPIO_BSC_BC10                                               GPIO_BSC_BC10_Msk                                              /*!< Port x bit Clear bit 10 */
#define GPIO_BSC_BC11_Pos                                           (27U)
#define GPIO_BSC_BC11_Msk                                           (0x1UL << GPIO_BSC_BC11_Pos)                                   /*!< 0x08000000 */
#define GPIO_BSC_BC11                                               GPIO_BSC_BC11_Msk                                              /*!< Port x bit Clear bit 11 */
#define GPIO_BSC_BC12_Pos                                           (28U)
#define GPIO_BSC_BC12_Msk                                           (0x1UL << GPIO_BSC_BC12_Pos)                                   /*!< 0x10000000 */
#define GPIO_BSC_BC12                                               GPIO_BSC_BC12_Msk                                              /*!< Port x bit Clear bit 12 */
#define GPIO_BSC_BC13_Pos                                           (29U)
#define GPIO_BSC_BC13_Msk                                           (0x1UL << GPIO_BSC_BC13_Pos)                                   /*!< 0x20000000 */
#define GPIO_BSC_BC13                                               GPIO_BSC_BC13_Msk                                              /*!< Port x bit Clear bit 13 */
#define GPIO_BSC_BC14_Pos                                           (30U)
#define GPIO_BSC_BC14_Msk                                           (0x1UL << GPIO_BSC_BC14_Pos)                                   /*!< 0x40000000 */
#define GPIO_BSC_BC14                                               GPIO_BSC_BC14_Msk                                              /*!< Port x bit Clear bit 14 */
#define GPIO_BSC_BC15_Pos                                           (31U)
#define GPIO_BSC_BC15_Msk                                           (0x1UL << GPIO_BSC_BC15_Pos)                                   /*!< 0x80000000 */
#define GPIO_BSC_BC15                                               GPIO_BSC_BC15_Msk                                              /*!< Port x bit Clear bit 15 */

