xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/******************  Bits definition for GPIO_LOCK register  *********************/
#define GPIO_LOCK_LOCK0_Pos                                         (0U)
#define GPIO_LOCK_LOCK0_Msk                                         (0x1UL << GPIO_LOCK_LOCK0_Pos)                                 /*!< 0x00000001 */
#define GPIO_LOCK_LOCK0                                             GPIO_LOCK_LOCK0_Msk                                            /*!< Port x Lock bit 0 */
#define GPIO_LOCK_LOCK1_Pos                                         (1U)
#define GPIO_LOCK_LOCK1_Msk                                         (0x1UL << GPIO_LOCK_LOCK1_Pos)                                 /*!< 0x00000002 */
#define GPIO_LOCK_LOCK1                                             GPIO_LOCK_LOCK1_Msk                                            /*!< Port x Lock bit 1 */
#define GPIO_LOCK_LOCK2_Pos                                         (2U)
#define GPIO_LOCK_LOCK2_Msk                                         (0x1UL << GPIO_LOCK_LOCK2_Pos)                                 /*!< 0x00000004 */
#define GPIO_LOCK_LOCK2                                             GPIO_LOCK_LOCK2_Msk                                            /*!< Port x Lock bit 2 */
#define GPIO_LOCK_LOCK3_Pos                                         (3U)
#define GPIO_LOCK_LOCK3_Msk                                         (0x1UL << GPIO_LOCK_LOCK3_Pos)                                 /*!< 0x00000008 */
#define GPIO_LOCK_LOCK3                                             GPIO_LOCK_LOCK3_Msk                                            /*!< Port x Lock bit 3 */
#define GPIO_LOCK_LOCK4_Pos                                         (4U)
#define GPIO_LOCK_LOCK4_Msk                                         (0x1UL << GPIO_LOCK_LOCK4_Pos)                                 /*!< 0x00000010 */
#define GPIO_LOCK_LOCK4                                             GPIO_LOCK_LOCK4_Msk                                            /*!< Port x Lock bit 4 */
#define GPIO_LOCK_LOCK5_Pos                                         (5U)
#define GPIO_LOCK_LOCK5_Msk                                         (0x1UL << GPIO_LOCK_LOCK5_Pos)                                 /*!< 0x00000020 */
#define GPIO_LOCK_LOCK5                                             GPIO_LOCK_LOCK5_Msk                                            /*!< Port x Lock bit 5 */
#define GPIO_LOCK_LOCK6_Pos                                         (6U)
#define GPIO_LOCK_LOCK6_Msk                                         (0x1UL << GPIO_LOCK_LOCK6_Pos)                                 /*!< 0x00000040 */
#define GPIO_LOCK_LOCK6                                             GPIO_LOCK_LOCK6_Msk                                            /*!< Port x Lock bit 6 */
#define GPIO_LOCK_LOCK7_Pos                                         (7U)
#define GPIO_LOCK_LOCK7_Msk                                         (0x1UL << GPIO_LOCK_LOCK7_Pos)                                 /*!< 0x00000080 */
#define GPIO_LOCK_LOCK7                                             GPIO_LOCK_LOCK7_Msk                                            /*!< Port x Lock bit 7 */
#define GPIO_LOCK_LOCK8_Pos                                         (8U)
#define GPIO_LOCK_LOCK8_Msk                                         (0x1UL << GPIO_LOCK_LOCK8_Pos)                                 /*!< 0x00000100 */
#define GPIO_LOCK_LOCK8                                             GPIO_LOCK_LOCK8_Msk                                            /*!< Port x Lock bit 8 */
#define GPIO_LOCK_LOCK9_Pos                                         (9U)
#define GPIO_LOCK_LOCK9_Msk                                         (0x1UL << GPIO_LOCK_LOCK9_Pos)                                 /*!< 0x00000200 */
#define GPIO_LOCK_LOCK9                                             GPIO_LOCK_LOCK9_Msk                                            /*!< Port x Lock bit 9 */
#define GPIO_LOCK_LOCK10_Pos                                        (10U)
#define GPIO_LOCK_LOCK10_Msk                                        (0x1UL << GPIO_LOCK_LOCK10_Pos)                                /*!< 0x00000400 */
#define GPIO_LOCK_LOCK10                                            GPIO_LOCK_LOCK10_Msk                                           /*!< Port x Lock bit 10 */
#define GPIO_LOCK_LOCK11_Pos                                        (11U)
#define GPIO_LOCK_LOCK11_Msk                                        (0x1UL << GPIO_LOCK_LOCK11_Pos)                                /*!< 0x00000800 */
#define GPIO_LOCK_LOCK11                                            GPIO_LOCK_LOCK11_Msk                                           /*!< Port x Lock bit 11 */
#define GPIO_LOCK_LOCK12_Pos                                        (12U)
#define GPIO_LOCK_LOCK12_Msk                                        (0x1UL << GPIO_LOCK_LOCK12_Pos)                                /*!< 0x00001000 */
#define GPIO_LOCK_LOCK12                                            GPIO_LOCK_LOCK12_Msk                                           /*!< Port x Lock bit 12 */
#define GPIO_LOCK_LOCK13_Pos                                        (13U)
#define GPIO_LOCK_LOCK13_Msk                                        (0x1UL << GPIO_LOCK_LOCK13_Pos)                                /*!< 0x00002000 */
#define GPIO_LOCK_LOCK13                                            GPIO_LOCK_LOCK13_Msk                                           /*!< Port x Lock bit 13 */
#define GPIO_LOCK_LOCK14_Pos                                        (14U)
#define GPIO_LOCK_LOCK14_Msk                                        (0x1UL << GPIO_LOCK_LOCK14_Pos)                                /*!< 0x00004000 */
#define GPIO_LOCK_LOCK14                                            GPIO_LOCK_LOCK14_Msk                                           /*!< Port x Lock bit 14 */
#define GPIO_LOCK_LOCK15_Pos                                        (15U)
#define GPIO_LOCK_LOCK15_Msk                                        (0x1UL << GPIO_LOCK_LOCK15_Pos)                                /*!< 0x00008000 */
#define GPIO_LOCK_LOCK15                                            GPIO_LOCK_LOCK15_Msk                                           /*!< Port x Lock bit 15 */
#define GPIO_LOCK_LOCKKEY_Pos                                       (16U)
#define GPIO_LOCK_LOCKKEY_Msk                                       (0x1UL << GPIO_LOCK_LOCKKEY_Pos)                               /*!< 0x00010000 */
#define GPIO_LOCK_LOCKKEY                                           GPIO_LOCK_LOCKKEY_Msk                                          /*!< Lock key */

/******************************************************************************/
/*                                                                            */
/*                      Alternate Function I/O Configuration                  */
/*                                                                            */
/******************************************************************************/
/*****************  Bits definition for AFIO_EVCTRL register  ******************/
#define AFIO_EVCTRL_PINSEL_Pos                                      (0U)
#define AFIO_EVCTRL_PINSEL_Msk                                      (0xFUL << AFIO_EVCTRL_PINSEL_Pos)                              /*!< 0x0000000F */
#define AFIO_EVCTRL_PINSEL                                          AFIO_EVCTRL_PINSEL_Msk                                         /*!< PINSEL[3:0] bits (Pin selection) */
#define AFIO_EVCTRL_PINSEL_0                                        (0x1UL << AFIO_EVCTRL_PINSEL_Pos)                              /*!< 0x00000001 */
#define AFIO_EVCTRL_PINSEL_1                                        (0x2UL << AFIO_EVCTRL_PINSEL_Pos)                              /*!< 0x00000002 */
#define AFIO_EVCTRL_PINSEL_2                                        (0x4UL << AFIO_EVCTRL_PINSEL_Pos)                              /*!< 0x00000004 */
#define AFIO_EVCTRL_PINSEL_3                                        (0x8UL << AFIO_EVCTRL_PINSEL_Pos)                              /*!< 0x00000008 */

/*!< PIN configuration */
#define AFIO_EVCTRL_PINSEL_PX0                                      0x00000000U                                                    /*!< Pin 0 selected */
#define AFIO_EVCTRL_PINSEL_PX1_Pos                                  (0U)
#define AFIO_EVCTRL_PINSEL_PX1_Msk                                  (0x1UL << AFIO_EVCTRL_PINSEL_PX1_Pos)                          /*!< 0x00000001 */
#define AFIO_EVCTRL_PINSEL_PX1                                      AFIO_EVCTRL_PINSEL_PX1_Msk                                     /*!< Pin 1 selected */
#define AFIO_EVCTRL_PINSEL_PX2_Pos                                  (1U)
#define AFIO_EVCTRL_PINSEL_PX2_Msk                                  (0x1UL << AFIO_EVCTRL_PINSEL_PX2_Pos)                          /*!< 0x00000002 */
#define AFIO_EVCTRL_PINSEL_PX2                                      AFIO_EVCTRL_PINSEL_PX2_Msk                                     /*!< Pin 2 selected */
#define AFIO_EVCTRL_PINSEL_PX3_Pos                                  (0U)
#define AFIO_EVCTRL_PINSEL_PX3_Msk                                  (0x3UL << AFIO_EVCTRL_PINSEL_PX3_Pos)                          /*!< 0x00000003 */
#define AFIO_EVCTRL_PINSEL_PX3                                      AFIO_EVCTRL_PINSEL_PX3_Msk                                     /*!< Pin 3 selected */
#define AFIO_EVCTRL_PINSEL_PX4_Pos                                  (2U)
#define AFIO_EVCTRL_PINSEL_PX4_Msk                                  (0x1UL << AFIO_EVCTRL_PINSEL_PX4_Pos)                          /*!< 0x00000004 */
#define AFIO_EVCTRL_PINSEL_PX4                                      AFIO_EVCTRL_PINSEL_PX4_Msk                                     /*!< Pin 4 selected */
#define AFIO_EVCTRL_PINSEL_PX5_Pos                                  (0U)
#define AFIO_EVCTRL_PINSEL_PX5_Msk                                  (0x5UL << AFIO_EVCTRL_PINSEL_PX5_Pos)                          /*!< 0x00000005 */
#define AFIO_EVCTRL_PINSEL_PX5                                      AFIO_EVCTRL_PINSEL_PX5_Msk                                     /*!< Pin 5 selected */
#define AFIO_EVCTRL_PINSEL_PX6_Pos                                  (1U)
#define AFIO_EVCTRL_PINSEL_PX6_Msk                                  (0x3UL << AFIO_EVCTRL_PINSEL_PX6_Pos)                          /*!< 0x00000006 */
#define AFIO_EVCTRL_PINSEL_PX6                                      AFIO_EVCTRL_PINSEL_PX6_Msk                                     /*!< Pin 6 selected */
#define AFIO_EVCTRL_PINSEL_PX7_Pos                                  (0U)
#define AFIO_EVCTRL_PINSEL_PX7_Msk                                  (0x7UL << AFIO_EVCTRL_PINSEL_PX7_Pos)                          /*!< 0x00000007 */
#define AFIO_EVCTRL_PINSEL_PX7                                      AFIO_EVCTRL_PINSEL_PX7_Msk                                     /*!< Pin 7 selected */
#define AFIO_EVCTRL_PINSEL_PX8_Pos                                  (3U)
#define AFIO_EVCTRL_PINSEL_PX8_Msk                                  (0x1UL << AFIO_EVCTRL_PINSEL_PX8_Pos)                          /*!< 0x00000008 */
#define AFIO_EVCTRL_PINSEL_PX8                                      AFIO_EVCTRL_PINSEL_PX8_Msk                                     /*!< Pin 8 selected */
#define AFIO_EVCTRL_PINSEL_PX9_Pos                                  (0U)
#define AFIO_EVCTRL_PINSEL_PX9_Msk                                  (0x9UL << AFIO_EVCTRL_PINSEL_PX9_Pos)                          /*!< 0x00000009 */
#define AFIO_EVCTRL_PINSEL_PX9                                      AFIO_EVCTRL_PINSEL_PX9_Msk                                     /*!< Pin 9 selected */
#define AFIO_EVCTRL_PINSEL_PX10_Pos                                 (1U)
#define AFIO_EVCTRL_PINSEL_PX10_Msk                                 (0x5UL << AFIO_EVCTRL_PINSEL_PX10_Pos)                         /*!< 0x0000000A */
#define AFIO_EVCTRL_PINSEL_PX10                                     AFIO_EVCTRL_PINSEL_PX10_Msk                                    /*!< Pin 10 selected */
#define AFIO_EVCTRL_PINSEL_PX11_Pos                                 (0U)
#define AFIO_EVCTRL_PINSEL_PX11_Msk                                 (0xBUL << AFIO_EVCTRL_PINSEL_PX11_Pos)                         /*!< 0x0000000B */
#define AFIO_EVCTRL_PINSEL_PX11                                     AFIO_EVCTRL_PINSEL_PX11_Msk                                    /*!< Pin 11 selected */
#define AFIO_EVCTRL_PINSEL_PX12_Pos                                 (2U)
#define AFIO_EVCTRL_PINSEL_PX12_Msk                                 (0x3UL << AFIO_EVCTRL_PINSEL_PX12_Pos)                         /*!< 0x0000000C */
#define AFIO_EVCTRL_PINSEL_PX12                                     AFIO_EVCTRL_PINSEL_PX12_Msk                                    /*!< Pin 12 selected */
#define AFIO_EVCTRL_PINSEL_PX13_Pos                                 (0U)
#define AFIO_EVCTRL_PINSEL_PX13_Msk                                 (0xDUL << AFIO_EVCTRL_PINSEL_PX13_Pos)                         /*!< 0x0000000D */
#define AFIO_EVCTRL_PINSEL_PX13                                     AFIO_EVCTRL_PINSEL_PX13_Msk                                    /*!< Pin 13 selected */
#define AFIO_EVCTRL_PINSEL_PX14_Pos                                 (1U)
#define AFIO_EVCTRL_PINSEL_PX14_Msk                                 (0x7UL << AFIO_EVCTRL_PINSEL_PX14_Pos)                         /*!< 0x0000000E */
#define AFIO_EVCTRL_PINSEL_PX14                                     AFIO_EVCTRL_PINSEL_PX14_Msk                                    /*!< Pin 14 selected */
#define AFIO_EVCTRL_PINSEL_PX15_Pos                                 (0U)
#define AFIO_EVCTRL_PINSEL_PX15_Msk                                 (0xFUL << AFIO_EVCTRL_PINSEL_PX15_Pos)                         /*!< 0x0000000F */
#define AFIO_EVCTRL_PINSEL_PX15                                     AFIO_EVCTRL_PINSEL_PX15_Msk                                    /*!< Pin 15 selected */

