xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
#define AFIO_EVCTRL_PORTSEL_Pos                                     (4U)
#define AFIO_EVCTRL_PORTSEL_Msk                                     (0x7UL << AFIO_EVCTRL_PORTSEL_Pos)                             /*!< 0x00000070 */
#define AFIO_EVCTRL_PORTSEL                                         AFIO_EVCTRL_PORTSEL_Msk                                        /*!< PORTSEL[2:0] bits (Port selection) */
#define AFIO_EVCTRL_PORTSEL_0                                       (0x1UL << AFIO_EVCTRL_PORTSEL_Pos)                             /*!< 0x00000010 */
#define AFIO_EVCTRL_PORTSEL_1                                       (0x2UL << AFIO_EVCTRL_PORTSEL_Pos)                             /*!< 0x00000020 */
#define AFIO_EVCTRL_PORTSEL_2                                       (0x4UL << AFIO_EVCTRL_PORTSEL_Pos)                             /*!< 0x00000040 */

/*!< PORT configuration */
#define AFIO_EVCTRL_PORTSEL_PA                                      0x00000000U                                                    /*!< Port A selected */
#define AFIO_EVCTRL_PORTSEL_PB_Pos                                  (4U)
#define AFIO_EVCTRL_PORTSEL_PB_Msk                                  (0x1UL << AFIO_EVCTRL_PORTSEL_PB_Pos)                          /*!< 0x00000010 */
#define AFIO_EVCTRL_PORTSEL_PB                                      AFIO_EVCTRL_PORTSEL_PB_Msk                                     /*!< Port B selected */
#define AFIO_EVCTRL_PORTSEL_PC_Pos                                  (5U)
#define AFIO_EVCTRL_PORTSEL_PC_Msk                                  (0x3UL << AFIO_EVCTRL_PORTSEL_PC_Pos)                          /*!< 0x00000030 */
#define AFIO_EVCTRL_PORTSEL_PC                                      AFIO_EVCTRL_PORTSEL_PC_Msk                                     /*!< Port C selected */
#define AFIO_EVCTRL_PORTSEL_PD_Pos                                  (4U)
#define AFIO_EVCTRL_PORTSEL_PD_Msk                                  (0x5UL << AFIO_EVCTRL_PORTSEL_PD_Pos)                          /*!< 0x00000050 */
#define AFIO_EVCTRL_PORTSEL_PD                                      AFIO_EVCTRL_PORTSEL_PD_Msk                                     /*!< Port D selected */

#define AFIO_EVCTRL_EVOEN_Pos                                       (7U)
#define AFIO_EVCTRL_EVOEN_Msk                                       (0x1UL << AFIO_EVCTRL_EVOEN_Pos)                               /*!< 0x00000080 */
#define AFIO_EVCTRL_EVOEN                                           AFIO_EVCTRL_EVOEN_Msk                                          /*!< Event Output Enable */

/*****************  Bits definition for AFIO_REMAP1 register  ******************/
#define AFIO_REMAP1_SPI1_RMP_Pos                                    (0U)
#define AFIO_REMAP1_SPI1_RMP_Msk                                    (0x1UL << AFIO_REMAP1_SPI1_RMP_Pos)                            /*!< 0x00000001 */
#define AFIO_REMAP1_SPI1_RMP                                        AFIO_REMAP1_SPI1_RMP_Msk                                       /*!< SPI1 remapping */
#define AFIO_REMAP1_I2C1_RMP_Pos                                    (1U)
#define AFIO_REMAP1_I2C1_RMP_Msk                                    (0x1UL << AFIO_REMAP1_I2C1_RMP_Pos)                            /*!< 0x00000002 */
#define AFIO_REMAP1_I2C1_RMP                                        AFIO_REMAP1_I2C1_RMP_Msk                                       /*!< I2C1 remapping */
#define AFIO_REMAP1_USART1_RMP_Pos                                  (2U)
#define AFIO_REMAP1_USART1_RMP_Msk                                  (0x1UL << AFIO_REMAP1_USART1_RMP_Pos)                          /*!< 0x00000004 */
#define AFIO_REMAP1_USART1_RMP                                      AFIO_REMAP1_USART1_RMP_Msk                                     /*!< USART1 remapping */
#define AFIO_REMAP1_USART2_RMP_Pos                                  (3U)
#define AFIO_REMAP1_USART2_RMP_Msk                                  (0x1UL << AFIO_REMAP1_USART2_RMP_Pos)                          /*!< 0x00000008 */
#define AFIO_REMAP1_USART2_RMP                                      AFIO_REMAP1_USART2_RMP_Msk                                     /*!< USART2 remapping */
#define AFIO_REMAP1_USART3_RMP_Pos                                  (4U)
#define AFIO_REMAP1_USART3_RMP_Msk                                  (0x3UL << AFIO_REMAP1_USART3_RMP_Pos)                          /*!< 0x00000030 */
#define AFIO_REMAP1_USART3_RMP                                      AFIO_REMAP1_USART3_RMP_Msk                                     /*!< USART3RMP[1:0] bits (USART3 remapping) */
#define AFIO_REMAP1_USART3_RMP_0                                    (0x1UL << AFIO_REMAP1_USART3_RMP_Pos)                          /*!< 0x00000010 */
#define AFIO_REMAP1_USART3_RMP_1                                    (0x2UL << AFIO_REMAP1_USART3_RMP_Pos)                          /*!< 0x00000020 */

/* USART3_RMP configuration */
#define AFIO_REMAP1_USART3_RMP_NOREMAP                              0x00000000U                                                    /*!< No remap (TX/PB10, RX/PB11, CK = PC12, CTS = PB13, RTS = PB14) */
#define AFIO_REMAP1_USART3_RMP_PARTIALREMAP_Pos                     (4U)
#define AFIO_REMAP1_USART3_RMP_PARTIALREMAP_Msk                     (0x1UL << AFIO_REMAP1_USART3_RMP_PARTIALREMAP_Pos)             /*!< 0x00000010 */
#define AFIO_REMAP1_USART3_RMP_PARTIALREMAP                         AFIO_REMAP1_USART3_RMP_PARTIALREMAP_Msk                        /*!< Partial remap (TX/PC10, RX/PC11, CK = PC12, CTS = PB13, RTS = PB14) */
#define AFIO_REMAP1_USART3_RMP_FULLREMAP_Pos                        (4U)
#define AFIO_REMAP1_USART3_RMP_FULLREMAP_Msk                        (0x3UL << AFIO_REMAP1_USART3_RMP_FULLREMAP_Pos)                /*!< 0x00000030 */
#define AFIO_REMAP1_USART3_RMP_FULLREMAP                            AFIO_REMAP1_USART3_RMP_FULLREMAP_Msk                           /*!< Full remap (Invalid) */

#define AFIO_REMAP1_TMR1_RMP_Pos                                    (6U)
#define AFIO_REMAP1_TMR1_RMP_Msk                                    (0x3UL << AFIO_REMAP1_TMR1_RMP_Pos)                            /*!< 0x000000C0 */
#define AFIO_REMAP1_TMR1_RMP                                        AFIO_REMAP1_TMR1_RMP_Msk                                       /*!< TMR1_RMP[1:0] bits (Timer1 remapping) */
#define AFIO_REMAP1_TMR1_RMP_0                                      (0x1UL << AFIO_REMAP1_TMR1_RMP_Pos)                            /*!< 0x00000040 */
#define AFIO_REMAP1_TMR1_RMP_1                                      (0x2UL << AFIO_REMAP1_TMR1_RMP_Pos)                            /*!< 0x00000080 */

/* TMR1_RMP configuration */
#define AFIO_REMAP1_TMR1_RMP_NOREMAP                                0x00000000U                                                    /*!< No remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CN1N/PB13, CH2N/PB14, CH3N/PB15) */
#define AFIO_REMAP1_TMR1_RMP_PARTIALREMAP_Pos                       (6U)
#define AFIO_REMAP1_TMR1_RMP_PARTIALREMAP_Msk                       (0x1UL << AFIO_REMAP1_TMR1_RMP_PARTIALREMAP_Pos)               /*!< 0x00000040 */
#define AFIO_REMAP1_TMR1_RMP_PARTIALREMAP                           AFIO_REMAP1_TMR1_RMP_PARTIALREMAP_Msk                          /*!< Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CN1N/PA7, CH2N/PB0, CH3N/PB1) */
#define AFIO_REMAP1_TMR1_RMP_FULLREMAP_Pos                          (6U)
#define AFIO_REMAP1_TMR1_RMP_FULLREMAP_Msk                          (0x3UL << AFIO_REMAP1_TMR1_RMP_FULLREMAP_Pos)                  /*!< 0x000000C0 */
#define AFIO_REMAP1_TMR1_RMP_FULLREMAP                              AFIO_REMAP1_TMR1_RMP_FULLREMAP_Msk                             /*!< Full remap (Invalid) */

