xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*****************  Bits definition for AFIO_EINTSEL1 register  ******************/
#define AFIO_EINTSEL1_EINT0_Pos                                     (0U)
#define AFIO_EINTSEL1_EINT0_Msk                                     (0xFUL << AFIO_EINTSEL1_EINT0_Pos)                             /*!< 0x0000000F */
#define AFIO_EINTSEL1_EINT0                                         AFIO_EINTSEL1_EINT0_Msk                                        /*!< EINT0[3:0] bits (External interrupt 0 configuration) */
#define AFIO_EINTSEL1_EINT1_Pos                                     (4U)
#define AFIO_EINTSEL1_EINT1_Msk                                     (0xFUL << AFIO_EINTSEL1_EINT1_Pos)                             /*!< 0x000000F0 */
#define AFIO_EINTSEL1_EINT1                                         AFIO_EINTSEL1_EINT1_Msk                                        /*!< EINT1[3:0] bits (External interrupt 1 configuration) */
#define AFIO_EINTSEL1_EINT2_Pos                                     (8U)
#define AFIO_EINTSEL1_EINT2_Msk                                     (0xFUL << AFIO_EINTSEL1_EINT2_Pos)                             /*!< 0x00000F00 */
#define AFIO_EINTSEL1_EINT2                                         AFIO_EINTSEL1_EINT2_Msk                                        /*!< EINT2[3:0] bits (External interrupt 2 configuration) */
#define AFIO_EINTSEL1_EINT3_Pos                                     (12U)
#define AFIO_EINTSEL1_EINT3_Msk                                     (0xFUL << AFIO_EINTSEL1_EINT3_Pos)                             /*!< 0x0000F000 */
#define AFIO_EINTSEL1_EINT3                                         AFIO_EINTSEL1_EINT3_Msk                                        /*!< EINT3[3:0] bits (External interrupt 3 configuration) */

/* EINT0 configuration */
#define AFIO_EINTSEL1_EINT0_PA                                      0x00000000U                                                    /*!< PA[0] pin */
#define AFIO_EINTSEL1_EINT0_PB_Pos                                  (0U)
#define AFIO_EINTSEL1_EINT0_PB_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT0_PB_Pos)                          /*!< 0x00000001 */
#define AFIO_EINTSEL1_EINT0_PB                                      AFIO_EINTSEL1_EINT0_PB_Msk                                     /*!< PB[0] pin */
#define AFIO_EINTSEL1_EINT0_PC_Pos                                  (1U)
#define AFIO_EINTSEL1_EINT0_PC_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT0_PC_Pos)                          /*!< 0x00000002 */
#define AFIO_EINTSEL1_EINT0_PC                                      AFIO_EINTSEL1_EINT0_PC_Msk                                     /*!< PC[0] pin */
#define AFIO_EINTSEL1_EINT0_PD_Pos                                  (0U)
#define AFIO_EINTSEL1_EINT0_PD_Msk                                  (0x3UL << AFIO_EINTSEL1_EINT0_PD_Pos)                          /*!< 0x00000003 */
#define AFIO_EINTSEL1_EINT0_PD                                      AFIO_EINTSEL1_EINT0_PD_Msk                                     /*!< PD[0] pin */

/* EINT1 configuration */
#define AFIO_EINTSEL1_EINT1_PA                                      0x00000000U                                                    /*!< PA[1] pin */
#define AFIO_EINTSEL1_EINT1_PB_Pos                                  (4U)
#define AFIO_EINTSEL1_EINT1_PB_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT1_PB_Pos)                          /*!< 0x00000010 */
#define AFIO_EINTSEL1_EINT1_PB                                      AFIO_EINTSEL1_EINT1_PB_Msk                                     /*!< PB[1] pin */
#define AFIO_EINTSEL1_EINT1_PC_Pos                                  (5U)
#define AFIO_EINTSEL1_EINT1_PC_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT1_PC_Pos)                          /*!< 0x00000020 */
#define AFIO_EINTSEL1_EINT1_PC                                      AFIO_EINTSEL1_EINT1_PC_Msk                                     /*!< PC[1] pin */
#define AFIO_EINTSEL1_EINT1_PD_Pos                                  (4U)
#define AFIO_EINTSEL1_EINT1_PD_Msk                                  (0x3UL << AFIO_EINTSEL1_EINT1_PD_Pos)                          /*!< 0x00000030 */
#define AFIO_EINTSEL1_EINT1_PD                                      AFIO_EINTSEL1_EINT1_PD_Msk                                     /*!< PD[1] pin */

/* EINT2 configuration */
#define AFIO_EINTSEL1_EINT2_PA                                      0x00000000U                                                    /*!< PA[2] pin */
#define AFIO_EINTSEL1_EINT2_PB_Pos                                  (8U)
#define AFIO_EINTSEL1_EINT2_PB_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT2_PB_Pos)                          /*!< 0x00000100 */
#define AFIO_EINTSEL1_EINT2_PB                                      AFIO_EINTSEL1_EINT2_PB_Msk                                     /*!< PB[2] pin */
#define AFIO_EINTSEL1_EINT2_PC_Pos                                  (9U)
#define AFIO_EINTSEL1_EINT2_PC_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT2_PC_Pos)                          /*!< 0x00000200 */
#define AFIO_EINTSEL1_EINT2_PC                                      AFIO_EINTSEL1_EINT2_PC_Msk                                     /*!< PC[2] pin */
#define AFIO_EINTSEL1_EINT2_PD_Pos                                  (8U)
#define AFIO_EINTSEL1_EINT2_PD_Msk                                  (0x3UL << AFIO_EINTSEL1_EINT2_PD_Pos)                          /*!< 0x00000300 */
#define AFIO_EINTSEL1_EINT2_PD                                      AFIO_EINTSEL1_EINT2_PD_Msk                                     /*!< PD[2] pin */

/* EINT3 configuration */
#define AFIO_EINTSEL1_EINT3_PA                                      0x00000000U                                                    /*!< PA[3] pin */
#define AFIO_EINTSEL1_EINT3_PB_Pos                                  (12U)
#define AFIO_EINTSEL1_EINT3_PB_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT3_PB_Pos)                          /*!< 0x00001000 */
#define AFIO_EINTSEL1_EINT3_PB                                      AFIO_EINTSEL1_EINT3_PB_Msk                                     /*!< PB[3] pin */
#define AFIO_EINTSEL1_EINT3_PC_Pos                                  (13U)
#define AFIO_EINTSEL1_EINT3_PC_Msk                                  (0x1UL << AFIO_EINTSEL1_EINT3_PC_Pos)                          /*!< 0x00002000 */
#define AFIO_EINTSEL1_EINT3_PC                                      AFIO_EINTSEL1_EINT3_PC_Msk                                     /*!< PC[3] pin */
#define AFIO_EINTSEL1_EINT3_PD_Pos                                  (12U)
#define AFIO_EINTSEL1_EINT3_PD_Msk                                  (0x3UL << AFIO_EINTSEL1_EINT3_PD_Pos)                          /*!< 0x00003000 */
#define AFIO_EINTSEL1_EINT3_PD                                      AFIO_EINTSEL1_EINT3_PD_Msk                                     /*!< PD[3] pin */

/*****************  Bits definition for AFIO_EINTSEL2 register  ******************/
#define AFIO_EINTSEL2_EINT4_Pos                                     (0U)
#define AFIO_EINTSEL2_EINT4_Msk                                     (0xFUL << AFIO_EINTSEL2_EINT4_Pos)                             /*!< 0x0000000F */
#define AFIO_EINTSEL2_EINT4                                         AFIO_EINTSEL2_EINT4_Msk                                        /*!< EINT4[3:0] bits (External interrupt 4 configuration) */
#define AFIO_EINTSEL2_EINT5_Pos                                     (4U)
#define AFIO_EINTSEL2_EINT5_Msk                                     (0xFUL << AFIO_EINTSEL2_EINT5_Pos)                             /*!< 0x000000F0 */
#define AFIO_EINTSEL2_EINT5                                         AFIO_EINTSEL2_EINT5_Msk                                        /*!< EINT5[3:0] bits (External interrupt 5 configuration) */
#define AFIO_EINTSEL2_EINT6_Pos                                     (8U)
#define AFIO_EINTSEL2_EINT6_Msk                                     (0xFUL << AFIO_EINTSEL2_EINT6_Pos)                             /*!< 0x00000F00 */
#define AFIO_EINTSEL2_EINT6                                         AFIO_EINTSEL2_EINT6_Msk                                        /*!< EINT6[3:0] bits (External interrupt 6 configuration) */
#define AFIO_EINTSEL2_EINT7_Pos                                     (12U)
#define AFIO_EINTSEL2_EINT7_Msk                                     (0xFUL << AFIO_EINTSEL2_EINT7_Pos)                             /*!< 0x0000F000 */
#define AFIO_EINTSEL2_EINT7                                         AFIO_EINTSEL2_EINT7_Msk                                        /*!< EINT7[3:0] bits (External interrupt 7 configuration) */

/* EINT4 configuration */
#define AFIO_EINTSEL2_EINT4_PA                                      0x00000000U                                                    /*!< PA[4] pin */
#define AFIO_EINTSEL2_EINT4_PB_Pos                                  (0U)
#define AFIO_EINTSEL2_EINT4_PB_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT4_PB_Pos)                          /*!< 0x00000001 */
#define AFIO_EINTSEL2_EINT4_PB                                      AFIO_EINTSEL2_EINT4_PB_Msk                                     /*!< PB[4] pin */
#define AFIO_EINTSEL2_EINT4_PC_Pos                                  (1U)
#define AFIO_EINTSEL2_EINT4_PC_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT4_PC_Pos)                          /*!< 0x00000002 */
#define AFIO_EINTSEL2_EINT4_PC                                      AFIO_EINTSEL2_EINT4_PC_Msk                                     /*!< PC[4] pin */
#define AFIO_EINTSEL2_EINT4_PD_Pos                                  (0U)
#define AFIO_EINTSEL2_EINT4_PD_Msk                                  (0x3UL << AFIO_EINTSEL2_EINT4_PD_Pos)                          /*!< 0x00000003 */
#define AFIO_EINTSEL2_EINT4_PD                                      AFIO_EINTSEL2_EINT4_PD_Msk                                     /*!< PD[4] pin */

/* EINT5 configuration */
#define AFIO_EINTSEL2_EINT5_PA                                      0x00000000U                                                    /*!< PA[5] pin */
#define AFIO_EINTSEL2_EINT5_PB_Pos                                  (4U)
#define AFIO_EINTSEL2_EINT5_PB_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT5_PB_Pos)                          /*!< 0x00000010 */
#define AFIO_EINTSEL2_EINT5_PB                                      AFIO_EINTSEL2_EINT5_PB_Msk                                     /*!< PB[5] pin */
#define AFIO_EINTSEL2_EINT5_PC_Pos                                  (5U)
#define AFIO_EINTSEL2_EINT5_PC_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT5_PC_Pos)                          /*!< 0x00000020 */
#define AFIO_EINTSEL2_EINT5_PC                                      AFIO_EINTSEL2_EINT5_PC_Msk                                     /*!< PC[5] pin */
#define AFIO_EINTSEL2_EINT5_PD_Pos                                  (4U)
#define AFIO_EINTSEL2_EINT5_PD_Msk                                  (0x3UL << AFIO_EINTSEL2_EINT5_PD_Pos)                          /*!< 0x00000030 */
#define AFIO_EINTSEL2_EINT5_PD                                      AFIO_EINTSEL2_EINT5_PD_Msk                                     /*!< PD[5] pin */

/* EINT6 configuration */
#define AFIO_EINTSEL2_EINT6_PA                                      0x00000000U                                                    /*!< PA[6] pin */
#define AFIO_EINTSEL2_EINT6_PB_Pos                                  (8U)
#define AFIO_EINTSEL2_EINT6_PB_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT6_PB_Pos)                          /*!< 0x00000100 */
#define AFIO_EINTSEL2_EINT6_PB                                      AFIO_EINTSEL2_EINT6_PB_Msk                                     /*!< PB[6] pin */
#define AFIO_EINTSEL2_EINT6_PC_Pos                                  (9U)
#define AFIO_EINTSEL2_EINT6_PC_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT6_PC_Pos)                          /*!< 0x00000200 */
#define AFIO_EINTSEL2_EINT6_PC                                      AFIO_EINTSEL2_EINT6_PC_Msk                                     /*!< PC[6] pin */
#define AFIO_EINTSEL2_EINT6_PD_Pos                                  (8U)
#define AFIO_EINTSEL2_EINT6_PD_Msk                                  (0x3UL << AFIO_EINTSEL2_EINT6_PD_Pos)                          /*!< 0x00000300 */
#define AFIO_EINTSEL2_EINT6_PD                                      AFIO_EINTSEL2_EINT6_PD_Msk                                     /*!< PD[6] pin */

