xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/* EINT7 configuration */
#define AFIO_EINTSEL2_EINT7_PA                                      0x00000000U                                                    /*!< PA[7] pin */
#define AFIO_EINTSEL2_EINT7_PB_Pos                                  (12U)
#define AFIO_EINTSEL2_EINT7_PB_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT7_PB_Pos)                          /*!< 0x00001000 */
#define AFIO_EINTSEL2_EINT7_PB                                      AFIO_EINTSEL2_EINT7_PB_Msk                                     /*!< PB[7] pin */
#define AFIO_EINTSEL2_EINT7_PC_Pos                                  (13U)
#define AFIO_EINTSEL2_EINT7_PC_Msk                                  (0x1UL << AFIO_EINTSEL2_EINT7_PC_Pos)                          /*!< 0x00002000 */
#define AFIO_EINTSEL2_EINT7_PC                                      AFIO_EINTSEL2_EINT7_PC_Msk                                     /*!< PC[7] pin */
#define AFIO_EINTSEL2_EINT7_PD_Pos                                  (12U)
#define AFIO_EINTSEL2_EINT7_PD_Msk                                  (0x3UL << AFIO_EINTSEL2_EINT7_PD_Pos)                          /*!< 0x00003000 */
#define AFIO_EINTSEL2_EINT7_PD                                      AFIO_EINTSEL2_EINT7_PD_Msk                                     /*!< PD[7] pin */

/*****************  Bits definition for AFIO_EINTSEL3 register  ******************/
#define AFIO_EINTSEL3_EINT8_Pos                                     (0U)
#define AFIO_EINTSEL3_EINT8_Msk                                     (0xFUL << AFIO_EINTSEL3_EINT8_Pos)                             /*!< 0x0000000F */
#define AFIO_EINTSEL3_EINT8                                         AFIO_EINTSEL3_EINT8_Msk                                        /*!< EINT8[3:0] bits (External interrupt 8 configuration) */
#define AFIO_EINTSEL3_EINT9_Pos                                     (4U)
#define AFIO_EINTSEL3_EINT9_Msk                                     (0xFUL << AFIO_EINTSEL3_EINT9_Pos)                             /*!< 0x000000F0 */
#define AFIO_EINTSEL3_EINT9                                         AFIO_EINTSEL3_EINT9_Msk                                        /*!< EINT9[3:0] bits (External interrupt 9 configuration) */
#define AFIO_EINTSEL3_EINT10_Pos                                    (8U)
#define AFIO_EINTSEL3_EINT10_Msk                                    (0xFUL << AFIO_EINTSEL3_EINT10_Pos)                            /*!< 0x00000F00 */
#define AFIO_EINTSEL3_EINT10                                        AFIO_EINTSEL3_EINT10_Msk                                       /*!< EINT10[3:0] bits (External interrupt 10 configuration) */
#define AFIO_EINTSEL3_EINT11_Pos                                    (12U)
#define AFIO_EINTSEL3_EINT11_Msk                                    (0xFUL << AFIO_EINTSEL3_EINT11_Pos)                            /*!< 0x0000F000 */
#define AFIO_EINTSEL3_EINT11                                        AFIO_EINTSEL3_EINT11_Msk                                       /*!< EINT11[3:0] bits (External interrupt 11 configuration) */

/* EINT8 configuration */
#define AFIO_EINTSEL3_EINT8_PA                                      0x00000000U                                                    /*!< PA[8] pin */
#define AFIO_EINTSEL3_EINT8_PB_Pos                                  (0U)
#define AFIO_EINTSEL3_EINT8_PB_Msk                                  (0x1UL << AFIO_EINTSEL3_EINT8_PB_Pos)                          /*!< 0x00000001 */
#define AFIO_EINTSEL3_EINT8_PB                                      AFIO_EINTSEL3_EINT8_PB_Msk                                     /*!< PB[8] pin */
#define AFIO_EINTSEL3_EINT8_PC_Pos                                  (1U)
#define AFIO_EINTSEL3_EINT8_PC_Msk                                  (0x1UL << AFIO_EINTSEL3_EINT8_PC_Pos)                          /*!< 0x00000002 */
#define AFIO_EINTSEL3_EINT8_PC                                      AFIO_EINTSEL3_EINT8_PC_Msk                                     /*!< PC[8] pin */
#define AFIO_EINTSEL3_EINT8_PD_Pos                                  (0U)
#define AFIO_EINTSEL3_EINT8_PD_Msk                                  (0x3UL << AFIO_EINTSEL3_EINT8_PD_Pos)                          /*!< 0x00000003 */
#define AFIO_EINTSEL3_EINT8_PD                                      AFIO_EINTSEL3_EINT8_PD_Msk                                     /*!< PD[8] pin */

/* EINT9 configuration */
#define AFIO_EINTSEL3_EINT9_PA                                      0x00000000U                                                    /*!< PA[9] pin */
#define AFIO_EINTSEL3_EINT9_PB_Pos                                  (4U)
#define AFIO_EINTSEL3_EINT9_PB_Msk                                  (0x1UL << AFIO_EINTSEL3_EINT9_PB_Pos)                          /*!< 0x00000010 */
#define AFIO_EINTSEL3_EINT9_PB                                      AFIO_EINTSEL3_EINT9_PB_Msk                                     /*!< PB[9] pin */
#define AFIO_EINTSEL3_EINT9_PC_Pos                                  (5U)
#define AFIO_EINTSEL3_EINT9_PC_Msk                                  (0x1UL << AFIO_EINTSEL3_EINT9_PC_Pos)                          /*!< 0x00000020 */
#define AFIO_EINTSEL3_EINT9_PC                                      AFIO_EINTSEL3_EINT9_PC_Msk                                     /*!< PC[9] pin */
#define AFIO_EINTSEL3_EINT9_PD_Pos                                  (4U)
#define AFIO_EINTSEL3_EINT9_PD_Msk                                  (0x3UL << AFIO_EINTSEL3_EINT9_PD_Pos)                          /*!< 0x00000030 */
#define AFIO_EINTSEL3_EINT9_PD                                      AFIO_EINTSEL3_EINT9_PD_Msk                                     /*!< PD[9] pin */

/* EINT10 configuration */
#define AFIO_EINTSEL3_EINT10_PA                                     0x00000000U                                                    /*!< PA[10] pin */
#define AFIO_EINTSEL3_EINT10_PB_Pos                                 (8U)
#define AFIO_EINTSEL3_EINT10_PB_Msk                                 (0x1UL << AFIO_EINTSEL3_EINT10_PB_Pos)                         /*!< 0x00000100 */
#define AFIO_EINTSEL3_EINT10_PB                                     AFIO_EINTSEL3_EINT10_PB_Msk                                    /*!< PB[10] pin */
#define AFIO_EINTSEL3_EINT10_PC_Pos                                 (9U)
#define AFIO_EINTSEL3_EINT10_PC_Msk                                 (0x1UL << AFIO_EINTSEL3_EINT10_PC_Pos)                         /*!< 0x00000200 */
#define AFIO_EINTSEL3_EINT10_PC                                     AFIO_EINTSEL3_EINT10_PC_Msk                                    /*!< PC[10] pin */
#define AFIO_EINTSEL3_EINT10_PD_Pos                                 (8U)
#define AFIO_EINTSEL3_EINT10_PD_Msk                                 (0x3UL << AFIO_EINTSEL3_EINT10_PD_Pos)                         /*!< 0x00000300 */
#define AFIO_EINTSEL3_EINT10_PD                                     AFIO_EINTSEL3_EINT10_PD_Msk                                    /*!< PD[10] pin */

/* EINT11 configuration */
#define AFIO_EINTSEL3_EINT11_PA                                     0x00000000U                                                    /*!< PA[11] pin */
#define AFIO_EINTSEL3_EINT11_PB_Pos                                 (12U)
#define AFIO_EINTSEL3_EINT11_PB_Msk                                 (0x1UL << AFIO_EINTSEL3_EINT11_PB_Pos)                         /*!< 0x00001000 */
#define AFIO_EINTSEL3_EINT11_PB                                     AFIO_EINTSEL3_EINT11_PB_Msk                                    /*!< PB[11] pin */
#define AFIO_EINTSEL3_EINT11_PC_Pos                                 (13U)
#define AFIO_EINTSEL3_EINT11_PC_Msk                                 (0x1UL << AFIO_EINTSEL3_EINT11_PC_Pos)                         /*!< 0x00002000 */
#define AFIO_EINTSEL3_EINT11_PC                                     AFIO_EINTSEL3_EINT11_PC_Msk                                    /*!< PC[11] pin */
#define AFIO_EINTSEL3_EINT11_PD_Pos                                 (12U)
#define AFIO_EINTSEL3_EINT11_PD_Msk                                 (0x3UL << AFIO_EINTSEL3_EINT11_PD_Pos)                         /*!< 0x00003000 */
#define AFIO_EINTSEL3_EINT11_PD                                     AFIO_EINTSEL3_EINT11_PD_Msk                                    /*!< PD[11] pin */

/*****************  Bits definition for AFIO_EINTSEL4 register  ******************/
#define AFIO_EINTSEL4_EINT12_Pos                                    (0U)
#define AFIO_EINTSEL4_EINT12_Msk                                    (0xFUL << AFIO_EINTSEL4_EINT12_Pos)                            /*!< 0x0000000F */
#define AFIO_EINTSEL4_EINT12                                        AFIO_EINTSEL4_EINT12_Msk                                       /*!< EINT12[3:0] bits (External interrupt 12 configuration) */
#define AFIO_EINTSEL4_EINT13_Pos                                    (4U)
#define AFIO_EINTSEL4_EINT13_Msk                                    (0xFUL << AFIO_EINTSEL4_EINT13_Pos)                            /*!< 0x000000F0 */
#define AFIO_EINTSEL4_EINT13                                        AFIO_EINTSEL4_EINT13_Msk                                       /*!< EINT13[3:0] bits (External interrupt 13 configuration) */
#define AFIO_EINTSEL4_EINT14_Pos                                    (8U)
#define AFIO_EINTSEL4_EINT14_Msk                                    (0xFUL << AFIO_EINTSEL4_EINT14_Pos)                            /*!< 0x00000F00 */
#define AFIO_EINTSEL4_EINT14                                        AFIO_EINTSEL4_EINT14_Msk                                       /*!< EINT14[3:0] bits (External interrupt 14 configuration) */
#define AFIO_EINTSEL4_EINT15_Pos                                    (12U)
#define AFIO_EINTSEL4_EINT15_Msk                                    (0xFUL << AFIO_EINTSEL4_EINT15_Pos)                            /*!< 0x0000F000 */
#define AFIO_EINTSEL4_EINT15                                        AFIO_EINTSEL4_EINT15_Msk                                       /*!< EINT15[3:0] bits (External interrupt 15 configuration) */

/* EINT12 configuration */
#define AFIO_EINTSEL4_EINT12_PA                                     0x00000000U                                                    /*!< PA[12] pin */
#define AFIO_EINTSEL4_EINT12_PB_Pos                                 (0U)
#define AFIO_EINTSEL4_EINT12_PB_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT12_PB_Pos)                         /*!< 0x00000001 */
#define AFIO_EINTSEL4_EINT12_PB                                     AFIO_EINTSEL4_EINT12_PB_Msk                                    /*!< PB[12] pin */
#define AFIO_EINTSEL4_EINT12_PC_Pos                                 (1U)
#define AFIO_EINTSEL4_EINT12_PC_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT12_PC_Pos)                         /*!< 0x00000002 */
#define AFIO_EINTSEL4_EINT12_PC                                     AFIO_EINTSEL4_EINT12_PC_Msk                                    /*!< PC[12] pin */
#define AFIO_EINTSEL4_EINT12_PD_Pos                                 (0U)
#define AFIO_EINTSEL4_EINT12_PD_Msk                                 (0x3UL << AFIO_EINTSEL4_EINT12_PD_Pos)                         /*!< 0x00000003 */
#define AFIO_EINTSEL4_EINT12_PD                                     AFIO_EINTSEL4_EINT12_PD_Msk                                    /*!< PD[12] pin */

/* EINT13 configuration */
#define AFIO_EINTSEL4_EINT13_PA                                     0x00000000U                                                    /*!< PA[13] pin */
#define AFIO_EINTSEL4_EINT13_PB_Pos                                 (4U)
#define AFIO_EINTSEL4_EINT13_PB_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT13_PB_Pos)                         /*!< 0x00000010 */
#define AFIO_EINTSEL4_EINT13_PB                                     AFIO_EINTSEL4_EINT13_PB_Msk                                    /*!< PB[13] pin */
#define AFIO_EINTSEL4_EINT13_PC_Pos                                 (5U)
#define AFIO_EINTSEL4_EINT13_PC_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT13_PC_Pos)                         /*!< 0x00000020 */
#define AFIO_EINTSEL4_EINT13_PC                                     AFIO_EINTSEL4_EINT13_PC_Msk                                    /*!< PC[13] pin */
#define AFIO_EINTSEL4_EINT13_PD_Pos                                 (4U)
#define AFIO_EINTSEL4_EINT13_PD_Msk                                 (0x3UL << AFIO_EINTSEL4_EINT13_PD_Pos)                         /*!< 0x00000030 */
#define AFIO_EINTSEL4_EINT13_PD                                     AFIO_EINTSEL4_EINT13_PD_Msk                                    /*!< PD[13] pin */

/* EINT14 configuration */
#define AFIO_EINTSEL4_EINT14_PA                                     0x00000000U                                                    /*!< PA[14] pin */
#define AFIO_EINTSEL4_EINT14_PB_Pos                                 (8U)
#define AFIO_EINTSEL4_EINT14_PB_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT14_PB_Pos)                         /*!< 0x00000100 */
#define AFIO_EINTSEL4_EINT14_PB                                     AFIO_EINTSEL4_EINT14_PB_Msk                                    /*!< PB[14] pin */
#define AFIO_EINTSEL4_EINT14_PC_Pos                                 (9U)
#define AFIO_EINTSEL4_EINT14_PC_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT14_PC_Pos)                         /*!< 0x00000200 */
#define AFIO_EINTSEL4_EINT14_PC                                     AFIO_EINTSEL4_EINT14_PC_Msk                                    /*!< PC[14] pin */
#define AFIO_EINTSEL4_EINT14_PD_Pos                                 (8U)
#define AFIO_EINTSEL4_EINT14_PD_Msk                                 (0x3UL << AFIO_EINTSEL4_EINT14_PD_Pos)                         /*!< 0x00000300 */
#define AFIO_EINTSEL4_EINT14_PD                                     AFIO_EINTSEL4_EINT14_PD_Msk                                    /*!< PD[14] pin */

/* EINT15 configuration */
#define AFIO_EINTSEL4_EINT15_PA                                     0x00000000U                                                    /*!< PA[15] pin */
#define AFIO_EINTSEL4_EINT15_PB_Pos                                 (12U)
#define AFIO_EINTSEL4_EINT15_PB_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT15_PB_Pos)                         /*!< 0x00001000 */
#define AFIO_EINTSEL4_EINT15_PB                                     AFIO_EINTSEL4_EINT15_PB_Msk                                    /*!< PB[15] pin */
#define AFIO_EINTSEL4_EINT15_PC_Pos                                 (13U)
#define AFIO_EINTSEL4_EINT15_PC_Msk                                 (0x1UL << AFIO_EINTSEL4_EINT15_PC_Pos)                         /*!< 0x00002000 */
#define AFIO_EINTSEL4_EINT15_PC                                     AFIO_EINTSEL4_EINT15_PC_Msk                                    /*!< PC[15] pin */
#define AFIO_EINTSEL4_EINT15_PD_Pos                                 (12U)
#define AFIO_EINTSEL4_EINT15_PD_Msk                                 (0x3UL << AFIO_EINTSEL4_EINT15_PD_Pos)                         /*!< 0x00003000 */
#define AFIO_EINTSEL4_EINT15_PD                                     AFIO_EINTSEL4_EINT15_PD_Msk                                    /*!< PD[15] pin */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CTRL1 register  ********************/
#define I2C_CTRL1_I2CEN_Pos                                         (0U)
#define I2C_CTRL1_I2CEN_Msk                                         (0x1UL << I2C_CTRL1_I2CEN_Pos)                                 /*!< 0x00000001 */
#define I2C_CTRL1_I2CEN                                             I2C_CTRL1_I2CEN_Msk                                            /*!<Peripheral Enable                             */
#define I2C_CTRL1_SMBEN_Pos                                         (1U)
#define I2C_CTRL1_SMBEN_Msk                                         (0x1UL << I2C_CTRL1_SMBEN_Pos)                                 /*!< 0x00000002 */
#define I2C_CTRL1_SMBEN                                             I2C_CTRL1_SMBEN_Msk                                            /*!<SMBus Mode                                    */
#define I2C_CTRL1_SMBTCFG_Pos                                       (3U)
#define I2C_CTRL1_SMBTCFG_Msk                                       (0x1UL << I2C_CTRL1_SMBTCFG_Pos)                               /*!< 0x00000008 */
#define I2C_CTRL1_SMBTCFG                                           I2C_CTRL1_SMBTCFG_Msk                                          /*!<SMBus Type                                    */
#define I2C_CTRL1_ARPEN_Pos                                         (4U)
#define I2C_CTRL1_ARPEN_Msk                                         (0x1UL << I2C_CTRL1_ARPEN_Pos)                                 /*!< 0x00000010 */
#define I2C_CTRL1_ARPEN                                             I2C_CTRL1_ARPEN_Msk                                            /*!<ARP Enable                                    */
#define I2C_CTRL1_PECEN_Pos                                         (5U)
#define I2C_CTRL1_PECEN_Msk                                         (0x1UL << I2C_CTRL1_PECEN_Pos)                                 /*!< 0x00000020 */
#define I2C_CTRL1_PECEN                                             I2C_CTRL1_PECEN_Msk                                            /*!<PEC Enable                                    */
#define I2C_CTRL1_SRBEN_Pos                                         (6U)
#define I2C_CTRL1_SRBEN_Msk                                         (0x1UL << I2C_CTRL1_SRBEN_Pos)                                 /*!< 0x00000040 */
#define I2C_CTRL1_SRBEN                                             I2C_CTRL1_SRBEN_Msk                                            /*!<General Call Enable                           */
#define I2C_CTRL1_CLKSTRETCHD_Pos                                   (7U)
#define I2C_CTRL1_CLKSTRETCHD_Msk                                   (0x1UL << I2C_CTRL1_CLKSTRETCHD_Pos)                           /*!< 0x00000080 */
#define I2C_CTRL1_CLKSTRETCHD                                       I2C_CTRL1_CLKSTRETCHD_Msk                                      /*!<Clock Stretching Disable (Slave mode)         */
#define I2C_CTRL1_START_Pos                                         (8U)
#define I2C_CTRL1_START_Msk                                         (0x1UL << I2C_CTRL1_START_Pos)                                 /*!< 0x00000100 */
#define I2C_CTRL1_START                                             I2C_CTRL1_START_Msk                                            /*!<Start Generation                              */
#define I2C_CTRL1_STOP_Pos                                          (9U)
#define I2C_CTRL1_STOP_Msk                                          (0x1UL << I2C_CTRL1_STOP_Pos)                                  /*!< 0x00000200 */
#define I2C_CTRL1_STOP                                              I2C_CTRL1_STOP_Msk                                             /*!<Stop Generation                               */
#define I2C_CTRL1_ACKEN_Pos                                         (10U)
#define I2C_CTRL1_ACKEN_Msk                                         (0x1UL << I2C_CTRL1_ACKEN_Pos)                                 /*!< 0x00000400 */
#define I2C_CTRL1_ACKEN                                             I2C_CTRL1_ACKEN_Msk                                            /*!<Acknowledge Enable                            */
#define I2C_CTRL1_ACKPOS_Pos                                        (11U)
#define I2C_CTRL1_ACKPOS_Msk                                        (0x1UL << I2C_CTRL1_ACKPOS_Pos)                                /*!< 0x00000800 */
#define I2C_CTRL1_ACKPOS                                            I2C_CTRL1_ACKPOS_Msk                                           /*!<Acknowledge/PEC Position (for data reception) */
#define I2C_CTRL1_PEC_Pos                                           (12U)
#define I2C_CTRL1_PEC_Msk                                           (0x1UL << I2C_CTRL1_PEC_Pos)                                   /*!< 0x00001000 */
#define I2C_CTRL1_PEC                                               I2C_CTRL1_PEC_Msk                                              /*!<Packet Error Checking                         */
#define I2C_CTRL1_ALERTEN_Pos                                       (13U)
#define I2C_CTRL1_ALERTEN_Msk                                       (0x1UL << I2C_CTRL1_ALERTEN_Pos)                               /*!< 0x00002000 */
#define I2C_CTRL1_ALERTEN                                           I2C_CTRL1_ALERTEN_Msk                                          /*!<SMBus Alert                                   */
#define I2C_CTRL1_SWRST_Pos                                         (15U)
#define I2C_CTRL1_SWRST_Msk                                         (0x1UL << I2C_CTRL1_SWRST_Pos)                                 /*!< 0x00008000 */
#define I2C_CTRL1_SWRST                                             I2C_CTRL1_SWRST_Msk                                            /*!<Software Reset                                */

/*******************  Bit definition for I2C_CTRL2 register  ********************/
#define I2C_CTRL2_CLKFCFG_Pos                                       (0U)
#define I2C_CTRL2_CLKFCFG_Msk                                       (0x3FUL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x0000003F */
#define I2C_CTRL2_CLKFCFG                                           I2C_CTRL2_CLKFCFG_Msk                                          /*!<FREQ[5:0] bits (Peripheral Clock Frequency)   */
#define I2C_CTRL2_CLKFCFG_0                                         (0x01UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000001 */
#define I2C_CTRL2_CLKFCFG_1                                         (0x02UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000002 */
#define I2C_CTRL2_CLKFCFG_2                                         (0x04UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000004 */
#define I2C_CTRL2_CLKFCFG_3                                         (0x08UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000008 */
#define I2C_CTRL2_CLKFCFG_4                                         (0x10UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000010 */
#define I2C_CTRL2_CLKFCFG_5                                         (0x20UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000020 */

