xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*******************  Bit definition for BAKPR_DATA35 register  *******************/
#define BAKPR_DATA35_DATA_Pos                                       (0U)
#define BAKPR_DATA35_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA35_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA35_DATA                                           BAKPR_DATA35_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA36 register  *******************/
#define BAKPR_DATA36_DATA_Pos                                       (0U)
#define BAKPR_DATA36_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA36_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA36_DATA                                           BAKPR_DATA36_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA37 register  *******************/
#define BAKPR_DATA37_DATA_Pos                                       (0U)
#define BAKPR_DATA37_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA37_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA37_DATA                                           BAKPR_DATA37_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA38 register  *******************/
#define BAKPR_DATA38_DATA_Pos                                       (0U)
#define BAKPR_DATA38_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA38_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA38_DATA                                           BAKPR_DATA38_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA39 register  *******************/
#define BAKPR_DATA39_DATA_Pos                                       (0U)
#define BAKPR_DATA39_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA39_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA39_DATA                                           BAKPR_DATA39_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA40 register  *******************/
#define BAKPR_DATA40_DATA_Pos                                       (0U)
#define BAKPR_DATA40_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA40_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA40_DATA                                           BAKPR_DATA40_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA41 register  *******************/
#define BAKPR_DATA41_DATA_Pos                                       (0U)
#define BAKPR_DATA41_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA41_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA41_DATA                                           BAKPR_DATA41_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA42 register  *******************/
#define BAKPR_DATA42_DATA_Pos                                       (0U)
#define BAKPR_DATA42_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA42_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA42_DATA                                           BAKPR_DATA42_DATA_Msk                                          /*!< Backup data */

#define RTC_BKP_NUMBER   42

/*******************  Bit definition for BAKPR_CLKCAL register  *******************/
#define BAKPR_CLKCAL_CALVALUE_Pos                                   (0U)
#define BAKPR_CLKCAL_CALVALUE_Msk                                   (0x7FUL << BAKPR_CLKCAL_CALVALUE_Pos)                          /*!< 0x0000007F */
#define BAKPR_CLKCAL_CALVALUE                                       BAKPR_CLKCAL_CALVALUE_Msk                                      /*!< Calibration value */
#define BAKPR_CLKCAL_CALCOEN_Pos                                    (7U)
#define BAKPR_CLKCAL_CALCOEN_Msk                                    (0x1UL << BAKPR_CLKCAL_CALCOEN_Pos)                            /*!< 0x00000080 */
#define BAKPR_CLKCAL_CALCOEN                                        BAKPR_CLKCAL_CALCOEN_Msk                                       /*!< Calibration clock output enable */
#define BAKPR_CLKCAL_ASPOEN_Pos                                     (8U)
#define BAKPR_CLKCAL_ASPOEN_Msk                                     (0x1UL << BAKPR_CLKCAL_ASPOEN_Pos)                             /*!< 0x00000100 */
#define BAKPR_CLKCAL_ASPOEN                                         BAKPR_CLKCAL_ASPOEN_Msk                                        /*!< Alarm or Second pulse output enable */
#define BAKPR_CLKCAL_ASPOSEL_Pos                                    (9U)
#define BAKPR_CLKCAL_ASPOSEL_Msk                                    (0x1UL << BAKPR_CLKCAL_ASPOSEL_Pos)                            /*!< 0x00000200 */
#define BAKPR_CLKCAL_ASPOSEL                                        BAKPR_CLKCAL_ASPOSEL_Msk                                       /*!< Alarm or Second pulse output selection */

/*******************  Bit definition for BAKPR_CTRL register  *******************/
#define BAKPR_CTRL_TPFCFG_Pos                                       (0U)
#define BAKPR_CTRL_TPFCFG_Msk                                       (0x1UL << BAKPR_CTRL_TPFCFG_Pos)                               /*!< 0x00000001 */
#define BAKPR_CTRL_TPFCFG                                           BAKPR_CTRL_TPFCFG_Msk                                          /*!< Tamper Pin Function Configuration */
#define BAKPR_CTRL_TPALCFG_Pos                                      (1U)
#define BAKPR_CTRL_TPALCFG_Msk                                      (0x1UL << BAKPR_CTRL_TPALCFG_Pos)                              /*!< 0x00000002 */
#define BAKPR_CTRL_TPALCFG                                          BAKPR_CTRL_TPALCFG_Msk                                         /*!< Tamper Pin Active Level Configuration */

/*******************  Bit definition for BAKPR_CSTS register  *******************/
#define BAKPR_CSTS_TECLR_Pos                                        (0U)
#define BAKPR_CSTS_TECLR_Msk                                        (0x1UL << BAKPR_CSTS_TECLR_Pos)                                /*!< 0x00000001 */
#define BAKPR_CSTS_TECLR                                            BAKPR_CSTS_TECLR_Msk                                           /*!< Tamper Event Clear */
#define BAKPR_CSTS_TICLR_Pos                                        (1U)
#define BAKPR_CSTS_TICLR_Msk                                        (0x1UL << BAKPR_CSTS_TICLR_Pos)                                /*!< 0x00000002 */
#define BAKPR_CSTS_TICLR                                            BAKPR_CSTS_TICLR_Msk                                           /*!< Tamper Interrupt Clear */
#define BAKPR_CSTS_TPIEN_Pos                                        (2U)
#define BAKPR_CSTS_TPIEN_Msk                                        (0x1UL << BAKPR_CSTS_TPIEN_Pos)                                /*!< 0x00000004 */
#define BAKPR_CSTS_TPIEN                                            BAKPR_CSTS_TPIEN_Msk                                           /*!< Tamper Pin Interrupt Enable */
#define BAKPR_CSTS_TEFLG_Pos                                        (8U)
#define BAKPR_CSTS_TEFLG_Msk                                        (0x1UL << BAKPR_CSTS_TEFLG_Pos)                                /*!< 0x00000100 */
#define BAKPR_CSTS_TEFLG                                            BAKPR_CSTS_TEFLG_Msk                                           /*!< Tamper Event Flag */
#define BAKPR_CSTS_TIFLG_Pos                                        (9U)
#define BAKPR_CSTS_TIFLG_Msk                                        (0x1UL << BAKPR_CSTS_TIFLG_Pos)                                /*!< 0x00000200 */
#define BAKPR_CSTS_TIFLG                                            BAKPR_CSTS_TIFLG_Msk                                           /*!< Tamper Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCM_CTRL register  ********************/
#define RCM_CTRL_HSIEN_Pos                                          (0U)
#define RCM_CTRL_HSIEN_Msk                                          (0x1UL << RCM_CTRL_HSIEN_Pos)                                  /*!< 0x00000001 */
#define RCM_CTRL_HSIEN                                              RCM_CTRL_HSIEN_Msk
#define RCM_CTRL_HSIRDYFLG_Pos                                      (1U)
#define RCM_CTRL_HSIRDYFLG_Msk                                      (0x1UL << RCM_CTRL_HSIRDYFLG_Pos)                              /*!< 0x00000002 */
#define RCM_CTRL_HSIRDYFLG                                          RCM_CTRL_HSIRDYFLG_Msk

