xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
#define RCM_CTRL_HSITRM_Pos                                         (3U)
#define RCM_CTRL_HSITRM_Msk                                         (0x1FUL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x000000F8 */
#define RCM_CTRL_HSITRM                                             RCM_CTRL_HSITRM_Msk
#define RCM_CTRL_HSITRM_0                                           (0x01UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000008 */
#define RCM_CTRL_HSITRM_1                                           (0x02UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000010 */
#define RCM_CTRL_HSITRM_2                                           (0x04UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000020 */
#define RCM_CTRL_HSITRM_3                                           (0x08UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000040 */
#define RCM_CTRL_HSITRM_4                                           (0x10UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000080 */

#define RCM_CTRL_HSICAL_Pos                                         (8U)
#define RCM_CTRL_HSICAL_Msk                                         (0xFFUL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x0000FF00 */
#define RCM_CTRL_HSICAL                                             RCM_CTRL_HSICAL_Msk
#define RCM_CTRL_HSICAL_0                                           (0x01UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000100 */
#define RCM_CTRL_HSICAL_1                                           (0x02UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000200 */
#define RCM_CTRL_HSICAL_2                                           (0x04UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000400 */
#define RCM_CTRL_HSICAL_3                                           (0x08UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000800 */
#define RCM_CTRL_HSICAL_4                                           (0x10UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00001000 */
#define RCM_CTRL_HSICAL_5                                           (0x20UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00002000 */
#define RCM_CTRL_HSICAL_6                                           (0x40UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00004000 */
#define RCM_CTRL_HSICAL_7                                           (0x80UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00008000 */

#define RCM_CTRL_HSEEN_Pos                                          (16U)
#define RCM_CTRL_HSEEN_Msk                                          (0x1UL << RCM_CTRL_HSEEN_Pos)                                  /*!< 0x00010000 */
#define RCM_CTRL_HSEEN                                              RCM_CTRL_HSEEN_Msk
#define RCM_CTRL_HSERDYFLG_Pos                                      (17U)
#define RCM_CTRL_HSERDYFLG_Msk                                      (0x1UL << RCM_CTRL_HSERDYFLG_Pos)                              /*!< 0x00020000 */
#define RCM_CTRL_HSERDYFLG                                          RCM_CTRL_HSERDYFLG_Msk
#define RCM_CTRL_HSEBCFG_Pos                                        (18U)
#define RCM_CTRL_HSEBCFG_Msk                                        (0x1UL << RCM_CTRL_HSEBCFG_Pos)                                /*!< 0x00040000 */
#define RCM_CTRL_HSEBCFG                                            RCM_CTRL_HSEBCFG_Msk
#define RCM_CTRL_CSSEN_Pos                                          (19U)
#define RCM_CTRL_CSSEN_Msk                                          (0x1UL << RCM_CTRL_CSSEN_Pos)                                  /*!< 0x00080000 */
#define RCM_CTRL_CSSEN                                              RCM_CTRL_CSSEN_Msk
#define RCM_CTRL_PLL1EN_Pos                                         (24U)
#define RCM_CTRL_PLL1EN_Msk                                         (0x1UL << RCM_CTRL_PLL1EN_Pos)                                 /*!< 0x01000000 */
#define RCM_CTRL_PLL1EN                                             RCM_CTRL_PLL1EN_Msk
#define RCM_CTRL_PLL1RDYFLG_Pos                                     (25U)
#define RCM_CTRL_PLL1RDYFLG_Msk                                     (0x1UL << RCM_CTRL_PLL1RDYFLG_Pos)                             /*!< 0x02000000 */
#define RCM_CTRL_PLL1RDYFLG                                         RCM_CTRL_PLL1RDYFLG_Msk

/********************  Bit definition for RCM_CFG register  ******************/
/*!< SCLKSEL configuration */
#define RCM_CFG_SCLKSEL_Pos                                         (0U)
#define RCM_CFG_SCLKSEL_Msk                                         (0x3UL << RCM_CFG_SCLKSEL_Pos)                                 /*!< 0x00000003 */
#define RCM_CFG_SCLKSEL                                             RCM_CFG_SCLKSEL_Msk                                            /*!< SCLKSEL[1:0] bits (System clock Switch) */
#define RCM_CFG_SCLKSEL_0                                           (0x1UL << RCM_CFG_SCLKSEL_Pos)                                 /*!< 0x00000001 */
#define RCM_CFG_SCLKSEL_1                                           (0x2UL << RCM_CFG_SCLKSEL_Pos)                                 /*!< 0x00000002 */

#define RCM_CFG_SCLKSEL_HSI                                         0x00000000U                                                    /*!< HSI selected as system clock */
#define RCM_CFG_SCLKSEL_HSE                                         0x00000001U                                                    /*!< HSE selected as system clock */
#define RCM_CFG_SCLKSEL_PLL                                         0x00000002U                                                    /*!< PLL selected as system clock */

/*!< SCLKSWSTS configuration */
#define RCM_CFG_SCLKSWSTS_Pos                                       (2U)
#define RCM_CFG_SCLKSWSTS_Msk                                       (0x3UL << RCM_CFG_SCLKSWSTS_Pos)                               /*!< 0x0000000C */
#define RCM_CFG_SCLKSWSTS                                           RCM_CFG_SCLKSWSTS_Msk                                          /*!< SCLKSWSTS[1:0] bits (System Clock Switch Status) */
#define RCM_CFG_SCLKSWSTS_0                                         (0x1UL << RCM_CFG_SCLKSWSTS_Pos)                               /*!< 0x00000004 */
#define RCM_CFG_SCLKSWSTS_1                                         (0x2UL << RCM_CFG_SCLKSWSTS_Pos)                               /*!< 0x00000008 */

#define RCM_CFG_SCLKSWSTS_HSI                                       0x00000000U                                                    /*!< HSI oscillator used as system clock        */
#define RCM_CFG_SCLKSWSTS_HSE                                       0x00000004U                                                    /*!< HSE oscillator used as system clock        */
#define RCM_CFG_SCLKSWSTS_PLL                                       0x00000008U                                                    /*!< PLL used as system clock                   */

/*!< AHBPSC configuration */
#define RCM_CFG_AHBPSC_Pos                                          (4U)
#define RCM_CFG_AHBPSC_Msk                                          (0xFUL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x000000F0 */
#define RCM_CFG_AHBPSC                                              RCM_CFG_AHBPSC_Msk                                             /*!< AHBPSC[3:0] bits (AHB prescaler) */
#define RCM_CFG_AHBPSC_0                                            (0x1UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000010 */
#define RCM_CFG_AHBPSC_1                                            (0x2UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000020 */
#define RCM_CFG_AHBPSC_2                                            (0x4UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000040 */
#define RCM_CFG_AHBPSC_3                                            (0x8UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000080 */

#define RCM_CFG_AHBPSC_DIV1                                         0x00000000U                                                    /*!< SYSCLK not divided    */
#define RCM_CFG_AHBPSC_DIV2                                         0x00000080U                                                    /*!< SYSCLK divided by 2   */
#define RCM_CFG_AHBPSC_DIV4                                         0x00000090U                                                    /*!< SYSCLK divided by 4   */
#define RCM_CFG_AHBPSC_DIV8                                         0x000000A0U                                                    /*!< SYSCLK divided by 8   */
#define RCM_CFG_AHBPSC_DIV16                                        0x000000B0U                                                    /*!< SYSCLK divided by 16  */
#define RCM_CFG_AHBPSC_DIV64                                        0x000000C0U                                                    /*!< SYSCLK divided by 64  */
#define RCM_CFG_AHBPSC_DIV128                                       0x000000D0U                                                    /*!< SYSCLK divided by 128 */
#define RCM_CFG_AHBPSC_DIV256                                       0x000000E0U                                                    /*!< SYSCLK divided by 256 */
#define RCM_CFG_AHBPSC_DIV512                                       0x000000F0U                                                    /*!< SYSCLK divided by 512 */

/*!< APB1PSC configuration */
#define RCM_CFG_APB1PSC_Pos                                         (8U)
#define RCM_CFG_APB1PSC_Msk                                         (0x7UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00000700 */
#define RCM_CFG_APB1PSC                                             RCM_CFG_APB1PSC_Msk                                            /*!< APB1PSC[2:0] bits (APB1 prescaler) */
#define RCM_CFG_APB1PSC_0                                           (0x1UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00000100 */
#define RCM_CFG_APB1PSC_1                                           (0x2UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00000200 */
#define RCM_CFG_APB1PSC_2                                           (0x4UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00000400 */

#define RCM_CFG_APB1PSC_DIV1                                        0x00000000U                                                    /*!< HCLK not divided   */
#define RCM_CFG_APB1PSC_DIV2                                        0x00000400U                                                    /*!< HCLK divided by 2  */
#define RCM_CFG_APB1PSC_DIV4                                        0x00000500U                                                    /*!< HCLK divided by 4  */
#define RCM_CFG_APB1PSC_DIV8                                        0x00000600U                                                    /*!< HCLK divided by 8  */
#define RCM_CFG_APB1PSC_DIV16                                       0x00000700U                                                    /*!< HCLK divided by 16 */

/*!< APB2PSC configuration */
#define RCM_CFG_APB2PSC_Pos                                         (11U)
#define RCM_CFG_APB2PSC_Msk                                         (0x7UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00003800 */
#define RCM_CFG_APB2PSC                                             RCM_CFG_APB2PSC_Msk                                            /*!< APB2PSC[2:0] bits (APB2 prescaler) */
#define RCM_CFG_APB2PSC_0                                           (0x1UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00000800 */
#define RCM_CFG_APB2PSC_1                                           (0x2UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00001000 */
#define RCM_CFG_APB2PSC_2                                           (0x4UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00002000 */

#define RCM_CFG_APB2PSC_DIV1                                        0x00000000U                                                    /*!< HCLK not divided   */
#define RCM_CFG_APB2PSC_DIV2                                        0x00002000U                                                    /*!< HCLK divided by 2  */
#define RCM_CFG_APB2PSC_DIV4                                        0x00002800U                                                    /*!< HCLK divided by 4  */
#define RCM_CFG_APB2PSC_DIV8                                        0x00003000U                                                    /*!< HCLK divided by 8  */
#define RCM_CFG_APB2PSC_DIV16                                       0x00003800U                                                    /*!< HCLK divided by 16 */

/*!< ADCPSC configuration */
#define RCM_CFG_ADCPSC_Pos                                          (14U)
#define RCM_CFG_ADCPSC_Msk                                          (0x3UL << RCM_CFG_ADCPSC_Pos)                                  /*!< 0x0000C000 */
#define RCM_CFG_ADCPSC                                              RCM_CFG_ADCPSC_Msk                                             /*!< ADCPSC[1:0] bits (ADC prescaler) */
#define RCM_CFG_ADCPSC_0                                            (0x1UL << RCM_CFG_ADCPSC_Pos)                                  /*!< 0x00004000 */
#define RCM_CFG_ADCPSC_1                                            (0x2UL << RCM_CFG_ADCPSC_Pos)                                  /*!< 0x00008000 */

#define RCM_CFG_ADCPSC_DIV2                                         0x00000000U                                                    /*!< PCLK2 divided by 2 */
#define RCM_CFG_ADCPSC_DIV4                                         0x00004000U                                                    /*!< PCLK2 divided by 4 */
#define RCM_CFG_ADCPSC_DIV6                                         0x00008000U                                                    /*!< PCLK2 divided by 6 */
#define RCM_CFG_ADCPSC_DIV8                                         0x0000C000U                                                    /*!< PCLK2 divided by 8 */

#define RCM_CFG_PLLSRCSEL_Pos                                       (16U)
#define RCM_CFG_PLLSRCSEL_Msk                                       (0x1UL << RCM_CFG_PLLSRCSEL_Pos)                               /*!< 0x00010000 */
#define RCM_CFG_PLLSRCSEL                                           RCM_CFG_PLLSRCSEL_Msk                                          /*!< PLLSRCSEL bit (PLL clock source selection) */

#define RCM_CFG_PLLHSEPSC_Pos                                       (17U)
#define RCM_CFG_PLLHSEPSC_Msk                                       (0x1UL << RCM_CFG_PLLHSEPSC_Pos)                               /*!< 0x00020000 */
#define RCM_CFG_PLLHSEPSC                                           RCM_CFG_PLLHSEPSC_Msk                                          /*!< PLLHSEPSC bit (PLL HSE prescaler) */

#define RCM_CFG_PLLHSEPSC_HSE                                       0x00000000U                                                    /*!< HSE clock not divided for PLL entry */
#define RCM_CFG_PLLHSEPSC_HSE_DIV2                                  0x00020000U                                                    /*!< HSE clock divided by 2 for PLL entry */

