xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*!< PLLMULCFG configuration */
#define RCM_CFG_PLLMULCFG_Pos                                       (18U)
#define RCM_CFG_PLLMULCFG_Msk                                       (0xFUL << RCM_CFG_PLLMULCFG_Pos)                               /*!< 0x003C0000 */
#define RCM_CFG_PLLMULCFG                                           RCM_CFG_PLLMULCFG_Msk                                          /*!< PLLMULCFG[3:0] bits (PLL multiplication factor) */
#define RCM_CFG_PLLMULCFG_0                                         (0x1UL << RCM_CFG_PLLMULCFG_Pos)                               /*!< 0x00040000 */
#define RCM_CFG_PLLMULCFG_1                                         (0x2UL << RCM_CFG_PLLMULCFG_Pos)                               /*!< 0x00080000 */
#define RCM_CFG_PLLMULCFG_2                                         (0x4UL << RCM_CFG_PLLMULCFG_Pos)                               /*!< 0x00100000 */
#define RCM_CFG_PLLMULCFG_3                                         (0x8UL << RCM_CFG_PLLMULCFG_Pos)                               /*!< 0x00200000 */

#define RCM_CFG_PLLMULCFG2                                          0x00000000U                                                    /*!< PLL input clock * 2 */
#define RCM_CFG_PLLMULCFG3_Pos                                      (18U)
#define RCM_CFG_PLLMULCFG3_Msk                                      (0x1UL << RCM_CFG_PLLMULCFG3_Pos)                              /*!< 0x00040000 */
#define RCM_CFG_PLLMULCFG3                                          RCM_CFG_PLLMULCFG3_Msk                                         /*!< PLL input clock * 3 */
#define RCM_CFG_PLLMULCFG4_Pos                                      (19U)
#define RCM_CFG_PLLMULCFG4_Msk                                      (0x1UL << RCM_CFG_PLLMULCFG4_Pos)                              /*!< 0x00080000 */
#define RCM_CFG_PLLMULCFG4                                          RCM_CFG_PLLMULCFG4_Msk                                         /*!< PLL input clock * 4 */
#define RCM_CFG_PLLMULCFG5_Pos                                      (18U)
#define RCM_CFG_PLLMULCFG5_Msk                                      (0x3UL << RCM_CFG_PLLMULCFG5_Pos)                              /*!< 0x000C0000 */
#define RCM_CFG_PLLMULCFG5                                          RCM_CFG_PLLMULCFG5_Msk                                         /*!< PLL input clock * 5 */
#define RCM_CFG_PLLMULCFG6_Pos                                      (20U)
#define RCM_CFG_PLLMULCFG6_Msk                                      (0x1UL << RCM_CFG_PLLMULCFG6_Pos)                              /*!< 0x00100000 */
#define RCM_CFG_PLLMULCFG6                                          RCM_CFG_PLLMULCFG6_Msk                                         /*!< PLL input clock * 6 */
#define RCM_CFG_PLLMULCFG7_Pos                                      (18U)
#define RCM_CFG_PLLMULCFG7_Msk                                      (0x5UL << RCM_CFG_PLLMULCFG7_Pos)                              /*!< 0x00140000 */
#define RCM_CFG_PLLMULCFG7                                          RCM_CFG_PLLMULCFG7_Msk                                         /*!< PLL input clock * 7 */
#define RCM_CFG_PLLMULCFG8_Pos                                      (19U)
#define RCM_CFG_PLLMULCFG8_Msk                                      (0x3UL << RCM_CFG_PLLMULCFG8_Pos)                              /*!< 0x00180000 */
#define RCM_CFG_PLLMULCFG8                                          RCM_CFG_PLLMULCFG8_Msk                                         /*!< PLL input clock * 8 */
#define RCM_CFG_PLLMULCFG9_Pos                                      (18U)
#define RCM_CFG_PLLMULCFG9_Msk                                      (0x7UL << RCM_CFG_PLLMULCFG9_Pos)                              /*!< 0x001C0000 */
#define RCM_CFG_PLLMULCFG9                                          RCM_CFG_PLLMULCFG9_Msk                                         /*!< PLL input clock * 9 */
#define RCM_CFG_PLLMULCFG10_Pos                                     (21U)
#define RCM_CFG_PLLMULCFG10_Msk                                     (0x1UL << RCM_CFG_PLLMULCFG10_Pos)                             /*!< 0x00200000 */
#define RCM_CFG_PLLMULCFG10                                         RCM_CFG_PLLMULCFG10_Msk                                        /*!< PLL input clock * 10 */
#define RCM_CFG_PLLMULCFG11_Pos                                     (18U)
#define RCM_CFG_PLLMULCFG11_Msk                                     (0x9UL << RCM_CFG_PLLMULCFG11_Pos)                             /*!< 0x00240000 */
#define RCM_CFG_PLLMULCFG11                                         RCM_CFG_PLLMULCFG11_Msk                                        /*!< PLL input clock * 11 */
#define RCM_CFG_PLLMULCFG12_Pos                                     (19U)
#define RCM_CFG_PLLMULCFG12_Msk                                     (0x5UL << RCM_CFG_PLLMULCFG12_Pos)                             /*!< 0x00280000 */
#define RCM_CFG_PLLMULCFG12                                         RCM_CFG_PLLMULCFG12_Msk                                        /*!< PLL input clock * 12 */
#define RCM_CFG_PLLMULCFG13_Pos                                     (18U)
#define RCM_CFG_PLLMULCFG13_Msk                                     (0xBUL << RCM_CFG_PLLMULCFG13_Pos)                             /*!< 0x002C0000 */
#define RCM_CFG_PLLMULCFG13                                         RCM_CFG_PLLMULCFG13_Msk                                        /*!< PLL input clock * 13 */
#define RCM_CFG_PLLMULCFG14_Pos                                     (20U)
#define RCM_CFG_PLLMULCFG14_Msk                                     (0x3UL << RCM_CFG_PLLMULCFG14_Pos)                             /*!< 0x00300000 */
#define RCM_CFG_PLLMULCFG14                                         RCM_CFG_PLLMULCFG14_Msk                                        /*!< PLL input clock * 14 */
#define RCM_CFG_PLLMULCFG15_Pos                                     (18U)
#define RCM_CFG_PLLMULCFG15_Msk                                     (0xDUL << RCM_CFG_PLLMULCFG15_Pos)                             /*!< 0x00340000 */
#define RCM_CFG_PLLMULCFG15                                         RCM_CFG_PLLMULCFG15_Msk                                        /*!< PLL input clock * 15 */
#define RCM_CFG_PLLMULCFG16_Pos                                     (19U)
#define RCM_CFG_PLLMULCFG16_Msk                                     (0x7UL << RCM_CFG_PLLMULCFG16_Pos)                             /*!< 0x00380000 */
#define RCM_CFG_PLLMULCFG16                                         RCM_CFG_PLLMULCFG16_Msk                                        /*!< PLL input clock * 16 */

