xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
#define RCM_BDCTRL_RTCCLKEN_Pos                                     (15U)
#define RCM_BDCTRL_RTCCLKEN_Msk                                     (0x1UL << RCM_BDCTRL_RTCCLKEN_Pos)                             /*!< 0x00008000 */
#define RCM_BDCTRL_RTCCLKEN                                         RCM_BDCTRL_RTCCLKEN_Msk
#define RCM_BDCTRL_BDRST_Pos                                        (16U)
#define RCM_BDCTRL_BDRST_Msk                                        (0x1UL << RCM_BDCTRL_BDRST_Pos)                                /*!< 0x00010000 */
#define RCM_BDCTRL_BDRST                                            RCM_BDCTRL_BDRST_Msk

/********************  Bit definition for RCM_CSTS register  *******************/
#define RCM_CSTS_LSIEN_Pos                                          (0U)
#define RCM_CSTS_LSIEN_Msk                                          (0x1UL << RCM_CSTS_LSIEN_Pos)                                  /*!< 0x00000001 */
#define RCM_CSTS_LSIEN                                              RCM_CSTS_LSIEN_Msk
#define RCM_CSTS_LSIRDYFLG_Pos                                      (1U)
#define RCM_CSTS_LSIRDYFLG_Msk                                      (0x1UL << RCM_CSTS_LSIRDYFLG_Pos)                              /*!< 0x00000002 */
#define RCM_CSTS_LSIRDYFLG                                          RCM_CSTS_LSIRDYFLG_Msk
#define RCM_CSTS_RSTFLGCLR_Pos                                      (24U)
#define RCM_CSTS_RSTFLGCLR_Msk                                      (0x1UL << RCM_CSTS_RSTFLGCLR_Pos)                              /*!< 0x01000000 */
#define RCM_CSTS_RSTFLGCLR                                          RCM_CSTS_RSTFLGCLR_Msk
#define RCM_CSTS_PINRSTFLG_Pos                                      (26U)
#define RCM_CSTS_PINRSTFLG_Msk                                      (0x1UL << RCM_CSTS_PINRSTFLG_Pos)                              /*!< 0x04000000 */
#define RCM_CSTS_PINRSTFLG                                          RCM_CSTS_PINRSTFLG_Msk
#define RCM_CSTS_PODRSTFLG_Pos                                      (27U)
#define RCM_CSTS_PODRSTFLG_Msk                                      (0x1UL << RCM_CSTS_PODRSTFLG_Pos)                              /*!< 0x08000000 */
#define RCM_CSTS_PODRSTFLG                                          RCM_CSTS_PODRSTFLG_Msk
#define RCM_CSTS_SWRSTFLG_Pos                                       (28U)
#define RCM_CSTS_SWRSTFLG_Msk                                       (0x1UL << RCM_CSTS_SWRSTFLG_Pos)                               /*!< 0x10000000 */
#define RCM_CSTS_SWRSTFLG                                           RCM_CSTS_SWRSTFLG_Msk
#define RCM_CSTS_IWDTRSTFLG_Pos                                     (29U)
#define RCM_CSTS_IWDTRSTFLG_Msk                                     (0x1UL << RCM_CSTS_IWDTRSTFLG_Pos)                             /*!< 0x20000000 */
#define RCM_CSTS_IWDTRSTFLG                                         RCM_CSTS_IWDTRSTFLG_Msk
#define RCM_CSTS_WWDTRSTFLG_Pos                                     (30U)
#define RCM_CSTS_WWDTRSTFLG_Msk                                     (0x1UL << RCM_CSTS_WWDTRSTFLG_Pos)                             /*!< 0x40000000 */
#define RCM_CSTS_WWDTRSTFLG                                         RCM_CSTS_WWDTRSTFLG_Msk
#define RCM_CSTS_LPWRRSTFLG_Pos                                     (31U)
#define RCM_CSTS_LPWRRSTFLG_Msk                                     (0x1UL << RCM_CSTS_LPWRRSTFLG_Pos)                             /*!< 0x80000000 */
#define RCM_CSTS_LPWRRSTFLG                                         RCM_CSTS_LPWRRSTFLG_Msk
/* Legacy defines */
#define RCM_CSTS_PADRSTF                                            RCM_CSTS_PINRSTFLG
#define RCM_CSTS_WDGRSTF                                            RCM_CSTS_IWDTRSTFLG

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
#define RTC_ALARM_SUPPORT
#define RTC_COUNT_SUPPORT
/********************  Bits definition for RTC_CTRL register  *****************/
#define RTC_CTRL_SECIEN_Pos                                         (0U)
#define RTC_CTRL_SECIEN_Msk                                         (0x1UL << RTC_CTRL_SECIEN_Pos)                                 /*!< 0x00000001 */
#define RTC_CTRL_SECIEN                                             RTC_CTRL_SECIEN_Msk                                            /*!< Second interrupt enable */
#define RTC_CTRL_ALRIEN_Pos                                         (1U)
#define RTC_CTRL_ALRIEN_Msk                                         (0x1UL << RTC_CTRL_ALRIEN_Pos)                                 /*!< 0x00000002 */
#define RTC_CTRL_ALRIEN                                             RTC_CTRL_ALRIEN_Msk                                            /*!< Alarm interrupt enable */
#define RTC_CTRL_OVRIEN_Pos                                         (2U)
#define RTC_CTRL_OVRIEN_Msk                                         (0x1UL << RTC_CTRL_OVRIEN_Pos)                                 /*!< 0x00000004 */
#define RTC_CTRL_OVRIEN                                             RTC_CTRL_OVRIEN_Msk                                            /*!< Overflow interrupt enable */

/********************  Bits definition for RTC_CSTS register  *****************/
#define RTC_CSTS_SECFLG_Pos                                         (0U)
#define RTC_CSTS_SECFLG_Msk                                         (0x1UL << RTC_CSTS_SECFLG_Pos)                                 /*!< 0x00000001 */
#define RTC_CSTS_SECFLG                                             RTC_CSTS_SECFLG_Msk                                            /*!< Second flag */
#define RTC_CSTS_ALRFLG_Pos                                         (1U)
#define RTC_CSTS_ALRFLG_Msk                                         (0x1UL << RTC_CSTS_ALRFLG_Pos)                                 /*!< 0x00000002 */
#define RTC_CSTS_ALRFLG                                             RTC_CSTS_ALRFLG_Msk                                            /*!< Alarm flag */
#define RTC_CSTS_OVRFLG_Pos                                         (2U)
#define RTC_CSTS_OVRFLG_Msk                                         (0x1UL << RTC_CSTS_OVRFLG_Pos)                                 /*!< 0x00000004 */
#define RTC_CSTS_OVRFLG                                             RTC_CSTS_OVRFLG_Msk                                            /*!< Overflow flag */
#define RTC_CSTS_RSYNCFLG_Pos                                       (3U)
#define RTC_CSTS_RSYNCFLG_Msk                                       (0x1UL << RTC_CSTS_RSYNCFLG_Pos)                               /*!< 0x00000008 */
#define RTC_CSTS_RSYNCFLG                                           RTC_CSTS_RSYNCFLG_Msk                                          /*!< Registers synchronized flag */
#define RTC_CSTS_CFGMFLG_Pos                                        (4U)
#define RTC_CSTS_CFGMFLG_Msk                                        (0x1UL << RTC_CSTS_CFGMFLG_Pos)                                /*!< 0x00000010 */
#define RTC_CSTS_CFGMFLG                                            RTC_CSTS_CFGMFLG_Msk                                           /*!< Configuration mode enable flag */
#define RTC_CSTS_OCFLG_Pos                                          (5U)
#define RTC_CSTS_OCFLG_Msk                                          (0x1UL << RTC_CSTS_OCFLG_Pos)                                  /*!< 0x00000020 */
#define RTC_CSTS_OCFLG                                              RTC_CSTS_OCFLG_Msk                                             /*!< RTC operation complete flag */

/*******************  Bits definition for RTC_PSCRLDH register  *****************/
#define RTC_PSCRLDH_PSCRLDH_Pos                                     (0U)
#define RTC_PSCRLDH_PSCRLDH_Msk                                     (0xFUL << RTC_PSCRLDH_PSCRLDH_Pos)                             /*!< 0x0000000F */
#define RTC_PSCRLDH_PSCRLDH                                         RTC_PSCRLDH_PSCRLDH_Msk                                        /*!< RTC prescaler reload value high */

/*******************  Bits definition for RTC_PSCRLDL register  *****************/
#define RTC_PSCRLDL_PSCRLDL_Pos                                     (0U)
#define RTC_PSCRLDL_PSCRLDL_Msk                                     (0xFFFFUL << RTC_PSCRLDL_PSCRLDL_Pos)                          /*!< 0x0000FFFF */
#define RTC_PSCRLDL_PSCRLDL                                         RTC_PSCRLDL_PSCRLDL_Msk                                        /*!< RTC prescaler reload value low */

/*******************  Bits definition for RTC_PSCH register  *****************/
#define RTC_PSCH_PSCH_Pos                                           (0U)
#define RTC_PSCH_PSCH_Msk                                           (0xFUL << RTC_PSCH_PSCH_Pos)                                   /*!< 0x0000000F */
#define RTC_PSCH_PSCH                                               RTC_PSCH_PSCH_Msk                                              /*!< RTC clock divider high */

/*******************  Bits definition for RTC_PSCL register  *****************/
#define RTC_PSCL_PSCL_Pos                                           (0U)
#define RTC_PSCL_PSCL_Msk                                           (0xFFFFUL << RTC_PSCL_PSCL_Pos)                                /*!< 0x0000FFFF */
#define RTC_PSCL_PSCL                                               RTC_PSCL_PSCL_Msk                                              /*!< RTC clock divider low */

/*******************  Bits definition for RTC_CNTH register  *****************/
#define RTC_CNTH_CNTH_Pos                                           (0U)
#define RTC_CNTH_CNTH_Msk                                           (0xFFFFUL << RTC_CNTH_CNTH_Pos)                                /*!< 0x0000FFFF */
#define RTC_CNTH_CNTH                                               RTC_CNTH_CNTH_Msk                                              /*!< RTC counter high */

/*******************  Bits definition for RTC_CNTL register  *****************/
#define RTC_CNTL_CNTL_Pos                                           (0U)
#define RTC_CNTL_CNTL_Msk                                           (0xFFFFUL << RTC_CNTL_CNTL_Pos)                                /*!< 0x0000FFFF */
#define RTC_CNTL_CNTL                                               RTC_CNTL_CNTL_Msk                                              /*!< RTC counter low */

/*******************  Bits definition for RTC_ALRH register  *****************/
#define RTC_ALRH_ALRH_Pos                                           (0U)
#define RTC_ALRH_ALRH_Msk                                           (0xFFFFUL << RTC_ALRH_ALRH_Pos)                                /*!< 0x0000FFFF */
#define RTC_ALRH_ALRH                                               RTC_ALRH_ALRH_Msk                                              /*!< RTC alarm high */

/*******************  Bits definition for RTC_ALRL register  *****************/
#define RTC_ALRL_ALRL_Pos                                           (0U)
#define RTC_ALRL_ALRL_Msk                                           (0xFFFFUL << RTC_ALRL_ALRL_Pos)                                /*!< 0x0000FFFF */
#define RTC_ALRL_ALRL                                               RTC_ALRL_ALRL_Msk                                              /*!< RTC alarm low */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SPI_CTRL1 register  ********************/
#define SPI_CTRL1_CPHA_Pos                                          (0U)
#define SPI_CTRL1_CPHA_Msk                                          (0x1UL << SPI_CTRL1_CPHA_Pos)                                  /*!< 0x00000001 */
#define SPI_CTRL1_CPHA                                              SPI_CTRL1_CPHA_Msk                                             /*!<Clock Phase      */
#define SPI_CTRL1_CPOL_Pos                                          (1U)
#define SPI_CTRL1_CPOL_Msk                                          (0x1UL << SPI_CTRL1_CPOL_Pos)                                  /*!< 0x00000002 */
#define SPI_CTRL1_CPOL                                              SPI_CTRL1_CPOL_Msk                                             /*!<Clock Polarity   */
#define SPI_CTRL1_MSMCFG_Pos                                        (2U)
#define SPI_CTRL1_MSMCFG_Msk                                        (0x1UL << SPI_CTRL1_MSMCFG_Pos)                                /*!< 0x00000004 */
#define SPI_CTRL1_MSMCFG                                            SPI_CTRL1_MSMCFG_Msk                                           /*!<Master Selection */

#define SPI_CTRL1_BRSEL_Pos                                         (3U)
#define SPI_CTRL1_BRSEL_Msk                                         (0x7UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000038 */
#define SPI_CTRL1_BRSEL                                             SPI_CTRL1_BRSEL_Msk                                            /*!<BR[2:0] bits (Baud Rate Control) */
#define SPI_CTRL1_BRSEL_0                                           (0x1UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000008 */
#define SPI_CTRL1_BRSEL_1                                           (0x2UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000010 */
#define SPI_CTRL1_BRSEL_2                                           (0x4UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000020 */

#define SPI_CTRL1_SPIEN_Pos                                         (6U)
#define SPI_CTRL1_SPIEN_Msk                                         (0x1UL << SPI_CTRL1_SPIEN_Pos)                                 /*!< 0x00000040 */
#define SPI_CTRL1_SPIEN                                             SPI_CTRL1_SPIEN_Msk                                            /*!<SPI Enable                          */
#define SPI_CTRL1_LSBSEL_Pos                                        (7U)
#define SPI_CTRL1_LSBSEL_Msk                                        (0x1UL << SPI_CTRL1_LSBSEL_Pos)                                /*!< 0x00000080 */
#define SPI_CTRL1_LSBSEL                                            SPI_CTRL1_LSBSEL_Msk                                           /*!<Frame Format                        */
#define SPI_CTRL1_ISSEL_Pos                                         (8U)
#define SPI_CTRL1_ISSEL_Msk                                         (0x1UL << SPI_CTRL1_ISSEL_Pos)                                 /*!< 0x00000100 */
#define SPI_CTRL1_ISSEL                                             SPI_CTRL1_ISSEL_Msk                                            /*!<Internal slave select               */
#define SPI_CTRL1_SSEN_Pos                                          (9U)
#define SPI_CTRL1_SSEN_Msk                                          (0x1UL << SPI_CTRL1_SSEN_Pos)                                  /*!< 0x00000200 */
#define SPI_CTRL1_SSEN                                              SPI_CTRL1_SSEN_Msk                                             /*!<Software slave management           */
#define SPI_CTRL1_RXOMEN_Pos                                        (10U)
#define SPI_CTRL1_RXOMEN_Msk                                        (0x1UL << SPI_CTRL1_RXOMEN_Pos)                                /*!< 0x00000400 */
#define SPI_CTRL1_RXOMEN                                            SPI_CTRL1_RXOMEN_Msk                                           /*!<Receive only                        */
#define SPI_CTRL1_DFLSEL_Pos                                        (11U)
#define SPI_CTRL1_DFLSEL_Msk                                        (0x1UL << SPI_CTRL1_DFLSEL_Pos)                                /*!< 0x00000800 */
#define SPI_CTRL1_DFLSEL                                            SPI_CTRL1_DFLSEL_Msk                                           /*!<Data Frame Format                   */
#define SPI_CTRL1_CRCNXT_Pos                                        (12U)
#define SPI_CTRL1_CRCNXT_Msk                                        (0x1UL << SPI_CTRL1_CRCNXT_Pos)                                /*!< 0x00001000 */
#define SPI_CTRL1_CRCNXT                                            SPI_CTRL1_CRCNXT_Msk                                           /*!<Transmit CRC next                   */
#define SPI_CTRL1_CRCEN_Pos                                         (13U)
#define SPI_CTRL1_CRCEN_Msk                                         (0x1UL << SPI_CTRL1_CRCEN_Pos)                                 /*!< 0x00002000 */
#define SPI_CTRL1_CRCEN                                             SPI_CTRL1_CRCEN_Msk                                            /*!<Hardware CRC calculation enable     */
#define SPI_CTRL1_BMOEN_Pos                                         (14U)
#define SPI_CTRL1_BMOEN_Msk                                         (0x1UL << SPI_CTRL1_BMOEN_Pos)                                 /*!< 0x00004000 */
#define SPI_CTRL1_BMOEN                                             SPI_CTRL1_BMOEN_Msk                                            /*!<Output enable in bidirectional mode */
#define SPI_CTRL1_BMEN_Pos                                          (15U)
#define SPI_CTRL1_BMEN_Msk                                          (0x1UL << SPI_CTRL1_BMEN_Pos)                                  /*!< 0x00008000 */
#define SPI_CTRL1_BMEN                                              SPI_CTRL1_BMEN_Msk                                             /*!<Bidirectional data mode enable      */

