xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*******************  Bit definition for SPI_CRCPOLY register  ******************/
#define SPI_CRCPOLY_CRCPOLY_Pos                                     (0U)
#define SPI_CRCPOLY_CRCPOLY_Msk                                     (0xFFFFUL << SPI_CRCPOLY_CRCPOLY_Pos)                          /*!< 0x0000FFFF */
#define SPI_CRCPOLY_CRCPOLY                                         SPI_CRCPOLY_CRCPOLY_Msk                                        /*!<CRC polynomial register */

/******************  Bit definition for SPI_RXCRC register  ******************/
#define SPI_RXCRC_RXCRC_Pos                                         (0U)
#define SPI_RXCRC_RXCRC_Msk                                         (0xFFFFUL << SPI_RXCRC_RXCRC_Pos)                              /*!< 0x0000FFFF */
#define SPI_RXCRC_RXCRC                                             SPI_RXCRC_RXCRC_Msk                                            /*!<Rx CRC Register         */

/******************  Bit definition for SPI_TXCRC register  ******************/
#define SPI_TXCRC_TXCRC_Pos                                         (0U)
#define SPI_TXCRC_TXCRC_Msk                                         (0xFFFFUL << SPI_TXCRC_TXCRC_Pos)                              /*!< 0x0000FFFF */
#define SPI_TXCRC_TXCRC                                             SPI_TXCRC_TXCRC_Msk                                            /*!<Tx CRC Register         */

/******************  Bit definition for SPI_I2SCFG register  *****************/
#define SPI_I2SCFG_CHLEN_Pos                                        (0U)
#define SPI_I2SCFG_CHLEN_Msk                                        (0x1UL << SPI_I2SCFG_CHLEN_Pos)                                /*!< 0x00000001 */
#define SPI_I2SCFG_CHLEN                                            SPI_I2SCFG_CHLEN_Msk                                           /*!<Channel length (number of bits per audio channel) */

#define SPI_I2SCFG_DATALEN_Pos                                      (1U)
#define SPI_I2SCFG_DATALEN_Msk                                      (0x3UL << SPI_I2SCFG_DATALEN_Pos)                              /*!< 0x00000006 */
#define SPI_I2SCFG_DATALEN                                          SPI_I2SCFG_DATALEN_Msk                                         /*!<DATLEN[1:0] bits (Data length to be transferred)  */
#define SPI_I2SCFG_DATALEN_0                                        (0x1UL << SPI_I2SCFG_DATALEN_Pos)                              /*!< 0x00000002 */
#define SPI_I2SCFG_DATALEN_1                                        (0x2UL << SPI_I2SCFG_DATALEN_Pos)                              /*!< 0x00000004 */

#define SPI_I2SCFG_CPOL_Pos                                         (3U)
#define SPI_I2SCFG_CPOL_Msk                                         (0x1UL << SPI_I2SCFG_CPOL_Pos)                                 /*!< 0x00000008 */
#define SPI_I2SCFG_CPOL                                             SPI_I2SCFG_CPOL_Msk                                            /*!<steady state clock polarity               */

#define SPI_I2SCFG_I2SSSEL_Pos                                      (4U)
#define SPI_I2SCFG_I2SSSEL_Msk                                      (0x3UL << SPI_I2SCFG_I2SSSEL_Pos)                              /*!< 0x00000030 */
#define SPI_I2SCFG_I2SSSEL                                          SPI_I2SCFG_I2SSSEL_Msk                                         /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define SPI_I2SCFG_I2SSSEL_0                                        (0x1UL << SPI_I2SCFG_I2SSSEL_Pos)                              /*!< 0x00000010 */
#define SPI_I2SCFG_I2SSSEL_1                                        (0x2UL << SPI_I2SCFG_I2SSSEL_Pos)                              /*!< 0x00000020 */

#define SPI_I2SCFG_PFSSEL_Pos                                       (7U)
#define SPI_I2SCFG_PFSSEL_Msk                                       (0x1UL << SPI_I2SCFG_PFSSEL_Pos)                               /*!< 0x00000080 */
#define SPI_I2SCFG_PFSSEL                                           SPI_I2SCFG_PFSSEL_Msk                                          /*!<PCM frame synchronization                 */

#define SPI_I2SCFG_I2SMOD_Pos                                       (8U)
#define SPI_I2SCFG_I2SMOD_Msk                                       (0x3UL << SPI_I2SCFG_I2SMOD_Pos)                               /*!< 0x00000300 */
#define SPI_I2SCFG_I2SMOD                                           SPI_I2SCFG_I2SMOD_Msk                                          /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define SPI_I2SCFG_I2SMOD_0                                         (0x1UL << SPI_I2SCFG_I2SMOD_Pos)                               /*!< 0x00000100 */
#define SPI_I2SCFG_I2SMOD_1                                         (0x2UL << SPI_I2SCFG_I2SMOD_Pos)                               /*!< 0x00000200 */

#define SPI_I2SCFG_I2SEN_Pos                                        (10U)
#define SPI_I2SCFG_I2SEN_Msk                                        (0x1UL << SPI_I2SCFG_I2SEN_Pos)                                /*!< 0x00000400 */
#define SPI_I2SCFG_I2SEN                                            SPI_I2SCFG_I2SEN_Msk                                           /*!<I2S Enable         */
#define SPI_I2SCFG_MODESEL_Pos                                      (11U)
#define SPI_I2SCFG_MODESEL_Msk                                      (0x1UL << SPI_I2SCFG_MODESEL_Pos)                              /*!< 0x00000800 */
#define SPI_I2SCFG_MODESEL                                          SPI_I2SCFG_MODESEL_Msk                                         /*!<I2S mode selection */

/******************  Bit definition for SPI_I2SPSC register  *******************/
#define SPI_I2SPSC_I2SPSC_Pos                                       (0U)
#define SPI_I2SPSC_I2SPSC_Msk                                       (0xFFUL << SPI_I2SPSC_I2SPSC_Pos)                              /*!< 0x000000FF */
#define SPI_I2SPSC_I2SPSC                                           SPI_I2SPSC_I2SPSC_Msk                                          /*!<I2S Linear prescaler         */
#define SPI_I2SPSC_ODDPS_Pos                                        (8U)
#define SPI_I2SPSC_ODDPS_Msk                                        (0x1UL << SPI_I2SPSC_ODDPS_Pos)                                /*!< 0x00000100 */
#define SPI_I2SPSC_ODDPS                                            SPI_I2SPSC_ODDPS_Msk                                           /*!<Odd factor for the prescaler */
#define SPI_I2SPSC_MCOEN_Pos                                        (9U)
#define SPI_I2SPSC_MCOEN_Msk                                        (0x1UL << SPI_I2SPSC_MCOEN_Pos)                                /*!< 0x00000200 */
#define SPI_I2SPSC_MCOEN                                            SPI_I2SPSC_MCOEN_Msk                                           /*!<Master Clock Output Enable   */

/******************************************************************************/
/*                                                                            */
/*                                    TMR                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TMR_CTRL1 register  ********************/
#define TMR_CTRL1_CNTEN_Pos                                         (0U)
#define TMR_CTRL1_CNTEN_Msk                                         (0x1UL << TMR_CTRL1_CNTEN_Pos)                                 /*!< 0x00000001 */
#define TMR_CTRL1_CNTEN                                             TMR_CTRL1_CNTEN_Msk                                            /*!<Counter enable        */
#define TMR_CTRL1_UD_Pos                                            (1U)
#define TMR_CTRL1_UD_Msk                                            (0x1UL << TMR_CTRL1_UD_Pos)                                    /*!< 0x00000002 */
#define TMR_CTRL1_UD                                                TMR_CTRL1_UD_Msk                                               /*!<Update disable        */
#define TMR_CTRL1_URSSEL_Pos                                        (2U)
#define TMR_CTRL1_URSSEL_Msk                                        (0x1UL << TMR_CTRL1_URSSEL_Pos)                                /*!< 0x00000004 */
#define TMR_CTRL1_URSSEL                                            TMR_CTRL1_URSSEL_Msk                                           /*!<Update request source */
#define TMR_CTRL1_SPMEN_Pos                                         (3U)
#define TMR_CTRL1_SPMEN_Msk                                         (0x1UL << TMR_CTRL1_SPMEN_Pos)                                 /*!< 0x00000008 */
#define TMR_CTRL1_SPMEN                                             TMR_CTRL1_SPMEN_Msk                                            /*!<One pulse mode        */
#define TMR_CTRL1_CNTDIR_Pos                                        (4U)
#define TMR_CTRL1_CNTDIR_Msk                                        (0x1UL << TMR_CTRL1_CNTDIR_Pos)                                /*!< 0x00000010 */
#define TMR_CTRL1_CNTDIR                                            TMR_CTRL1_CNTDIR_Msk                                           /*!<Direction             */

#define TMR_CTRL1_CAMSEL_Pos                                        (5U)
#define TMR_CTRL1_CAMSEL_Msk                                        (0x3UL << TMR_CTRL1_CAMSEL_Pos)                                /*!< 0x00000060 */
#define TMR_CTRL1_CAMSEL                                            TMR_CTRL1_CAMSEL_Msk                                           /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TMR_CTRL1_CAMSEL_0                                          (0x1UL << TMR_CTRL1_CAMSEL_Pos)                                /*!< 0x0020 */
#define TMR_CTRL1_CAMSEL_1                                          (0x2UL << TMR_CTRL1_CAMSEL_Pos)                                /*!< 0x0040 */

