xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
#define TMR_CTRL1_ARPEN_Pos                                         (7U)
#define TMR_CTRL1_ARPEN_Msk                                         (0x1UL << TMR_CTRL1_ARPEN_Pos)                                 /*!< 0x00000080 */
#define TMR_CTRL1_ARPEN                                             TMR_CTRL1_ARPEN_Msk                                            /*!<Auto-reload preload enable     */

#define TMR_CTRL1_CLKDIV_Pos                                        (8U)
#define TMR_CTRL1_CLKDIV_Msk                                        (0x3UL << TMR_CTRL1_CLKDIV_Pos)                                /*!< 0x00000300 */
#define TMR_CTRL1_CLKDIV                                            TMR_CTRL1_CLKDIV_Msk                                           /*!<CKD[1:0] bits (clock division) */
#define TMR_CTRL1_CLKDIV_0                                          (0x1UL << TMR_CTRL1_CLKDIV_Pos)                                /*!< 0x0100 */
#define TMR_CTRL1_CLKDIV_1                                          (0x2UL << TMR_CTRL1_CLKDIV_Pos)                                /*!< 0x0200 */

/*******************  Bit definition for TMR_CTRL2 register  ********************/
#define TMR_CTRL2_CCPEN_Pos                                         (0U)
#define TMR_CTRL2_CCPEN_Msk                                         (0x1UL << TMR_CTRL2_CCPEN_Pos)                                 /*!< 0x00000001 */
#define TMR_CTRL2_CCPEN                                             TMR_CTRL2_CCPEN_Msk                                            /*!<Capture/Compare Preloaded Control        */
#define TMR_CTRL2_CCUSEL_Pos                                        (2U)
#define TMR_CTRL2_CCUSEL_Msk                                        (0x1UL << TMR_CTRL2_CCUSEL_Pos)                                /*!< 0x00000004 */
#define TMR_CTRL2_CCUSEL                                            TMR_CTRL2_CCUSEL_Msk                                           /*!<Capture/Compare Control Update Selection */
#define TMR_CTRL2_CCDSEL_Pos                                        (3U)
#define TMR_CTRL2_CCDSEL_Msk                                        (0x1UL << TMR_CTRL2_CCDSEL_Pos)                                /*!< 0x00000008 */
#define TMR_CTRL2_CCDSEL                                            TMR_CTRL2_CCDSEL_Msk                                           /*!<Capture/Compare DMA Selection            */

#define TMR_CTRL2_MMSEL_Pos                                         (4U)
#define TMR_CTRL2_MMSEL_Msk                                         (0x7UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x00000070 */
#define TMR_CTRL2_MMSEL                                             TMR_CTRL2_MMSEL_Msk                                            /*!<MMS[2:0] bits (Master Mode Selection) */
#define TMR_CTRL2_MMSEL_0                                           (0x1UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x0010 */
#define TMR_CTRL2_MMSEL_1                                           (0x2UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x0020 */
#define TMR_CTRL2_MMSEL_2                                           (0x4UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x0040 */

#define TMR_CTRL2_TI1SEL_Pos                                        (7U)
#define TMR_CTRL2_TI1SEL_Msk                                        (0x1UL << TMR_CTRL2_TI1SEL_Pos)                                /*!< 0x00000080 */
#define TMR_CTRL2_TI1SEL                                            TMR_CTRL2_TI1SEL_Msk                                           /*!<TI1 Selection */
#define TMR_CTRL2_OC1OIS_Pos                                        (8U)
#define TMR_CTRL2_OC1OIS_Msk                                        (0x1UL << TMR_CTRL2_OC1OIS_Pos)                                /*!< 0x00000100 */
#define TMR_CTRL2_OC1OIS                                            TMR_CTRL2_OC1OIS_Msk                                           /*!<Output Idle state 1 (OC1 output)  */
#define TMR_CTRL2_OC1NOIS_Pos                                       (9U)
#define TMR_CTRL2_OC1NOIS_Msk                                       (0x1UL << TMR_CTRL2_OC1NOIS_Pos)                               /*!< 0x00000200 */
#define TMR_CTRL2_OC1NOIS                                           TMR_CTRL2_OC1NOIS_Msk                                          /*!<Output Idle state 1 (OC1N output) */
#define TMR_CTRL2_OC2OIS_Pos                                        (10U)
#define TMR_CTRL2_OC2OIS_Msk                                        (0x1UL << TMR_CTRL2_OC2OIS_Pos)                                /*!< 0x00000400 */
#define TMR_CTRL2_OC2OIS                                            TMR_CTRL2_OC2OIS_Msk                                           /*!<Output Idle state 2 (OC2 output)  */
#define TMR_CTRL2_OC2NOIS_Pos                                       (11U)
#define TMR_CTRL2_OC2NOIS_Msk                                       (0x1UL << TMR_CTRL2_OC2NOIS_Pos)                               /*!< 0x00000800 */
#define TMR_CTRL2_OC2NOIS                                           TMR_CTRL2_OC2NOIS_Msk                                          /*!<Output Idle state 2 (OC2N output) */
#define TMR_CTRL2_OC3OIS_Pos                                        (12U)
#define TMR_CTRL2_OC3OIS_Msk                                        (0x1UL << TMR_CTRL2_OC3OIS_Pos)                                /*!< 0x00001000 */
#define TMR_CTRL2_OC3OIS                                            TMR_CTRL2_OC3OIS_Msk                                           /*!<Output Idle state 3 (OC3 output)  */
#define TMR_CTRL2_OC3NOIS_Pos                                       (13U)
#define TMR_CTRL2_OC3NOIS_Msk                                       (0x1UL << TMR_CTRL2_OC3NOIS_Pos)                               /*!< 0x00002000 */
#define TMR_CTRL2_OC3NOIS                                           TMR_CTRL2_OC3NOIS_Msk                                          /*!<Output Idle state 3 (OC3N output) */
#define TMR_CTRL2_OC4OIS_Pos                                        (14U)
#define TMR_CTRL2_OC4OIS_Msk                                        (0x1UL << TMR_CTRL2_OC4OIS_Pos)                                /*!< 0x00004000 */
#define TMR_CTRL2_OC4OIS                                            TMR_CTRL2_OC4OIS_Msk                                           /*!<Output Idle state 4 (OC4 output)  */

