xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/*******************  Bit definition for TMR_CNT register  ********************/
#define TMR_CNT_CNT_Pos                                             (0U)
#define TMR_CNT_CNT_Msk                                             (0xFFFFFFFFUL << TMR_CNT_CNT_Pos)                              /*!< 0xFFFFFFFF */
#define TMR_CNT_CNT                                                 TMR_CNT_CNT_Msk                                                /*!<Counter Value            */

/*******************  Bit definition for TMR_PSC register  ********************/
#define TMR_PSC_PSC_Pos                                             (0U)
#define TMR_PSC_PSC_Msk                                             (0xFFFFUL << TMR_PSC_PSC_Pos)                                  /*!< 0x0000FFFF */
#define TMR_PSC_PSC                                                 TMR_PSC_PSC_Msk                                                /*!<Prescaler Value          */

/*******************  Bit definition for TMR_AUTORLD register  ********************/
#define TMR_AUTORLD_AUTORLD_Pos                                     (0U)
#define TMR_AUTORLD_AUTORLD_Msk                                     (0xFFFFFFFFUL << TMR_AUTORLD_AUTORLD_Pos)                      /*!< 0xFFFFFFFF */
#define TMR_AUTORLD_AUTORLD                                         TMR_AUTORLD_AUTORLD_Msk                                        /*!<actual auto-reload Value */

/*******************  Bit definition for TMR_REPCNT register  ********************/
#define TMR_REPCNT_REPCNT_Pos                                       (0U)
#define TMR_REPCNT_REPCNT_Msk                                       (0xFFUL << TMR_REPCNT_REPCNT_Pos)                              /*!< 0x000000FF */
#define TMR_REPCNT_REPCNT                                           TMR_REPCNT_REPCNT_Msk                                          /*!<Repetition Counter Value */

/*******************  Bit definition for TMR_CC1 register  *******************/
#define TMR_CC1_CC1_Pos                                             (0U)
#define TMR_CC1_CC1_Msk                                             (0xFFFFUL << TMR_CC1_CC1_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC1_CC1                                                 TMR_CC1_CC1_Msk                                                /*!<Capture/Compare 1 Value  */

/*******************  Bit definition for TMR_CC2 register  *******************/
#define TMR_CC2_CC2_Pos                                             (0U)
#define TMR_CC2_CC2_Msk                                             (0xFFFFUL << TMR_CC2_CC2_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC2_CC2                                                 TMR_CC2_CC2_Msk                                                /*!<Capture/Compare 2 Value  */

/*******************  Bit definition for TMR_CC3 register  *******************/
#define TMR_CC3_CC3_Pos                                             (0U)
#define TMR_CC3_CC3_Msk                                             (0xFFFFUL << TMR_CC3_CC3_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC3_CC3                                                 TMR_CC3_CC3_Msk                                                /*!<Capture/Compare 3 Value  */

/*******************  Bit definition for TMR_CC4 register  *******************/
#define TMR_CC4_CC4_Pos                                             (0U)
#define TMR_CC4_CC4_Msk                                             (0xFFFFUL << TMR_CC4_CC4_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC4_CC4                                                 TMR_CC4_CC4_Msk                                                /*!<Capture/Compare 4 Value  */

/*******************  Bit definition for TMR_BDT register  *******************/
#define TMR_BDT_DTS_Pos                                             (0U)
#define TMR_BDT_DTS_Msk                                             (0xFFUL << TMR_BDT_DTS_Pos)                                    /*!< 0x000000FF */
#define TMR_BDT_DTS                                                 TMR_BDT_DTS_Msk                                                /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define TMR_BDT_DTS_0                                               (0x01UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0001 */
#define TMR_BDT_DTS_1                                               (0x02UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0002 */
#define TMR_BDT_DTS_2                                               (0x04UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0004 */
#define TMR_BDT_DTS_3                                               (0x08UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0008 */
#define TMR_BDT_DTS_4                                               (0x10UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0010 */
#define TMR_BDT_DTS_5                                               (0x20UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0020 */
#define TMR_BDT_DTS_6                                               (0x40UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0040 */
#define TMR_BDT_DTS_7                                               (0x80UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0080 */

#define TMR_BDT_LOCKCFG_Pos                                         (8U)
#define TMR_BDT_LOCKCFG_Msk                                         (0x3UL << TMR_BDT_LOCKCFG_Pos)                                 /*!< 0x00000300 */
#define TMR_BDT_LOCKCFG                                             TMR_BDT_LOCKCFG_Msk                                            /*!<LOCK[1:0] bits (Lock Configuration) */
#define TMR_BDT_LOCKCFG_0                                           (0x1UL << TMR_BDT_LOCKCFG_Pos)                                 /*!< 0x0100 */
#define TMR_BDT_LOCKCFG_1                                           (0x2UL << TMR_BDT_LOCKCFG_Pos)                                 /*!< 0x0200 */

#define TMR_BDT_IMOS_Pos                                            (10U)
#define TMR_BDT_IMOS_Msk                                            (0x1UL << TMR_BDT_IMOS_Pos)                                    /*!< 0x00000400 */
#define TMR_BDT_IMOS                                                TMR_BDT_IMOS_Msk                                               /*!<Off-State Selection for Idle mode */
#define TMR_BDT_RMOS_Pos                                            (11U)
#define TMR_BDT_RMOS_Msk                                            (0x1UL << TMR_BDT_RMOS_Pos)                                    /*!< 0x00000800 */
#define TMR_BDT_RMOS                                                TMR_BDT_RMOS_Msk                                               /*!<Off-State Selection for Run mode  */
#define TMR_BDT_BRKEN_Pos                                           (12U)
#define TMR_BDT_BRKEN_Msk                                           (0x1UL << TMR_BDT_BRKEN_Pos)                                   /*!< 0x00001000 */
#define TMR_BDT_BRKEN                                               TMR_BDT_BRKEN_Msk                                              /*!<Break enable                      */
#define TMR_BDT_BRKPOL_Pos                                          (13U)
#define TMR_BDT_BRKPOL_Msk                                          (0x1UL << TMR_BDT_BRKPOL_Pos)                                  /*!< 0x00002000 */
#define TMR_BDT_BRKPOL                                              TMR_BDT_BRKPOL_Msk                                             /*!<Break Polarity                    */
#define TMR_BDT_AOEN_Pos                                            (14U)
#define TMR_BDT_AOEN_Msk                                            (0x1UL << TMR_BDT_AOEN_Pos)                                    /*!< 0x00004000 */
#define TMR_BDT_AOEN                                                TMR_BDT_AOEN_Msk                                               /*!<Automatic Output enable           */
#define TMR_BDT_MOEN_Pos                                            (15U)
#define TMR_BDT_MOEN_Msk                                            (0x1UL << TMR_BDT_MOEN_Pos)                                    /*!< 0x00008000 */
#define TMR_BDT_MOEN                                                TMR_BDT_MOEN_Msk                                               /*!<Main Output enable                */

/*******************  Bit definition for TMR_DCTRL register  ********************/
#define TMR_DCTRL_DBADDR_Pos                                        (0U)
#define TMR_DCTRL_DBADDR_Msk                                        (0x1FUL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0000001F */
#define TMR_DCTRL_DBADDR                                            TMR_DCTRL_DBADDR_Msk                                           /*!<DBA[4:0] bits (DMA Base Address) */
#define TMR_DCTRL_DBADDR_0                                          (0x01UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0001 */
#define TMR_DCTRL_DBADDR_1                                          (0x02UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0002 */
#define TMR_DCTRL_DBADDR_2                                          (0x04UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0004 */
#define TMR_DCTRL_DBADDR_3                                          (0x08UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0008 */
#define TMR_DCTRL_DBADDR_4                                          (0x10UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0010 */

#define TMR_DCTRL_DBLEN_Pos                                         (8U)
#define TMR_DCTRL_DBLEN_Msk                                         (0x1FUL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x00001F00 */
#define TMR_DCTRL_DBLEN                                             TMR_DCTRL_DBLEN_Msk                                            /*!<DBL[4:0] bits (DMA Burst Length) */
#define TMR_DCTRL_DBLEN_0                                           (0x01UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0100 */
#define TMR_DCTRL_DBLEN_1                                           (0x02UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0200 */
#define TMR_DCTRL_DBLEN_2                                           (0x04UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0400 */
#define TMR_DCTRL_DBLEN_3                                           (0x08UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0800 */
#define TMR_DCTRL_DBLEN_4                                           (0x10UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x1000 */

/*******************  Bit definition for TMR_DMADDR register  *******************/
#define TMR_DMADDR_DMADDR_Pos                                       (0U)
#define TMR_DMADDR_DMADDR_Msk                                       (0xFFFFUL << TMR_DMADDR_DMADDR_Pos)                            /*!< 0x0000FFFF */
#define TMR_DMADDR_DMADDR                                           TMR_DMADDR_DMADDR_Msk                                          /*!<DMA register for burst accesses                    */

/*******************  Bit definition for TMR_OPT register  *********************/
#define TMR_OPT_RMPSEL_Pos                                           (10U)
#define TMR_OPT_RMPSEL_Msk                                           (0x1UL << TMR_OPT_RMPSEL_Pos)                                 /*!< 0x00000400 */
#define TMR_OPT_RMPSEL                                               TMR_OPT_RMPSEL_Msk                                            /*!<ITR1_RMP bits (TMR2 Internal trigger 1 remap) */

/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for USART_STS register  *******************/
#define USART_STS_PEFLG_Pos                                         (0U)
#define USART_STS_PEFLG_Msk                                         (0x1UL << USART_STS_PEFLG_Pos)                                 /*!< 0x00000001 */
#define USART_STS_PEFLG                                             USART_STS_PEFLG_Msk                                            /*!<Parity Error                 */
#define USART_STS_FEFLG_Pos                                         (1U)
#define USART_STS_FEFLG_Msk                                         (0x1UL << USART_STS_FEFLG_Pos)                                 /*!< 0x00000002 */
#define USART_STS_FEFLG                                             USART_STS_FEFLG_Msk                                            /*!<Framing Error                */
#define USART_STS_NEFLG_Pos                                         (2U)
#define USART_STS_NEFLG_Msk                                         (0x1UL << USART_STS_NEFLG_Pos)                                 /*!< 0x00000004 */
#define USART_STS_NEFLG                                             USART_STS_NEFLG_Msk                                            /*!<Noise Error Flag             */
#define USART_STS_OVREFLG_Pos                                       (3U)
#define USART_STS_OVREFLG_Msk                                       (0x1UL << USART_STS_OVREFLG_Pos)                               /*!< 0x00000008 */
#define USART_STS_OVREFLG                                           USART_STS_OVREFLG_Msk                                          /*!<OverRun Error                */
#define USART_STS_IDLEFLG_Pos                                       (4U)
#define USART_STS_IDLEFLG_Msk                                       (0x1UL << USART_STS_IDLEFLG_Pos)                               /*!< 0x00000010 */
#define USART_STS_IDLEFLG                                           USART_STS_IDLEFLG_Msk                                          /*!<IDLE line detected           */
#define USART_STS_RXBNEFLG_Pos                                      (5U)
#define USART_STS_RXBNEFLG_Msk                                      (0x1UL << USART_STS_RXBNEFLG_Pos)                              /*!< 0x00000020 */
#define USART_STS_RXBNEFLG                                          USART_STS_RXBNEFLG_Msk                                         /*!<Read Data Register Not Empty */
#define USART_STS_TXCFLG_Pos                                        (6U)
#define USART_STS_TXCFLG_Msk                                        (0x1UL << USART_STS_TXCFLG_Pos)                                /*!< 0x00000040 */
#define USART_STS_TXCFLG                                            USART_STS_TXCFLG_Msk                                           /*!<Transmission Complete        */
#define USART_STS_TXBEFLG_Pos                                       (7U)
#define USART_STS_TXBEFLG_Msk                                       (0x1UL << USART_STS_TXBEFLG_Pos)                               /*!< 0x00000080 */
#define USART_STS_TXBEFLG                                           USART_STS_TXBEFLG_Msk                                          /*!<Transmit Data Register Empty */
#define USART_STS_LBDFLG_Pos                                        (8U)
#define USART_STS_LBDFLG_Msk                                        (0x1UL << USART_STS_LBDFLG_Pos)                                /*!< 0x00000100 */
#define USART_STS_LBDFLG                                            USART_STS_LBDFLG_Msk                                           /*!<LIN Break Detection Flag     */
#define USART_STS_CTSFLG_Pos                                        (9U)
#define USART_STS_CTSFLG_Msk                                        (0x1UL << USART_STS_CTSFLG_Pos)                                /*!< 0x00000200 */
#define USART_STS_CTSFLG                                            USART_STS_CTSFLG_Msk                                           /*!<CTS Flag                     */

/*******************  Bit definition for USART_DATA register  *******************/
#define USART_DATA_DATA_Pos                                         (0U)
#define USART_DATA_DATA_Msk                                         (0x1FFUL << USART_DATA_DATA_Pos)                               /*!< 0x000001FF */
#define USART_DATA_DATA                                             USART_DATA_DATA_Msk                                            /*!<Data value */

/******************  Bit definition for USART_BR register  *******************/
#define USART_BR_FBR_Pos                                            (0U)
#define USART_BR_FBR_Msk                                            (0xFUL << USART_BR_FBR_Pos)                                    /*!< 0x0000000F */
#define USART_BR_FBR                                                USART_BR_FBR_Msk                                               /*!<Fraction of USARTDIV */
#define USART_BR_IBR_Pos                                            (4U)
#define USART_BR_IBR_Msk                                            (0xFFFUL << USART_BR_IBR_Pos)                                  /*!< 0x0000FFF0 */
#define USART_BR_IBR                                                USART_BR_IBR_Msk                                               /*!<Mantissa of USARTDIV */

/******************  Bit definition for USART_CTRL1 register  *******************/
#define USART_CTRL1_TXBF_Pos                                        (0U)
#define USART_CTRL1_TXBF_Msk                                        (0x1UL << USART_CTRL1_TXBF_Pos)                                /*!< 0x00000001 */
#define USART_CTRL1_TXBF                                            USART_CTRL1_TXBF_Msk                                           /*!<Send Break                             */
#define USART_CTRL1_RXMUTEEN_Pos                                    (1U)
#define USART_CTRL1_RXMUTEEN_Msk                                    (0x1UL << USART_CTRL1_RXMUTEEN_Pos)                            /*!< 0x00000002 */
#define USART_CTRL1_RXMUTEEN                                        USART_CTRL1_RXMUTEEN_Msk                                       /*!<Receiver wakeup                        */
#define USART_CTRL1_RXEN_Pos                                        (2U)
#define USART_CTRL1_RXEN_Msk                                        (0x1UL << USART_CTRL1_RXEN_Pos)                                /*!< 0x00000004 */
#define USART_CTRL1_RXEN                                            USART_CTRL1_RXEN_Msk                                           /*!<Receiver Enable                        */
#define USART_CTRL1_TXEN_Pos                                        (3U)
#define USART_CTRL1_TXEN_Msk                                        (0x1UL << USART_CTRL1_TXEN_Pos)                                /*!< 0x00000008 */
#define USART_CTRL1_TXEN                                            USART_CTRL1_TXEN_Msk                                           /*!<Transmitter Enable                     */
#define USART_CTRL1_IDLEIEN_Pos                                     (4U)
#define USART_CTRL1_IDLEIEN_Msk                                     (0x1UL << USART_CTRL1_IDLEIEN_Pos)                             /*!< 0x00000010 */
#define USART_CTRL1_IDLEIEN                                         USART_CTRL1_IDLEIEN_Msk                                        /*!<IDLE Interrupt Enable                  */
#define USART_CTRL1_RXBNEIEN_Pos                                    (5U)
#define USART_CTRL1_RXBNEIEN_Msk                                    (0x1UL << USART_CTRL1_RXBNEIEN_Pos)                            /*!< 0x00000020 */
#define USART_CTRL1_RXBNEIEN                                        USART_CTRL1_RXBNEIEN_Msk                                       /*!<RXNE Interrupt Enable                  */
#define USART_CTRL1_TXCIEN_Pos                                      (6U)
#define USART_CTRL1_TXCIEN_Msk                                      (0x1UL << USART_CTRL1_TXCIEN_Pos)                              /*!< 0x00000040 */
#define USART_CTRL1_TXCIEN                                          USART_CTRL1_TXCIEN_Msk                                         /*!<Transmission Complete Interrupt Enable */
#define USART_CTRL1_TXBEIEN_Pos                                     (7U)
#define USART_CTRL1_TXBEIEN_Msk                                     (0x1UL << USART_CTRL1_TXBEIEN_Pos)                             /*!< 0x00000080 */
#define USART_CTRL1_TXBEIEN                                         USART_CTRL1_TXBEIEN_Msk                                        /*!<TXE Interrupt Enable                   */
#define USART_CTRL1_PEIEN_Pos                                       (8U)
#define USART_CTRL1_PEIEN_Msk                                       (0x1UL << USART_CTRL1_PEIEN_Pos)                               /*!< 0x00000100 */
#define USART_CTRL1_PEIEN                                           USART_CTRL1_PEIEN_Msk                                          /*!<PE Interrupt Enable                    */
#define USART_CTRL1_PCFG_Pos                                        (9U)
#define USART_CTRL1_PCFG_Msk                                        (0x1UL << USART_CTRL1_PCFG_Pos)                                /*!< 0x00000200 */
#define USART_CTRL1_PCFG                                            USART_CTRL1_PCFG_Msk                                           /*!<Parity Selection                       */
#define USART_CTRL1_PCEN_Pos                                        (10U)
#define USART_CTRL1_PCEN_Msk                                        (0x1UL << USART_CTRL1_PCEN_Pos)                                /*!< 0x00000400 */
#define USART_CTRL1_PCEN                                            USART_CTRL1_PCEN_Msk                                           /*!<Parity Control Enable                  */
#define USART_CTRL1_WUPMCFG_Pos                                     (11U)
#define USART_CTRL1_WUPMCFG_Msk                                     (0x1UL << USART_CTRL1_WUPMCFG_Pos)                             /*!< 0x00000800 */
#define USART_CTRL1_WUPMCFG                                         USART_CTRL1_WUPMCFG_Msk                                        /*!<Wakeup method                          */
#define USART_CTRL1_DBLCFG_Pos                                      (12U)
#define USART_CTRL1_DBLCFG_Msk                                      (0x1UL << USART_CTRL1_DBLCFG_Pos)                              /*!< 0x00001000 */
#define USART_CTRL1_DBLCFG                                          USART_CTRL1_DBLCFG_Msk                                         /*!<Word length                            */
#define USART_CTRL1_UEN_Pos                                         (13U)
#define USART_CTRL1_UEN_Msk                                         (0x1UL << USART_CTRL1_UEN_Pos)                                 /*!< 0x00002000 */
#define USART_CTRL1_UEN                                             USART_CTRL1_UEN_Msk                                            /*!<USART Enable                           */

