xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
#define USB_OTG_DCTRL_TESTSEL_Pos                                   (4U)
#define USB_OTG_DCTRL_TESTSEL_Msk                                   (0x7UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000070 */
#define USB_OTG_DCTRL_TESTSEL                                       USB_OTG_DCTRL_TESTSEL_Msk                                      /*!< Test control */
#define USB_OTG_DCTRL_TESTSEL_0                                     (0x1UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000010 */
#define USB_OTG_DCTRL_TESTSEL_1                                     (0x2UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000020 */
#define USB_OTG_DCTRL_TESTSEL_2                                     (0x4UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000040 */
#define USB_OTG_DCTRL_GINAKSET_Pos                                  (7U)
#define USB_OTG_DCTRL_GINAKSET_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKSET_Pos)                          /*!< 0x00000080 */
#define USB_OTG_DCTRL_GINAKSET                                      USB_OTG_DCTRL_GINAKSET_Msk                                     /*!< Set global IN NAK         */
#define USB_OTG_DCTRL_GINAKCLR_Pos                                  (8U)
#define USB_OTG_DCTRL_GINAKCLR_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKCLR_Pos)                          /*!< 0x00000100 */
#define USB_OTG_DCTRL_GINAKCLR                                      USB_OTG_DCTRL_GINAKCLR_Msk                                     /*!< Clear global IN NAK       */
#define USB_OTG_DCTRL_GONAKSET_Pos                                  (9U)
#define USB_OTG_DCTRL_GONAKSET_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKSET_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DCTRL_GONAKSET                                      USB_OTG_DCTRL_GONAKSET_Msk                                     /*!< Set global OUT NAK        */
#define USB_OTG_DCTRL_GONAKCLR_Pos                                  (10U)
#define USB_OTG_DCTRL_GONAKCLR_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKCLR_Pos)                          /*!< 0x00000400 */
#define USB_OTG_DCTRL_GONAKCLR                                      USB_OTG_DCTRL_GONAKCLR_Msk                                     /*!< Clear global OUT NAK      */
#define USB_OTG_DCTRL_POPROGCMP_Pos                                 (11U)
#define USB_OTG_DCTRL_POPROGCMP_Msk                                 (0x1UL << USB_OTG_DCTRL_POPROGCMP_Pos)                         /*!< 0x00000800 */
#define USB_OTG_DCTRL_POPROGCMP                                     USB_OTG_DCTRL_POPROGCMP_Msk                                    /*!< Power-on programming done */

/********************  Bit definition for USB_OTG_HFIVL register  ********************/
#define USB_OTG_HFIVL_FIVL_Pos                                      (0U)
#define USB_OTG_HFIVL_FIVL_Msk                                      (0xFFFFUL << USB_OTG_HFIVL_FIVL_Pos)                           /*!< 0x0000FFFF */
#define USB_OTG_HFIVL_FIVL                                          USB_OTG_HFIVL_FIVL_Msk                                         /*!< Frame interval */

/********************  Bit definition for USB_OTG_HFIFM register  ********************/
#define USB_OTG_HFIFM_FNUM_Pos                                      (0U)
#define USB_OTG_HFIFM_FNUM_Msk                                      (0xFFFFUL << USB_OTG_HFIFM_FNUM_Pos)                           /*!< 0x0000FFFF */
#define USB_OTG_HFIFM_FNUM                                          USB_OTG_HFIFM_FNUM_Msk                                         /*!< Frame number         */
#define USB_OTG_HFIFM_FRTIME_Pos                                    (16U)
#define USB_OTG_HFIFM_FRTIME_Msk                                    (0xFFFFUL << USB_OTG_HFIFM_FRTIME_Pos)                         /*!< 0xFFFF0000 */
#define USB_OTG_HFIFM_FRTIME                                        USB_OTG_HFIFM_FRTIME_Msk                                       /*!< Frame time remaining */

/********************  Bit definition for USB_OTG_DSTS register  ********************/
#define USB_OTG_DSTS_SUSSTS_Pos                                     (0U)
#define USB_OTG_DSTS_SUSSTS_Msk                                     (0x1UL << USB_OTG_DSTS_SUSSTS_Pos)                             /*!< 0x00000001 */
#define USB_OTG_DSTS_SUSSTS                                         USB_OTG_DSTS_SUSSTS_Msk                                        /*!< Suspend status   */

#define USB_OTG_DSTS_ENUMSPD_Pos                                    (1U)
#define USB_OTG_DSTS_ENUMSPD_Msk                                    (0x3UL << USB_OTG_DSTS_ENUMSPD_Pos)                            /*!< 0x00000006 */
#define USB_OTG_DSTS_ENUMSPD                                        USB_OTG_DSTS_ENUMSPD_Msk                                       /*!< Enumerated speed */
#define USB_OTG_DSTS_ENUMSPD_0                                      (0x1UL << USB_OTG_DSTS_ENUMSPD_Pos)                            /*!< 0x00000002 */
#define USB_OTG_DSTS_ENUMSPD_1                                      (0x2UL << USB_OTG_DSTS_ENUMSPD_Pos)                            /*!< 0x00000004 */
#define USB_OTG_DSTS_ERTERR_Pos                                     (3U)
#define USB_OTG_DSTS_ERTERR_Msk                                     (0x1UL << USB_OTG_DSTS_ERTERR_Pos)                             /*!< 0x00000008 */
#define USB_OTG_DSTS_ERTERR                                         USB_OTG_DSTS_ERTERR_Msk                                        /*!< Erratic error     */
#define USB_OTG_DSTS_SOFNUM_Pos                                     (8U)
#define USB_OTG_DSTS_SOFNUM_Msk                                     (0x3FFFUL << USB_OTG_DSTS_SOFNUM_Pos)                          /*!< 0x003FFF00 */
#define USB_OTG_DSTS_SOFNUM                                         USB_OTG_DSTS_SOFNUM_Msk                                        /*!< Frame number of the received SOF */

