xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f402xx.h
/********************  Bit definition for USB_OTG_GINTMASK register  ********************/
#define USB_OTG_GINTMASK_MMISM_Pos                                  (1U)
#define USB_OTG_GINTMASK_MMISM_Msk                                  (0x1UL << USB_OTG_GINTMASK_MMISM_Pos)                          /*!< 0x00000002 */
#define USB_OTG_GINTMASK_MMISM                                      USB_OTG_GINTMASK_MMISM_Msk                                     /*!< Mode mismatch interrupt mask                        */
#define USB_OTG_GINTMASK_OTGM_Pos                                   (2U)
#define USB_OTG_GINTMASK_OTGM_Msk                                   (0x1UL << USB_OTG_GINTMASK_OTGM_Pos)                           /*!< 0x00000004 */
#define USB_OTG_GINTMASK_OTGM                                       USB_OTG_GINTMASK_OTGM_Msk                                      /*!< OTG interrupt mask                                  */
#define USB_OTG_GINTMASK_SOFM_Pos                                   (3U)
#define USB_OTG_GINTMASK_SOFM_Msk                                   (0x1UL << USB_OTG_GINTMASK_SOFM_Pos)                           /*!< 0x00000008 */
#define USB_OTG_GINTMASK_SOFM                                       USB_OTG_GINTMASK_SOFM_Msk                                      /*!< Start of frame mask                                 */
#define USB_OTG_GINTMASK_RXFNONEM_Pos                               (4U)
#define USB_OTG_GINTMASK_RXFNONEM_Msk                               (0x1UL << USB_OTG_GINTMASK_RXFNONEM_Pos)                       /*!< 0x00000010 */
#define USB_OTG_GINTMASK_RXFNONEM                                   USB_OTG_GINTMASK_RXFNONEM_Msk                                  /*!< Receive FIFO nonempty mask                          */
#define USB_OTG_GINTMASK_NPTXFEMM_Pos                               (5U)
#define USB_OTG_GINTMASK_NPTXFEMM_Msk                               (0x1UL << USB_OTG_GINTMASK_NPTXFEMM_Pos)                       /*!< 0x00000020 */
#define USB_OTG_GINTMASK_NPTXFEMM                                   USB_OTG_GINTMASK_NPTXFEMM_Msk                                  /*!< Nonperiodic TxFIFO empty mask                       */
#define USB_OTG_GINTMASK_GINNPNAKEM_Pos                             (6U)
#define USB_OTG_GINTMASK_GINNPNAKEM_Msk                             (0x1UL << USB_OTG_GINTMASK_GINNPNAKEM_Pos)                     /*!< 0x00000040 */
#define USB_OTG_GINTMASK_GINNPNAKEM                                 USB_OTG_GINTMASK_GINNPNAKEM_Msk                                /*!< Global nonperiodic IN NAK effective mask            */
#define USB_OTG_GINTMASK_GONAKEM_Pos                                (7U)
#define USB_OTG_GINTMASK_GONAKEM_Msk                                (0x1UL << USB_OTG_GINTMASK_GONAKEM_Pos)                        /*!< 0x00000080 */
#define USB_OTG_GINTMASK_GONAKEM                                    USB_OTG_GINTMASK_GONAKEM_Msk                                   /*!< Global OUT NAK effective mask                       */
#define USB_OTG_GINTMASK_ESUSM_Pos                                  (10U)
#define USB_OTG_GINTMASK_ESUSM_Msk                                  (0x1UL << USB_OTG_GINTMASK_ESUSM_Pos)                          /*!< 0x00000400 */
#define USB_OTG_GINTMASK_ESUSM                                      USB_OTG_GINTMASK_ESUSM_Msk                                     /*!< Early suspend mask                                  */
#define USB_OTG_GINTMASK_USBSUSM_Pos                                (11U)
#define USB_OTG_GINTMASK_USBSUSM_Msk                                (0x1UL << USB_OTG_GINTMASK_USBSUSM_Pos)                        /*!< 0x00000800 */
#define USB_OTG_GINTMASK_USBSUSM                                    USB_OTG_GINTMASK_USBSUSM_Msk                                   /*!< USB suspend mask                                    */
#define USB_OTG_GINTMASK_USBRSTM_Pos                                (12U)
#define USB_OTG_GINTMASK_USBRSTM_Msk                                (0x1UL << USB_OTG_GINTMASK_USBRSTM_Pos)                        /*!< 0x00001000 */
#define USB_OTG_GINTMASK_USBRSTM                                    USB_OTG_GINTMASK_USBRSTM_Msk                                   /*!< USB reset mask                                      */
#define USB_OTG_GINTMASK_ENUMDM_Pos                                 (13U)
#define USB_OTG_GINTMASK_ENUMDM_Msk                                 (0x1UL << USB_OTG_GINTMASK_ENUMDM_Pos)                         /*!< 0x00002000 */
#define USB_OTG_GINTMASK_ENUMDM                                     USB_OTG_GINTMASK_ENUMDM_Msk                                    /*!< Enumeration done mask                               */
#define USB_OTG_GINTMASK_ISOPDM_Pos                                 (14U)
#define USB_OTG_GINTMASK_ISOPDM_Msk                                 (0x1UL << USB_OTG_GINTMASK_ISOPDM_Pos)                         /*!< 0x00004000 */
#define USB_OTG_GINTMASK_ISOPDM                                     USB_OTG_GINTMASK_ISOPDM_Msk                                    /*!< Isochronous OUT packet dropped interrupt mask       */
#define USB_OTG_GINTMASK_EOPFM_Pos                                  (15U)
#define USB_OTG_GINTMASK_EOPFM_Msk                                  (0x1UL << USB_OTG_GINTMASK_EOPFM_Pos)                          /*!< 0x00008000 */
#define USB_OTG_GINTMASK_EOPFM                                      USB_OTG_GINTMASK_EOPFM_Msk                                     /*!< End of periodic frame interrupt mask                */
#define USB_OTG_GINTMASK_EPMISM_Pos                                 (17U)
#define USB_OTG_GINTMASK_EPMISM_Msk                                 (0x1UL << USB_OTG_GINTMASK_EPMISM_Pos)                         /*!< 0x00020000 */
#define USB_OTG_GINTMASK_EPMISM                                     USB_OTG_GINTMASK_EPMISM_Msk                                    /*!< Endpoint mismatch interrupt mask                    */
#define USB_OTG_GINTMASK_INEPM_Pos                                  (18U)
#define USB_OTG_GINTMASK_INEPM_Msk                                  (0x1UL << USB_OTG_GINTMASK_INEPM_Pos)                          /*!< 0x00040000 */
#define USB_OTG_GINTMASK_INEPM                                      USB_OTG_GINTMASK_INEPM_Msk                                     /*!< IN endpoints interrupt mask                         */
#define USB_OTG_GINTMASK_OUTEPM_Pos                                 (19U)
#define USB_OTG_GINTMASK_OUTEPM_Msk                                 (0x1UL << USB_OTG_GINTMASK_OUTEPM_Pos)                         /*!< 0x00080000 */
#define USB_OTG_GINTMASK_OUTEPM                                     USB_OTG_GINTMASK_OUTEPM_Msk                                    /*!< OUT endpoints interrupt mask                        */
#define USB_OTG_GINTMASK_IIINTXM_Pos                                (20U)
#define USB_OTG_GINTMASK_IIINTXM_Msk                                (0x1UL << USB_OTG_GINTMASK_IIINTXM_Pos)                        /*!< 0x00100000 */
#define USB_OTG_GINTMASK_IIINTXM                                    USB_OTG_GINTMASK_IIINTXM_Msk                                   /*!< Incomplete isochronous IN transfer mask             */
#define USB_OTG_GINTMASK_IP_OUTTXM_Pos                              (21U)
#define USB_OTG_GINTMASK_IP_OUTTXM_Msk                              (0x1UL << USB_OTG_GINTMASK_IP_OUTTXM_Pos)                      /*!< 0x00200000 */
#define USB_OTG_GINTMASK_IP_OUTTXM                                  USB_OTG_GINTMASK_IP_OUTTXM_Msk                                 /*!< Incomplete periodic transfer mask                   */
#define USB_OTG_GINTMASK_DFSUSM_Pos                                 (22U)
#define USB_OTG_GINTMASK_DFSUSM_Msk                                 (0x1UL << USB_OTG_GINTMASK_DFSUSM_Pos)                         /*!< 0x00400000 */
#define USB_OTG_GINTMASK_DFSUSM                                     USB_OTG_GINTMASK_DFSUSM_Msk                                    /*!< Data fetch suspended mask                           */
#define USB_OTG_GINTMASK_HPORTM_Pos                                 (24U)
#define USB_OTG_GINTMASK_HPORTM_Msk                                 (0x1UL << USB_OTG_GINTMASK_HPORTM_Pos)                         /*!< 0x01000000 */
#define USB_OTG_GINTMASK_HPORTM                                     USB_OTG_GINTMASK_HPORTM_Msk                                    /*!< Host port interrupt mask                            */
#define USB_OTG_GINTMASK_HCHM_Pos                                   (25U)
#define USB_OTG_GINTMASK_HCHM_Msk                                   (0x1UL << USB_OTG_GINTMASK_HCHM_Pos)                           /*!< 0x02000000 */
#define USB_OTG_GINTMASK_HCHM                                       USB_OTG_GINTMASK_HCHM_Msk                                      /*!< Host channels interrupt mask                        */
#define USB_OTG_GINTMASK_PTXFEM_Pos                                 (26U)
#define USB_OTG_GINTMASK_PTXFEM_Msk                                 (0x1UL << USB_OTG_GINTMASK_PTXFEM_Pos)                         /*!< 0x04000000 */
#define USB_OTG_GINTMASK_PTXFEM                                     USB_OTG_GINTMASK_PTXFEM_Msk                                    /*!< Periodic TxFIFO empty mask                          */
#define USB_OTG_GINTMASK_CIDSTSCM_Pos                               (28U)
#define USB_OTG_GINTMASK_CIDSTSCM_Msk                               (0x1UL << USB_OTG_GINTMASK_CIDSTSCM_Pos)                       /*!< 0x10000000 */
#define USB_OTG_GINTMASK_CIDSTSCM                                   USB_OTG_GINTMASK_CIDSTSCM_Msk                                  /*!< Connector ID status change mask                     */
#define USB_OTG_GINTMASK_DEDISM_Pos                                 (29U)
#define USB_OTG_GINTMASK_DEDISM_Msk                                 (0x1UL << USB_OTG_GINTMASK_DEDISM_Pos)                         /*!< 0x20000000 */
#define USB_OTG_GINTMASK_DEDISM                                     USB_OTG_GINTMASK_DEDISM_Msk                                    /*!< Disconnect detected interrupt mask                  */
#define USB_OTG_GINTMASK_SREQM_Pos                                  (30U)
#define USB_OTG_GINTMASK_SREQM_Msk                                  (0x1UL << USB_OTG_GINTMASK_SREQM_Pos)                          /*!< 0x40000000 */
#define USB_OTG_GINTMASK_SREQM                                      USB_OTG_GINTMASK_SREQM_Msk                                     /*!< Session request/new session detected interrupt mask */
#define USB_OTG_GINTMASK_RWAKEM_Pos                                 (31U)
#define USB_OTG_GINTMASK_RWAKEM_Msk                                 (0x1UL << USB_OTG_GINTMASK_RWAKEM_Pos)                         /*!< 0x80000000 */
#define USB_OTG_GINTMASK_RWAKEM                                     USB_OTG_GINTMASK_RWAKEM_Msk                                    /*!< Resume/remote wakeup detected interrupt mask        */

